sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
#include <WiFi.h>
#include <DNSServer.h>
#include <WebServer.h>
#include <Preferences.h>
#include <esp_system.h>
#include <esp_timer.h>
#include <ctype.h>
#include "esp_flash_encrypt.h"
#include "esp32-hal-rgb-led.h"
#include "mbedtls/md.h"
#include "mbedtls/pkcs5.h"
#include "mbedtls/aes.h"
#include "mbedtls/gcm.h"
#include "mbedtls/sha256.h"
#include "mbedtls/ecp.h"
#include "mbedtls/ecdh.h"
#include "mbedtls/ecdsa.h"
#include "USB.h"
#include "USBHID.h"
#include "USBHIDKeyboard.h"
#include "USBHIDMouse.h"
#include <cbor.h>

// FIDO2 CBOR parsing + crypto can be stack-heavy on ESP32-S3.
#line 25 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
size_t getArduinoLoopTaskStackSize();
#line 194 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static bool usb_kbm_hid_enabled();
#line 198 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static void usb_input_begin();
#line 205 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static bool usb_type_text(const String& text);
#line 215 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static bool usb_mouse_move(const int x, const int y);
#line 226 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static bool usb_mouse_click(const String& btn);
#line 245 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static void serial_diag_print_help();
#line 252 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static void serial_diag_print_status();
#line 259 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static void serial_diag_handle_line(const String& raw);
#line 285 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
static void serial_diag_task();
#line 25 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\esp32s3-wifi-kbm.ino"
SET_LOOP_TASK_STACK_SIZE(16 * 1024);  // 16KB loop task stack

// Stability mode for WebAuthn troubleshooting:
// - 1: disable Wi-Fi portal runtime so USB/FIDO gets all CPU+power budget
// - 0: run normal Wi-Fi portal + FIDO
#ifndef FIDO_STABILITY_MODE
#define FIDO_STABILITY_MODE 0
#endif

// USB mode switch:
// - 0 = FIDO-only HID (recommended for current Windows CTAP troubleshooting)
// - 1 = Composite HID keyboard + mouse + FIDO
#ifndef USB_ENABLE_KBM_HID
#define USB_ENABLE_KBM_HID 1
#endif

// Wi-Fi credentials for the ESP32-S3 access point
// Recommendation: change these before use.
static constexpr const char* AP_SSID = "ESP32-SuperMini";
static constexpr const char* AP_PASS = "password123";

// Token pairing (separate from the AP password):
// - Triple-tap BOOT to enable pairing for a short window.
// - In the portal, press "Pair" (or enter a previously saved token) to sign in.
// Note: secrets stored in NVS are protected at rest only if flash encryption is enabled.
static constexpr uint32_t PAIRING_WINDOW_MS = 60 * 1000;
static constexpr uint8_t  PAIRING_TAP_COUNT = 3;
static constexpr uint32_t TAP_MAX_MS = 350;
static constexpr uint32_t TAP_GAP_MS = 500;

// TOTP (6-digit / 30s by default). The shared secret is stored in NVS.
static constexpr uint8_t  TOTP_DEFAULT_DIGITS = 6;
static constexpr uint32_t TOTP_DEFAULT_PERIOD_S = 30;
static constexpr size_t   TOTP_KEY_MAX_BYTES = 64;

// HSM (P-256 / ES256) controls exposed over the authenticated web UI.
static constexpr size_t   HSM_PRIVKEY_BYTES = 32;
static constexpr size_t   HSM_PUBKEY_BYTES = 64; // X(32) || Y(32)
static constexpr size_t   HSM_SIGNATURE_DER_MAX = 80;
static constexpr size_t   HSM_SIGN_INPUT_MAX = 512;
static constexpr uint32_t HSM_SIGN_COOLDOWN_MS = 250;
static constexpr uint32_t HSM_PIN_UNLOCK_WINDOW_MS = 5 * 60 * 1000;
static constexpr uint32_t HSM_PIN_PBKDF2_ITERS = 30000;
static constexpr size_t   HSM_PIN_SALT_BYTES = 16;
static constexpr size_t   HSM_PIN_HASH_BYTES = 32;
static constexpr size_t   FIDO_PIN_HASH16_BYTES = 16;
static constexpr size_t   HSM_PIN_MIN_LEN = 4;
static constexpr size_t   HSM_PIN_MAX_LEN = 64;
static constexpr uint32_t HSM_PRESENCE_WINDOW_MS = 15 * 1000;
static constexpr uint32_t HSM_PRESENCE_HOLD_MIN_MS = 500;
static constexpr uint32_t HSM_PRESENCE_HOLD_MAX_MS = 1200;

// Admin unlock (physical presence) gating for sensitive actions (delete/export/restore).
// Hold BOOT for a few seconds to unlock briefly.
static constexpr uint32_t ADMIN_UNLOCK_WINDOW_MS = 60 * 1000;
static constexpr uint32_t ADMIN_UNLOCK_HOLD_MIN_MS = 1500;
static constexpr uint32_t ADMIN_UNLOCK_HOLD_MAX_MS = 4500;

// Credential inventory store used by the Keys page.
// Stored in NVS as a compact binary blob to allow listing/labeling/deletion and encrypted backup/restore.
static constexpr uint32_t CRED_STORE_MAGIC = 0x314D424BU; // "KBM1" (little-endian)
static constexpr uint16_t CRED_STORE_VERSION = 1;
static constexpr size_t   CRED_STORE_MAX_BYTES = 4096;
static constexpr size_t   CRED_MAX_RPID_LEN = 64;
static constexpr size_t   CRED_MAX_LABEL_LEN = 64;
static constexpr size_t   CRED_MAX_ID_LEN = 64;
static constexpr size_t   CRED_MAX_SECRET_LEN = 128;

static constexpr uint8_t  DNS_PORT = 53;
static constexpr uint16_t HTTP_PORT = 80;

// BOOT button is typically GPIO0 on ESP32-S3 dev boards (including many SuperMini variants).
static constexpr uint8_t  BOOT_BUTTON_PIN = 0;

// Optional: set to 1 if your LED is wired active-low.
#ifndef MODE_LED_ACTIVE_LOW
#define MODE_LED_ACTIVE_LOW 0
#endif

#if defined(RGB_BUILTIN)
static constexpr int MODE_LED_PIN = RGB_BUILTIN;
static constexpr bool MODE_LED_IS_RGB = true;
#elif defined(LED_BUILTIN)
static constexpr int MODE_LED_PIN = LED_BUILTIN;
static constexpr bool MODE_LED_IS_RGB = false;
#else
static constexpr int MODE_LED_PIN = -1;
static constexpr bool MODE_LED_IS_RGB = false;
#endif

DNSServer dnsServer;
WebServer server(HTTP_PORT);

// Force TinyUSB HID interface protocol to "none" so the composite HID descriptor
// can be recognized for FIDO usage in desktop WebAuthn flows.
// Without this, keyboard-first initialization may advertise boot-keyboard protocol
// and some hosts won't surface it as a security key transport.
USBHID _hidInterfaceMode(HID_ITF_PROTOCOL_NONE);

#if USB_ENABLE_KBM_HID
USBHIDKeyboard Keyboard;
USBHIDMouse Mouse;
#endif

enum class AttestationProfile : uint8_t {
  Diy = 0,
  None = 1,
};

static Preferences prefs;
static uint32_t buttonDownSince = 0;
static bool buttonDown = false;

static char pairTokenHex[33] = {0};
static uint32_t pairingActiveUntil = 0;
static bool pairingRotateArmed = false;

static uint32_t adminUnlockedUntil = 0;
static AttestationProfile attestationProfile = AttestationProfile::Diy;

static uint8_t tapCount = 0;
static uint32_t lastTapAt = 0;
static bool pendingSingleTap = false;
static uint32_t pendingSingleTapDue = 0;

static uint8_t totpKey[TOTP_KEY_MAX_BYTES];
static size_t totpKeyLen = 0;
static uint8_t totpDigits = TOTP_DEFAULT_DIGITS;
static uint32_t totpPeriodS = TOTP_DEFAULT_PERIOD_S;
static bool totpAppendEnter = false;

static bool timeSynced = false;
static int64_t timeOffsetUs = 0;
static bool apManagementMode = false; // true = management-only AP (no /move /click /type)

struct RestoreUploadState {
  uint8_t* buf = nullptr;
  size_t len = 0;
  size_t cap = 0;
  bool error = false;
};

static RestoreUploadState restoreUpload;

struct HsmState {
  bool loaded = false;
  uint8_t priv[HSM_PRIVKEY_BYTES] = {0};
  uint8_t pub[HSM_PUBKEY_BYTES] = {0}; // X || Y
  uint32_t createdAt = 0;              // unix seconds if known, else 0
  uint32_t signCount = 0;              // runtime counter (not persisted)
  uint32_t lastSignMs = 0;
};

static HsmState hsmState;
static bool hsmPinConfigured = false;
static uint8_t hsmPinSalt[HSM_PIN_SALT_BYTES] = {0};
static uint8_t hsmPinHash[HSM_PIN_HASH_BYTES] = {0};
static uint8_t fidoPinHash16[FIDO_PIN_HASH16_BYTES] = {0}; // left16(SHA-256(PIN)) for CTAP ClientPIN
static bool fidoPinHash16Valid = false;
static uint32_t hsmPinUnlockedUntil = 0;
static uint32_t hsmPresenceUntil = 0;

