sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
// FIDO2/CTAP2 over USB HID (implemented in `fido2_ctap2.ino`).
void fido_begin();
void fido_task();
bool fido_waiting_for_user_presence();
void fido_diag_clear();
void fido_diag_build_json(String& outJson);

static bool usb_kbm_hid_enabled() {
  return USB_ENABLE_KBM_HID != 0;
}

static void usb_input_begin() {
#if USB_ENABLE_KBM_HID
  Keyboard.begin();
  Mouse.begin();
#endif
}

static bool usb_type_text(const String& text) {
#if USB_ENABLE_KBM_HID
  Keyboard.print(text);
  return true;
#else
  (void)text;
  return false;
#endif
}

static bool usb_mouse_move(const int x, const int y) {
#if USB_ENABLE_KBM_HID
  Mouse.move(static_cast<int8_t>(x), static_cast<int8_t>(y));
  return true;
#else
  (void)x;
  (void)y;
  return false;
#endif
}

static bool usb_mouse_click(const String& btn) {
#if USB_ENABLE_KBM_HID
  if (btn == "left") {
    Mouse.click(MOUSE_LEFT);
    return true;
  }
  if (btn == "right") {
    Mouse.click(MOUSE_RIGHT);
    return true;
  }
  return false;
#else
  (void)btn;
  return false;
#endif
}

static String serialDiagLine;

static void serial_diag_print_help() {
  Serial.println("FIDO serial diag commands:");
  Serial.println("  diag        -> print FIDO diag JSON");
  Serial.println("  diag reset  -> clear FIDO diag counters");
  Serial.println("  help        -> show this help");
}

static void serial_diag_print_status() {
  String json;
  fido_diag_build_json(json);
  Serial.print("FIDO_DIAG ");
  Serial.println(json);
}

static void serial_diag_handle_line(const String& raw) {
  String cmd = raw;
  cmd.trim();
  if (cmd.length() == 0) return;

  if (cmd.equalsIgnoreCase("diag") || cmd.equalsIgnoreCase("diag status") || cmd.equalsIgnoreCase("status")) {
    serial_diag_print_status();
    return;
  }

  if (cmd.equalsIgnoreCase("diag reset") || cmd.equalsIgnoreCase("reset")) {
    fido_diag_clear();
    Serial.println("FIDO_DIAG reset");
    return;
  }

  if (cmd.equalsIgnoreCase("help") || cmd.equalsIgnoreCase("?")) {
    serial_diag_print_help();
    return;
  }

  Serial.print("FIDO_DIAG unknown command: ");
  Serial.println(cmd);
  serial_diag_print_help();
}

static void serial_diag_task() {
  while (Serial.available() > 0) {
    const int c = Serial.read();
    if (c < 0) break;
    if (c == '\n' || c == '\r') {
      if (serialDiagLine.length() > 0) {
        serial_diag_handle_line(serialDiagLine);
        serialDiagLine = "";
      }
      continue;
    }
    if (c >= 32 && c <= 126) {
      if (serialDiagLine.length() < 160) {
        serialDiagLine += static_cast<char>(c);
      }
    }
  }
}

// --- HTML & JAVASCRIPT FOR THE WEB UI ---
static const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 Remote</title>
  <style>
    * {
      touch-action: none !important;
      overscroll-behavior: none !important;
      -webkit-touch-callout: none;
      -webkit-user-select: none;
      user-select: none;
    }

    html, body {
      position: fixed; top: 0; left: 0; right: 0; bottom: 0;
      width: 100%; height: 100%; overflow: hidden;
      font-family: Arial, sans-serif; text-align: center; margin: 0; padding: 0;
      background: #121212; color: white;
    }

    input {
      touch-action: auto !important;
      -webkit-user-select: auto;
      user-select: auto;
      padding: 12px; font-size: 16px; width: calc(100% - 100px); border-radius: 8px; border: none;
    }

    .container { padding: 15px; height: calc(100% - 30px); display: flex; flex-direction: column; }
    h2 { margin-top: 5px; flex: none; }

    #trackpad {
      flex-grow: 1; width: 100%; background: #2a2a2a; border-radius: 15px;
      margin-top: 15px; margin-bottom: 5px; border: 2px solid #444;
      touch-action: none;
    }

    .btn-row { display: flex; justify-content: space-between; margin-top: 5px; flex: none; }
    button { flex: 1; padding: 15px; font-size: 16px; margin: 5px; border-radius: 8px; border: none; background: #007bff; color: white; cursor: pointer; }
    button:active { background: #0056b3; }
    .input-row { display: flex; justify-content: center; align-items: center; gap: 10px; flex: none; }
  </style>
</head>
<body>
  <div class="container">
    <div style="display:flex; justify-content:space-between; align-items:center; gap:10px;">
      <h2 style="margin: 5px 0;">ESP32 Input Control</h2>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/ap" style="color:#9ecbff; text-decoration:none; font-size:14px;">AP</a>
        <a href="/diag" style="color:#9ecbff; text-decoration:none; font-size:14px;">Diag</a>
        <a href="/keys" style="color:#9ecbff; text-decoration:none; font-size:14px;">Keys</a>
        <a href="/hsm" style="color:#9ecbff; text-decoration:none; font-size:14px;">HSM</a>
        <a href="/totp" style="color:#9ecbff; text-decoration:none; font-size:14px;">TOTP</a>
        <a href="/logout" style="color:#9ecbff; text-decoration:none; font-size:14px;">Sign out</a>
      </div>
    </div>
    <div class="input-row">
      <input type="text" id="textInput" placeholder="Type here...">
      <button style="width: 80px; flex: none;" onclick="sendText()">Send</button>
    </div>
    <div id="trackpad"></div>
    <div class="btn-row">
      <button onclick="sendClick('left')">Left Click</button>
      <button onclick="sendClick('right')">Right Click</button>
    </div>
  </div>

  <script>
    window.addEventListener('touchmove', function(e) {
      if (e.target.tagName !== 'INPUT') e.preventDefault();
    }, { passive: false, capture: true });

    let lastX = 0, lastY = 0, isDown = false;
    let accX = 0, accY = 0, isSending = false;
    let tapTime = 0, tapMoved = false, multiTouch = false;
    let activePointers = 0;

    const pad = document.getElementById('trackpad');

    function authFetch(url) {
      return fetch(url, { cache: 'no-store' }).then((r) => {
        if (r.status === 401) {
          window.location = '/';
          throw new Error('auth');
        }
        return r;
      });
    }

    // Keep time in sync for features that require it (ex: TOTP).
    authFetch('/time?ms=' + Date.now()).catch(() => {});

