sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    function sendText() {
      let text = document.getElementById('textInput').value;
      if(text.length > 0) {
        authFetch('/type?t=' + encodeURIComponent(text)).catch(() => {});
        document.getElementById('textInput').value = '';
      }
    }

    function sendClick(btn) {
      authFetch('/click?b=' + btn).catch(() => {});
    }

    function handlePointerDown(e) {
      e.preventDefault();
      pad.setPointerCapture(e.pointerId);
      activePointers++;

      if (activePointers === 2) {
        multiTouch = true;
        sendClick('right');
        return;
      }

      if (activePointers === 1) {
        isDown = true;
        tapMoved = false;
        multiTouch = false;
        tapTime = Date.now();
        lastX = e.clientX;
        lastY = e.clientY;
      }
    }

    function handlePointerMove(e) {
      e.preventDefault();
      if (!isDown || multiTouch || !e.isPrimary) return;

      let dx = e.clientX - lastX;
      let dy = e.clientY - lastY;

      if (Math.abs(dx) > 2 || Math.abs(dy) > 2) {
        tapMoved = true;
      }

      accX += dx;
      accY += dy;
      lastX = e.clientX;
      lastY = e.clientY;

      sendMoveQueue();
    }

    function handlePointerUp(e) {
      e.preventDefault();
      activePointers--;
      if (activePointers < 0) activePointers = 0;

      if (activePointers === 0) {
        isDown = false;
        if (!multiTouch && !tapMoved && (Date.now() - tapTime < 250)) {
          sendClick('left');
        }
      }
    }

    function sendMoveQueue() {
      if(isSending || (Math.abs(accX) < 1 && Math.abs(accY) < 1)) return;

      isSending = true;
      let tx = Math.round(accX);
      let ty = Math.round(accY);

      if (tx > 120) tx = 120; else if (tx < -120) tx = -120;
      if (ty > 120) ty = 120; else if (ty < -120) ty = -120;

      accX -= tx;
      accY -= ty;

      authFetch('/move?x=' + tx + '&y=' + ty)
        .then(() => {
          isSending = false;
          sendMoveQueue();
        })
        .catch(() => { isSending = false; });
    }

    pad.addEventListener('pointerdown', handlePointerDown, { passive: false });
    pad.addEventListener('pointermove', handlePointerMove, { passive: false });
    pad.addEventListener('pointerup', handlePointerUp, { passive: false });
    pad.addEventListener('pointercancel', handlePointerUp, { passive: false });
  </script>
</body>
</html>
)rawliteral";

static const char login_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 Portal</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(420px, calc(100% - 32px));
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 18px;
      box-sizing: border-box;
      text-align: left;
    }
    h2 { margin: 0 0 10px 0; }
    p { margin: 8px 0; color: #cfcfcf; }
    input {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 10px;
      box-sizing: border-box;
    }
    button {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 10px;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .err { display:none; margin-top: 10px; color: #ff6b6b; }
    .ok { display:none; margin-top: 10px; color: #89ff9b; }
    .hint { font-size: 12px; margin-top: 10px; color: #9a9a9a; }
  </style>
</head>
<body>
  <div class="card">
    <h2>Sign in</h2>
    <p>Pair this phone (triple-tap BOOT, then press Pair) or enter a pairing token.</p>
    <form method="POST" action="/login">
      <input type="text" name="t" placeholder="Pairing token" autocapitalize="off" autocomplete="off" spellcheck="false">
      <button type="submit">Sign in</button>
      <div class="err" id="err">Token was not accepted.</div>
      <div class="ok" id="ok">Paired. Loading controls…</div>
    </form>
    <button type="button" onclick="pairNow()">Pair</button>
    <div class="hint">Pairing is only available for a short time after triple-tapping BOOT.</div>
  </div>
  <script>
    const e = new URLSearchParams(location.search).get('e');
    if (e) document.getElementById('err').style.display = 'block';
    async function pairNow() {
      try {
        const r = await fetch('/pair', { cache: 'no-store' });
        if (r.ok) {
          document.getElementById('ok').style.display = 'block';
          window.location = '/';
          return;
        }
        document.getElementById('err').textContent = 'Pairing is not available. Triple-tap BOOT and try again.';
        document.getElementById('err').style.display = 'block';
      } catch (e) {
        document.getElementById('err').textContent = 'Pairing request did not complete.';
        document.getElementById('err').style.display = 'block';
      }
    }
  </script>
</body>
</html>
)rawliteral";

static const char totp_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 TOTP</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(520px, calc(100% - 32px));
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 18px;
      box-sizing: border-box;
      text-align: left;
    }
    .top { display:flex; justify-content:space-between; align-items:center; margin-bottom: 10px; }
    a { color:#9ecbff; text-decoration:none; font-size:14px; }
    h2 { margin: 0 0 10px 0; }
    p { margin: 8px 0; color: #cfcfcf; }
    label { display:block; margin-top: 10px; font-size: 13px; color:#cfcfcf; }
    input[type="text"], input[type="password"], input[type="number"] {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 6px;
      box-sizing: border-box;
    }
    .row { display:flex; gap: 10px; }
    button {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 12px;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .danger { background: #b00020; }
    .danger:active { background: #7a0016; }
    .status {
      margin-top: 10px;
      padding: 10px;
      border: 1px solid #2a2a2a;
      border-radius: 10px;
      background: #171717;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
      font-size: 13px;
      line-height: 1.4;
      white-space: pre-wrap;
    }
    .hint { font-size: 12px; margin-top: 10px; color: #9a9a9a; }
  </style>
</head>
<body>
  <div class="card">
    <div class="top">
      <a href="/">← Back</a>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/ap">AP</a>
        <a href="/diag">Diag</a>
        <a href="/keys">Keys</a>
        <a href="/hsm">HSM</a>
        <a href="/logout">Sign out</a>
      </div>
    </div>
    <h2>TOTP</h2>
    <p>Single-tap BOOT to type the current code (after time sync).</p>

    <div class="status" id="status">Loading…</div>

    <form method="POST" action="/totp">
      <label>Shared secret (Base32)</label>
      <input type="password" name="s" placeholder="Example: JBSWY3DPEHPK3PXP" autocapitalize="off" autocomplete="off" spellcheck="false">

