sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
      <div class="row">
        <div style="flex:1;">
          <label>Digits</label>
          <input type="number" name="d" value="6" min="6" max="10">
        </div>
        <div style="flex:1;">
          <label>Period (seconds)</label>
          <input type="number" name="p" value="30" min="10" max="120">
        </div>
      </div>

      <label style="margin-top:12px;">
        <input type="checkbox" name="e" style="transform: scale(1.2); margin-right: 8px;">
        Append Enter
      </label>

      <button type="submit">Save</button>
    </form>

    <form method="POST" action="/totp/clear">
      <button class="danger" type="submit">Clear secret</button>
    </form>

    <div class="hint">Tip: opening the control page syncs time automatically.</div>
  </div>

  <script>
    async function refresh() {
      const r = await fetch('/totp/status', { cache: 'no-store' });
      if (r.status === 401) { window.location = '/'; return; }
      if (!r.ok) return;
      const j = await r.json();
      const lines = [];
      lines.push('configured: ' + (j.configured ? 'yes' : 'no'));
      lines.push('time_synced: ' + (j.time_synced ? 'yes' : 'no'));
      lines.push('code: ' + (j.code || ''));
      lines.push('seconds_remaining: ' + (j.seconds_remaining ?? ''));
      lines.push('flash_encryption: ' + (j.flash_encryption ? 'enabled' : 'disabled'));
      document.getElementById('status').textContent = lines.join('\\n');
    }
    refresh();
    setInterval(refresh, 1000);
  </script>
</body>
</html>
)rawliteral";

static const char keys_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 Keys</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(720px, calc(100% - 32px));
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 18px;
      box-sizing: border-box;
      text-align: left;
    }
    .top { display:flex; justify-content:space-between; align-items:center; margin-bottom: 10px; }
    a { color:#9ecbff; text-decoration:none; font-size:14px; }
    h2 { margin: 0 0 10px 0; }
    h3 { margin: 18px 0 8px 0; font-size: 16px; }
    p { margin: 8px 0; color: #cfcfcf; }
    .small { font-size: 12px; color: #9a9a9a; }
    label { display:block; margin-top: 10px; font-size: 13px; color:#cfcfcf; }
    input[type="text"], input[type="password"], select {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 6px;
      box-sizing: border-box;
      background: #2a2a2a;
      color: white;
    }
    button {
      width: 100%;
      padding: 12px;
      font-size: 16px;
      border-radius: 8px;
      border: none;
      margin-top: 12px;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .danger { background: #b00020; }
    .danger:active { background: #7a0016; }
    .status {
      margin-top: 10px;
      padding: 10px;
      border: 1px solid #2a2a2a;
      border-radius: 10px;
      background: #171717;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
      font-size: 13px;
      line-height: 1.4;
      white-space: pre-wrap;
    }
    .list { margin-top: 12px; display: flex; flex-direction: column; gap: 10px; }
    .item {
      border: 1px solid #2a2a2a;
      background: #161616;
      border-radius: 10px;
      padding: 12px;
    }
    .row { display:flex; justify-content:space-between; align-items:baseline; gap: 10px; }
    .mono { font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace; color: #cfcfcf; }
    .btnrow { display:flex; gap: 10px; margin-top: 10px; }
    .btnrow button { width: 50%; margin-top: 0; }
    .hint { font-size: 12px; margin-top: 10px; color: #9a9a9a; }
    .msg { margin-top: 10px; color: #ffcc80; }
  </style>
</head>
<body>
  <div class="card">
    <div class="top">
      <a href="/">← Back</a>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/ap">AP</a>
        <a href="/diag">Diag</a>
        <a href="/hsm">HSM</a>
        <a href="/totp">TOTP</a>
        <a href="/logout">Sign out</a>
      </div>
    </div>

    <h2>Security Key</h2>
    <p class="small">CTAP2/FIDO2 over USB HID is enabled. Use this page for credential inventory and backups.</p>
    <p class="small">Hold BOOT for ~2–4 seconds to unlock admin actions (delete / backup / restore) for about 60 seconds.</p>

    <div class="status" id="status">Loading…</div>
    <div class="msg" id="msg"></div>

    <h3>Credential inventory</h3>
    <div id="list" class="list"></div>

    <h3>Attestation</h3>
    <p class="small">Controls how the device identifies itself to relying parties. Certified-key impersonation is not supported.</p>
    <select id="attest">
      <option value="diy">DIY-S3-Key</option>
      <option value="none">No attestation</option>
    </select>
    <button type="button" onclick="saveAttestation()">Save attestation setting</button>

    <h3>Encrypted backup</h3>
    <p class="small">Exports stored credentials into an encrypted file. Keep your password safe.</p>
    <input type="password" id="bp" placeholder="Backup password">
    <button type="button" onclick="downloadBackup()">Download backup</button>

    <h3>Restore backup</h3>
    <p class="small">Restores credentials from an encrypted backup (replaces current stored credentials).</p>
    <form method="POST" action="/backup/restore" enctype="multipart/form-data">
      <input type="password" name="p" placeholder="Backup password">
      <input type="file" name="f" accept=".bin,application/octet-stream">
      <button class="danger" type="submit">Restore backup</button>
    </form>

    <div class="hint">Tip: pairing token and TOTP secret are not included in backups.</div>
  </div>

  <script>
    function escHtml(s) {
      return (s ?? '').replace(/[&<>"']/g, (c) => {
        if (c === '&') return '&amp;';
        if (c === '<') return '&lt;';
        if (c === '>') return '&gt;';
        if (c === '"') return '&quot;';
        return '&#39;';
      });
    }

    async function api(url, opts) {
      const r = await fetch(url, Object.assign({ cache: 'no-store' }, opts || {}));
      if (r.status === 401) { window.location = '/'; throw new Error('auth'); }
      return r;
    }

    function showMsg(t) {
      const el = document.getElementById('msg');
      el.textContent = t || '';
    }

    function renderList(entries, adminUnlocked) {
      const list = document.getElementById('list');
      list.innerHTML = '';
      if (!entries || entries.length === 0) {
        const d = document.createElement('div');
        d.className = 'small';
        d.textContent = 'No credentials stored.';
        list.appendChild(d);
        return;
      }
      for (const e of entries) {
        const id = e.id || '';
        const idShort = id.length > 16 ? (id.slice(0, 8) + '…' + id.slice(-4)) : id;
        const item = document.createElement('div');
        item.className = 'item';
        item.innerHTML = `
          <div class="row">
            <div>
              <div class="small">rp_id</div>
              <div>${escHtml(e.rp || '')}</div>
            </div>
            <div class="mono">${escHtml(idShort)}</div>
          </div>
          <label>Label</label>
          <input type="text" data-id="${escHtml(id)}" value="${escHtml(e.label || '')}" placeholder="Optional label">
          <div class="btnrow">
            <button type="button" onclick="saveLabel('${escHtml(id)}')">Save label</button>
            <button class="danger" type="button" onclick="deleteKey('${escHtml(id)}')">Delete</button>
          </div>
        `;
        list.appendChild(item);
      }
      if (!adminUnlocked) {
        showMsg('Admin actions locked (hold BOOT ~2–4s to unlock).');
      } else {
        showMsg('Admin actions unlocked.');
      }
    }

