sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    async function refresh() {
      const st = await api('/admin/status');
      const sj = await st.json();

      const kl = await api('/keys/list');
      const kj = await kl.json();

      const lines = [];
      lines.push('admin_unlocked: ' + (sj.admin_unlocked ? 'yes' : 'no'));
      lines.push('admin_seconds_remaining: ' + (sj.admin_seconds_remaining ?? ''));
      lines.push('flash_encryption: ' + (sj.flash_encryption ? 'enabled' : 'disabled'));
      lines.push('credential_count: ' + (kj.count ?? 0));
      document.getElementById('status').textContent = lines.join('\\n');

      if (kj.attestation_profile) {
        document.getElementById('attest').value = kj.attestation_profile;
      }

      renderList(kj.entries || [], sj.admin_unlocked);
    }

    async function saveLabel(id) {
      const el = document.querySelector('input[data-id=\"' + id + '\"]');
      const label = el ? el.value : '';
      const body = new URLSearchParams();
      body.set('id', id);
      body.set('label', label);
      const r = await api('/keys/label', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: body.toString() });
      if (!r.ok) {
        showMsg('Label update was not accepted.');
        return;
      }
      showMsg('Label saved.');
      refresh();
    }

    async function deleteKey(id) {
      const body = new URLSearchParams();
      body.set('id', id);
      const r = await api('/keys/delete', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: body.toString() });
      const txt = await r.text();
      if (!r.ok) {
        showMsg(txt || 'Delete request was not accepted.');
        return;
      }
      showMsg('Deleted.');
      refresh();
    }

    async function saveAttestation() {
      const a = document.getElementById('attest').value;
      const body = new URLSearchParams();
      body.set('a', a);
      const r = await api('/keys/settings', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: body.toString() });
      const txt = await r.text();
      if (!r.ok) {
        showMsg(txt || 'Attestation setting was not accepted.');
        return;
      }
      showMsg('Attestation setting saved.');
      refresh();
    }

    async function downloadBackup() {
      const p = document.getElementById('bp').value;
      const body = new URLSearchParams();
      body.set('p', p);
      const r = await api('/backup/download', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: body.toString() });
      if (!r.ok) {
        const t = await r.text();
        showMsg(t || 'Backup download was not accepted.');
        return;
      }
      const b = await r.blob();
      const url = URL.createObjectURL(b);
      const a = document.createElement('a');
      a.href = url;
      a.download = 'esp32s3-kbm-backup.bin';
      a.click();
      setTimeout(() => URL.revokeObjectURL(url), 2000);
      showMsg('Backup downloaded.');
    }

    const qr = new URLSearchParams(location.search).get('r');
    if (qr === '1') showMsg('Restore completed.');
    else if (qr === '0') showMsg('Restore failed (check password/file).');

    refresh();
    setInterval(refresh, 2000);
  </script>
</body>
</html>
)rawliteral";

static const char ap_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 AP Management</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(700px, calc(100% - 32px));
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 18px;
      box-sizing: border-box;
      text-align: left;
    }
    .top { display:flex; justify-content:space-between; align-items:center; margin-bottom: 10px; }
    a { color:#9ecbff; text-decoration:none; font-size:14px; }
    h2 { margin: 0 0 10px 0; }
    p { margin: 8px 0; color: #cfcfcf; }
    .small { font-size: 12px; color: #9a9a9a; }
    .status {
      margin-top: 10px;
      padding: 10px;
      border: 1px solid #2a2a2a;
      border-radius: 10px;
      background: #171717;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
      font-size: 13px;
      line-height: 1.4;
      white-space: pre-wrap;
    }
    .row { display:flex; gap: 10px; margin-top: 12px; }
    button {
      width: 50%;
      padding: 12px;
      font-size: 15px;
      border-radius: 8px;
      border: none;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .msg { margin-top: 10px; color: #ffcc80; min-height: 20px; }
  </style>
</head>
<body>
  <div class="card">
    <div class="top">
      <a href="/">Back</a>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/keys">Keys</a>
        <a href="/diag">Diag</a>
        <a href="/hsm">HSM</a>
        <a href="/totp">TOTP</a>
        <a href="/logout">Sign out</a>
      </div>
    </div>

    <h2>AP Management Mode</h2>
    <p class="small">Management-only mode blocks remote HID actions (`/move`, `/click`, `/type`) and keeps AP for admin pages.</p>
    <p class="small">Changing mode requires admin unlock (hold BOOT ~2-4s).</p>

    <div class="status" id="status">Loading...</div>
    <div class="msg" id="msg"></div>

    <div class="row">
      <button type="button" onclick="setMode('manage')">Enable Management-Only</button>
      <button type="button" onclick="setMode('control')">Enable Full Control</button>
    </div>
  </div>

  <script>
    async function api(url, opts) {
      const r = await fetch(url, Object.assign({ cache: 'no-store' }, opts || {}));
      if (r.status === 401) { window.location = '/'; throw new Error('auth'); }
      return r;
    }

    function showMsg(t) {
      document.getElementById('msg').textContent = t || '';
    }

    function fmtNullable(v) {
      return (v === null || v === undefined || v === '') ? '' : String(v);
    }

