sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    async function refresh() {
      const stR = await api('/admin/status');
      const apR = await api('/ap/status');
      const st = await stR.json();
      const ap = await apR.json();

      const lines = [];
      lines.push('mode: ' + (ap.mode || ''));
      lines.push('ap_ssid: ' + (ap.ssid || ''));
      lines.push('admin_unlocked: ' + (st.admin_unlocked ? 'yes' : 'no'));
      lines.push('admin_seconds_remaining: ' + fmtNullable(st.admin_seconds_remaining));
      lines.push('flash_encryption: ' + (st.flash_encryption ? 'enabled' : 'disabled'));
      lines.push('usb_kbm_hid_enabled: ' + (ap.usb_kbm_hid_enabled ? 'yes' : 'no'));
      document.getElementById('status').textContent = lines.join('\n');
    }

    async function setMode(mode) {
      const body = new URLSearchParams();
      body.set('mode', mode);
      const r = await api('/ap/mode', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'AP mode change failed.');
        return;
      }
      showMsg(t || 'AP mode updated.');
      await refresh();
    }

    refresh();
    setInterval(refresh, 2000);
  </script>
</body>
</html>
)rawliteral";

static const char diag_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 Diagnostics</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(760px, calc(100% - 24px));
      max-height: calc(100% - 24px);
      overflow: auto;
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 16px;
      box-sizing: border-box;
      text-align: left;
    }
    .top { display:flex; justify-content:space-between; align-items:center; margin-bottom: 10px; }
    a { color:#9ecbff; text-decoration:none; font-size:14px; }
    h2 { margin: 0 0 10px 0; }
    .small { font-size: 12px; color: #9a9a9a; }
    .status {
      margin-top: 10px;
      padding: 10px;
      border: 1px solid #2a2a2a;
      border-radius: 10px;
      background: #171717;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
      font-size: 13px;
      line-height: 1.4;
      white-space: pre-wrap;
      word-break: break-word;
    }
    button {
      width: 100%;
      padding: 12px;
      font-size: 15px;
      border-radius: 8px;
      border: none;
      margin-top: 12px;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .msg { margin-top: 10px; color: #ffcc80; min-height: 20px; }
  </style>
</head>
<body>
  <div class="card">
    <div class="top">
      <a href="/">Back</a>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/ap">AP</a>
        <a href="/keys">Keys</a>
        <a href="/hsm">HSM</a>
        <a href="/totp">TOTP</a>
        <a href="/logout">Sign out</a>
      </div>
    </div>

    <h2>Diagnostics</h2>
    <p class="small">Live FIDO/CTAP diagnostics for troubleshooting registration/authentication and user-presence flow.</p>
    <div class="status" id="status">Loading...</div>
    <button type="button" onclick="resetDiag()">Reset counters</button>
    <div class="msg" id="msg"></div>
  </div>

  <script>
    async function api(url, opts) {
      const r = await fetch(url, Object.assign({ cache: 'no-store' }, opts || {}));
      if (r.status === 401) { window.location = '/'; throw new Error('auth'); }
      return r;
    }

    function showMsg(t) {
      document.getElementById('msg').textContent = t || '';
    }

    function fmt(v) {
      return (v === null || v === undefined || v === '') ? '' : String(v);
    }

    async function refresh() {
      const adR = await api('/admin/status');
      const dgR = await api('/diag/status');
      const ad = await adR.json();
      const d = await dgR.json();

      const lines = [];
      lines.push('admin_unlocked: ' + (ad.admin_unlocked ? 'yes' : 'no'));
      lines.push('admin_seconds_remaining: ' + fmt(ad.admin_seconds_remaining));
      lines.push('flash_encryption: ' + (ad.flash_encryption ? 'enabled' : 'disabled'));
      lines.push('last_cid: ' + fmt(d.last_cid));
      lines.push('last_hid_cmd: ' + fmt(d.last_hid_cmd) + ' (' + (d.last_hid_cmd_name || '') + ')');
      lines.push('last_ctap_cmd: ' + fmt(d.last_ctap_cmd) + ' (' + (d.last_ctap_cmd_name || '') + ')');
      lines.push('last_ctap_status: ' + fmt(d.last_ctap_status) + ' (' + (d.last_ctap_status_name || '') + ')');
      lines.push('last_hid_error: ' + fmt(d.last_hid_error) + ' (' + (d.last_hid_error_name || '') + ')');
      lines.push('pending_waiting_up: ' + (d.pending_waiting_up ? 'yes' : 'no'));
      lines.push('rx_ms_ago: ' + fmt(d.rx_ms_ago));
      lines.push('tx_ms_ago: ' + fmt(d.tx_ms_ago));
      lines.push('ctap_requests_total: ' + fmt(d.ctap_requests_total));
      lines.push('ctap_ok_total: ' + fmt(d.ctap_ok_total));
      lines.push('ctap_err_total: ' + fmt(d.ctap_err_total));
      lines.push('pin_gate_blocks_total: ' + fmt(d.pin_gate_blocks_total));
      lines.push('up_satisfied_total: ' + fmt(d.up_satisfied_total));
      lines.push('hid_out_callbacks_total: ' + fmt(d.hid_out_callbacks_total));
      lines.push('hid_set_feature_callbacks_total: ' + fmt(d.hid_set_feature_callbacks_total));
      lines.push('hid_get_feature_callbacks_total: ' + fmt(d.hid_get_feature_callbacks_total));
      lines.push('unexpected_report_id_total: ' + fmt(d.unexpected_report_id_total));
      lines.push('dropped_bad_len_total: ' + fmt(d.dropped_bad_len_total));
      lines.push('normalized_packets_total: ' + fmt(d.normalized_packets_total));
      lines.push('last_report_id_seen: ' + fmt(d.last_report_id_seen));
      lines.push('last_report_len_seen: ' + fmt(d.last_report_len_seen));
      lines.push('last_report_id_dropped: ' + fmt(d.last_report_id_dropped));
      lines.push('last_report_len_dropped: ' + fmt(d.last_report_len_dropped));
      document.getElementById('status').textContent = lines.join('\n');
    }

    async function resetDiag() {
      const r = await api('/diag/reset', { method: 'POST' });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'Reset failed.');
        return;
      }
      showMsg(t || 'Diagnostics counters reset.');
      await refresh();
    }

    refresh();
    setInterval(refresh, 1000);
  </script>
</body>
</html>
)rawliteral";

