sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static const char hsm_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>ESP32 HSM</title>
  <style>
    html, body {
      width: 100%; height: 100%; margin: 0; padding: 0;
      font-family: Arial, sans-serif;
      background: #121212; color: white;
      display: flex; align-items: center; justify-content: center;
    }
    .card {
      width: min(760px, calc(100% - 24px));
      max-height: calc(100% - 24px);
      overflow: auto;
      background: #1c1c1c;
      border: 1px solid #2a2a2a;
      border-radius: 12px;
      padding: 16px;
      box-sizing: border-box;
      text-align: left;
    }
    .top { display:flex; justify-content:space-between; align-items:center; margin-bottom: 10px; }
    a { color:#9ecbff; text-decoration:none; font-size:14px; }
    h2 { margin: 0 0 10px 0; }
    h3 { margin: 16px 0 8px 0; font-size: 16px; }
    p { margin: 8px 0; color: #cfcfcf; }
    .small { font-size: 12px; color: #9a9a9a; }
    label { display:block; margin-top: 10px; font-size: 13px; color:#cfcfcf; }
    textarea, input[type="text"], input[type="password"], select {
      width: 100%;
      padding: 12px;
      font-size: 14px;
      border-radius: 8px;
      border: none;
      margin-top: 6px;
      box-sizing: border-box;
      background: #2a2a2a;
      color: white;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
    }
    button {
      width: 100%;
      padding: 12px;
      font-size: 15px;
      border-radius: 8px;
      border: none;
      margin-top: 12px;
      background: #007bff;
      color: white;
      cursor: pointer;
    }
    button:active { background: #0056b3; }
    .danger { background: #b00020; }
    .danger:active { background: #7a0016; }
    .status {
      margin-top: 10px;
      padding: 10px;
      border: 1px solid #2a2a2a;
      border-radius: 10px;
      background: #171717;
      font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, "Liberation Mono", "Courier New", monospace;
      font-size: 13px;
      line-height: 1.4;
      white-space: pre-wrap;
      word-break: break-all;
    }
    .msg { margin-top: 10px; color: #ffcc80; min-height: 20px; }
    .row { display:flex; gap: 10px; }
    .row button { width: 50%; }
    .hint { margin-top: 10px; color:#9a9a9a; font-size: 12px; }
  </style>
</head>
<body>
  <div class="card">
    <div class="top">
      <a href="/">Back</a>
      <div style="display:flex; gap:12px; align-items:center;">
        <a href="/ap">AP</a>
        <a href="/diag">Diag</a>
        <a href="/keys">Keys</a>
        <a href="/totp">TOTP</a>
        <a href="/logout">Sign out</a>
      </div>
    </div>

    <h2>HSM (P-256 / ES256)</h2>
    <p class="small">Use BOOT presence hold (~0.5-1.2s) plus PIN unlock for signing. Key management also requires admin unlock.</p>

    <div class="status" id="status">Loading...</div>
    <div class="msg" id="msg"></div>

    <h3>PIN</h3>
    <label for="pinCurrent">Current PIN</label>
    <input id="pinCurrent" type="password" placeholder="Current PIN">
    <label for="pinNew">New PIN (4-64 chars)</label>
    <input id="pinNew" type="password" placeholder="New PIN">
    <div class="row">
      <button type="button" onclick="unlockPin()">Unlock PIN</button>
      <button type="button" onclick="setPin()">Set / Change PIN</button>
    </div>
    <button class="danger" type="button" onclick="clearPin()">Clear PIN</button>

    <h3>Key management</h3>
    <div class="row">
      <button type="button" onclick="generateKey()">Generate / Rotate key</button>
      <button class="danger" type="button" onclick="deleteKey()">Delete key</button>
    </div>

    <h3>Sign</h3>
    <label for="fmt">Input format</label>
    <select id="fmt">
      <option value="text">UTF-8 text</option>
      <option value="hex">Hex bytes</option>
      <option value="digesthex">SHA-256 digest (hex, 32 bytes)</option>
    </select>
    <label for="msgIn">Message / bytes</label>
    <textarea id="msgIn" rows="4" placeholder="Example text or hex"></textarea>
    <button type="button" onclick="signNow()">Sign with device key</button>
    <div class="status" id="signOut"></div>

    <h3>Verify</h3>
    <label for="sigIn">Signature DER (hex)</label>
    <textarea id="sigIn" rows="3" placeholder="Paste signature hex here"></textarea>
    <button type="button" onclick="verifyNow()">Verify using current public key</button>
    <div class="status" id="verifyOut"></div>

    <div class="hint">Tip: HSM private key is stored in NVS. Enable flash encryption for stronger at-rest protection.</div>
  </div>

  <script>
    async function api(url, opts) {
      const r = await fetch(url, Object.assign({ cache: 'no-store' }, opts || {}));
      if (r.status === 401) { window.location = '/'; throw new Error('auth'); }
      return r;
    }

    function showMsg(t) {
      document.getElementById('msg').textContent = t || '';
    }

    function fmtNullable(v) {
      return (v === null || v === undefined || v === '') ? '' : String(v);
    }

    async function refresh() {
      const stR = await api('/admin/status');
      const hsR = await api('/hsm/status');
      const st = await stR.json();
      const hs = await hsR.json();

      const lines = [];
      lines.push('admin_unlocked: ' + (st.admin_unlocked ? 'yes' : 'no'));
      lines.push('admin_seconds_remaining: ' + fmtNullable(st.admin_seconds_remaining));
      lines.push('flash_encryption: ' + (st.flash_encryption ? 'enabled' : 'disabled'));
      lines.push('key_present: ' + (hs.key_present ? 'yes' : 'no'));
      lines.push('pin_configured: ' + (hs.pin_configured ? 'yes' : 'no'));
      lines.push('pin_unlocked: ' + (hs.pin_unlocked ? 'yes' : 'no'));
      lines.push('pin_seconds_remaining: ' + fmtNullable(hs.pin_seconds_remaining));
      lines.push('presence_satisfied: ' + (hs.presence_satisfied ? 'yes' : 'no'));
      lines.push('presence_seconds_remaining: ' + fmtNullable(hs.presence_seconds_remaining));
      lines.push('algorithm: ' + (hs.algorithm || ''));
      lines.push('curve: ' + (hs.curve || ''));
      lines.push('created_unix: ' + fmtNullable(hs.created_unix));
      lines.push('sign_count: ' + fmtNullable(hs.sign_count));
      lines.push('pubkey_fingerprint: ' + (hs.pubkey_fingerprint || ''));
      lines.push('public_key_hex: ' + (hs.public_key_hex || ''));
      document.getElementById('status').textContent = lines.join('\n');
    }

