sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    function pinCurrent() { return document.getElementById('pinCurrent').value || ''; }
    function pinNew() { return document.getElementById('pinNew').value || ''; }

    async function unlockPin() {
      const body = new URLSearchParams();
      body.set('p', pinCurrent());
      const r = await api('/hsm/pin/unlock', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'PIN unlock failed.');
        return;
      }
      showMsg('PIN unlocked.');
      await refresh();
    }

    async function setPin() {
      const body = new URLSearchParams();
      body.set('p', pinCurrent());
      body.set('n', pinNew());
      const r = await api('/hsm/pin/set', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'PIN set failed.');
        return;
      }
      document.getElementById('pinCurrent').value = '';
      document.getElementById('pinNew').value = '';
      showMsg('PIN saved.');
      await refresh();
    }

    async function clearPin() {
      if (!confirm('Clear the HSM PIN?')) return;
      const body = new URLSearchParams();
      body.set('p', pinCurrent());
      const r = await api('/hsm/pin/clear', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'PIN clear failed.');
        return;
      }
      document.getElementById('pinCurrent').value = '';
      document.getElementById('pinNew').value = '';
      showMsg('PIN cleared.');
      await refresh();
    }

    async function generateKey() {
      if (!confirm('Generate a new keypair and replace the current key?')) return;
      const r = await api('/hsm/generate', { method: 'POST' });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'Key generation was not accepted.');
        return;
      }
      showMsg('New HSM key generated.');
      await refresh();
    }

    async function deleteKey() {
      if (!confirm('Delete the current HSM key? This cannot be undone.')) return;
      const r = await api('/hsm/delete', { method: 'POST' });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'Delete was not accepted.');
        return;
      }
      showMsg('HSM key deleted.');
      document.getElementById('signOut').textContent = '';
      document.getElementById('verifyOut').textContent = '';
      await refresh();
    }

    async function signNow() {
      const body = new URLSearchParams();
      body.set('fmt', document.getElementById('fmt').value);
      body.set('m', document.getElementById('msgIn').value || '');
      const r = await api('/hsm/sign', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'Sign request failed.');
        return;
      }

      let j = null;
      try { j = JSON.parse(t); } catch (_) {}
      if (!j) {
        showMsg('Sign response parse failed.');
        return;
      }

      const lines = [];
      lines.push('digest_hex: ' + (j.digest_hex || ''));
      lines.push('signature_der_hex: ' + (j.signature_der_hex || ''));
      lines.push('sign_count: ' + fmtNullable(j.sign_count));
      document.getElementById('signOut').textContent = lines.join('\n');
      document.getElementById('sigIn').value = j.signature_der_hex || '';
      showMsg('Signature created.');
      await refresh();
    }

    async function verifyNow() {
      const body = new URLSearchParams();
      body.set('fmt', document.getElementById('fmt').value);
      body.set('m', document.getElementById('msgIn').value || '');
      body.set('sig', document.getElementById('sigIn').value || '');
      const r = await api('/hsm/verify', {
        method: 'POST',
        headers: {'Content-Type':'application/x-www-form-urlencoded'},
        body: body.toString()
      });
      const t = await r.text();
      if (!r.ok) {
        showMsg(t || 'Verify request failed.');
        return;
      }

      let j = null;
      try { j = JSON.parse(t); } catch (_) {}
      if (!j) {
        showMsg('Verify response parse failed.');
        return;
      }

      const lines = [];
      lines.push('valid: ' + (j.valid ? 'yes' : 'no'));
      lines.push('digest_hex: ' + (j.digest_hex || ''));
      document.getElementById('verifyOut').textContent = lines.join('\n');
      showMsg(j.valid ? 'Signature valid.' : 'Signature invalid.');
    }

    refresh();
    setInterval(refresh, 2000);
  </script>
</body>
</html>
)rawliteral";

static inline void send_no_cache_headers() {
  server.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
}

static inline void send_ui_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", index_html);
}

static inline void send_login_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", login_html);
}

static inline void send_totp_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", totp_html);
}

static inline void send_keys_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", keys_html);
}

static inline void send_ap_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", ap_html);
}

static inline void send_diag_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", diag_html);
}

static inline void send_hsm_page() {
  send_no_cache_headers();
  server.send_P(200, "text/html", hsm_html);
}

static inline void send_ok_minimal() {
  // 204: No Content (smaller + faster than "OK" bodies for high-rate endpoints)
  server.send(204);
}

static inline bool boot_button_down() {
  return digitalRead(BOOT_BUTTON_PIN) == LOW;
}

struct LedRgb {
  uint8_t r = 0;
  uint8_t g = 0;
  uint8_t b = 0;
};

static LedRgb lastLed;

