sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static inline bool led_available() {
  return MODE_LED_PIN >= 0;
}

static void set_led_rgb(uint8_t r, uint8_t g, uint8_t b) {
  if (!led_available()) return;

  // Avoid frequent WS2812 updates (and needless GPIO writes) if nothing changed.
  if (lastLed.r == r && lastLed.g == g && lastLed.b == b) return;
  lastLed = {r, g, b};

  if (MODE_LED_IS_RGB) {
    rgbLedWrite(static_cast<uint8_t>(MODE_LED_PIN), r, g, b);
    return;
  }

  const bool on = (r | g | b) != 0;
  const bool pinLevel = (MODE_LED_ACTIVE_LOW ? !on : on);
  digitalWrite(MODE_LED_PIN, pinLevel ? HIGH : LOW);
}

static inline void led_off() {
  set_led_rgb(0, 0, 0);
}

static void init_led() {
  if (!led_available()) return;
  if (!MODE_LED_IS_RGB) pinMode(MODE_LED_PIN, OUTPUT);
  led_off();
}

static inline bool pairing_active() {
  return pairingActiveUntil != 0 && (static_cast<int32_t>(pairingActiveUntil - millis()) > 0);
}

static inline bool admin_unlocked() {
  return adminUnlockedUntil != 0 && (static_cast<int32_t>(adminUnlockedUntil - millis()) > 0);
}

static inline bool hsm_pin_unlocked() {
  return hsmPinUnlockedUntil != 0 && (static_cast<int32_t>(hsmPinUnlockedUntil - millis()) > 0);
}

static inline bool hsm_presence_satisfied() {
  return hsmPresenceUntil != 0 && (static_cast<int32_t>(hsmPresenceUntil - millis()) > 0);
}

static AttestationProfile load_attestation_profile() {
  prefs.begin("kbm", true);
  const uint8_t raw = prefs.getUChar("att", static_cast<uint8_t>(AttestationProfile::Diy));
  prefs.end();

  return (raw == static_cast<uint8_t>(AttestationProfile::None)) ? AttestationProfile::None : AttestationProfile::Diy;
}

static void save_attestation_profile(AttestationProfile p) {
  prefs.begin("kbm", false);
  prefs.putUChar("att", static_cast<uint8_t>(p));
  prefs.end();
  attestationProfile = p;
}

static bool load_ap_management_mode() {
  prefs.begin("kbm", true);
  const bool v = prefs.getBool("ap_mgmt", false);
  prefs.end();
  return v;
}

static void save_ap_management_mode(const bool enabled) {
  prefs.begin("kbm", false);
  prefs.putBool("ap_mgmt", enabled);
  prefs.end();
  apManagementMode = enabled;
}

static bool build_ap_status_json(String& outJson) {
  outJson = "";
  outJson.reserve(192);
  outJson += "{";
  outJson += "\"mode\":\"";
  outJson += apManagementMode ? "manage" : "control";
  outJson += "\"";
  outJson += ",\"ssid\":\"";
  outJson += AP_SSID;
  outJson += "\"";
  outJson += ",\"usb_kbm_hid_enabled\":";
  outJson += (usb_kbm_hid_enabled() ? "true" : "false");
  outJson += "}";
  return true;
}

static void load_pair_token() {
  prefs.begin("kbm", true);
  const String t = prefs.getString("pair", "");
  prefs.end();

  if (t.length() == 32) {
    memset(pairTokenHex, 0, sizeof(pairTokenHex));
    t.toCharArray(pairTokenHex, sizeof(pairTokenHex));
  } else {
    pairTokenHex[0] = '\0';
  }
}

static void save_pair_token(const char* token) {
  prefs.begin("kbm", false);
  prefs.putString("pair", token);
  prefs.end();
}

static void generate_pair_token() {
  uint8_t b[16];
  esp_fill_random(b, sizeof(b));
  for (size_t i = 0; i < sizeof(b); ++i) {
    snprintf(pairTokenHex + (i * 2), 3, "%02x", b[i]);
  }
  pairTokenHex[32] = '\0';
  save_pair_token(pairTokenHex);
}

static bool cookie_has_valid_token(const char* cookie) {
  if (pairTokenHex[0] == '\0') return false;
  if (cookie == nullptr || cookie[0] == '\0') return false;

  const size_t tokLen = strlen(pairTokenHex);
  const char* p = cookie;
  while ((p = strstr(p, "sid=")) != nullptr) {
    p += 4;
    while (*p == ' ') ++p;
    size_t i = 0;
    for (; i < tokLen; ++i) {
      const char ch = p[i];
      if (ch == '\0' || ch == ';' || ch == ' ') break;
      if (static_cast<char>(tolower(static_cast<unsigned char>(ch))) != pairTokenHex[i]) break;
    }
    if (i == tokLen && (p[i] == '\0' || p[i] == ';' || p[i] == ' ')) return true;
    p += 1;
  }
  return false;
}

static bool is_authenticated_request() {
  const String cookie = server.header("Cookie");
  return cookie_has_valid_token(cookie.c_str());
}

static void set_token_cookie_and_redirect(const char* location) {
  if (pairTokenHex[0] == '\0') {
    server.sendHeader("Location", location, true);
    server.send(303, "text/plain", "");
    return;
  }
  String cookie;
  cookie.reserve(96);
  cookie += "sid=";
  cookie += pairTokenHex;
  cookie += "; Path=/; Max-Age=2592000; SameSite=Lax; HttpOnly";
  server.sendHeader("Set-Cookie", cookie, true);
  server.sendHeader("Location", location, true);
  server.send(303, "text/plain", "");
}

static void clear_token_cookie_and_redirect(const char* location) {
  server.sendHeader("Set-Cookie", "sid=; Path=/; Max-Age=0; SameSite=Lax; HttpOnly", true);
  server.sendHeader("Location", location, true);
  server.send(303, "text/plain", "");
}

static inline bool flash_encryption_enabled() {
  return esp_flash_encryption_enabled();
}

static bool parse_i64(const String& s, int64_t* out) {
  const char* c = s.c_str();
  if (c == nullptr || c[0] == '\0') return false;
  char* end = nullptr;
  const long long v = strtoll(c, &end, 10);
  if (end == c) return false;
  *out = static_cast<int64_t>(v);
  return true;
}

static inline uint16_t read_le_u16(const uint8_t* p) {
  return static_cast<uint16_t>(p[0]) | (static_cast<uint16_t>(p[1]) << 8);
}

static inline uint32_t read_le_u32(const uint8_t* p) {
  return static_cast<uint32_t>(p[0]) | (static_cast<uint32_t>(p[1]) << 8) | (static_cast<uint32_t>(p[2]) << 16) |
         (static_cast<uint32_t>(p[3]) << 24);
}

static inline void write_le_u16(uint8_t* p, const uint16_t v) {
  p[0] = static_cast<uint8_t>(v & 0xFFU);
  p[1] = static_cast<uint8_t>((v >> 8) & 0xFFU);
}

static inline void write_le_u32(uint8_t* p, const uint32_t v) {
  p[0] = static_cast<uint8_t>(v & 0xFFU);
  p[1] = static_cast<uint8_t>((v >> 8) & 0xFFU);
  p[2] = static_cast<uint8_t>((v >> 16) & 0xFFU);
  p[3] = static_cast<uint8_t>((v >> 24) & 0xFFU);
}

static void secure_zero(void* ptr, size_t len) {
  if (ptr == nullptr || len == 0) return;
  volatile uint8_t* p = static_cast<volatile uint8_t*>(ptr);
  while (len--) *p++ = 0;
}

static inline uint8_t hex_nibble(char c) {
  if (c >= '0' && c <= '9') return static_cast<uint8_t>(c - '0');
  if (c >= 'a' && c <= 'f') return static_cast<uint8_t>(10 + (c - 'a'));
  if (c >= 'A' && c <= 'F') return static_cast<uint8_t>(10 + (c - 'A'));
  return 0xFF;
}

static size_t hex_to_bytes(const char* hex, uint8_t* out, const size_t outMax) {
  if (hex == nullptr || out == nullptr) return 0;
  const size_t n = strlen(hex);
  if (n == 0 || (n % 2) != 0) return 0;
  const size_t bytes = n / 2;
  if (bytes > outMax) return 0;

  for (size_t i = 0; i < bytes; ++i) {
    const uint8_t hi = hex_nibble(hex[i * 2]);
    const uint8_t lo = hex_nibble(hex[i * 2 + 1]);
    if (hi == 0xFF || lo == 0xFF) return 0;
    out[i] = static_cast<uint8_t>((hi << 4) | lo);
  }
  return bytes;
}

