sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static void bytes_to_hex(const uint8_t* in, const size_t inLen, char* out, const size_t outLen) {
  static constexpr char kHex[] = "0123456789abcdef";
  if (out == nullptr || outLen == 0) return;
  if (in == nullptr) {
    out[0] = '\0';
    return;
  }
  const size_t need = (inLen * 2) + 1;
  if (outLen < need) {
    out[0] = '\0';
    return;
  }
  for (size_t i = 0; i < inLen; ++i) {
    out[i * 2] = kHex[(in[i] >> 4) & 0x0F];
    out[i * 2 + 1] = kHex[in[i] & 0x0F];
  }
  out[inLen * 2] = '\0';
}

static void json_append_escaped(String& out, const char* s, const size_t len) {
  if (s == nullptr || len == 0) return;
  for (size_t i = 0; i < len; ++i) {
    const char c = s[i];
    if (c == '\\' || c == '"') {
      out += '\\';
      out += c;
    } else if (c == '\r') {
      out += "\\r";
    } else if (c == '\n') {
      out += "\\n";
    } else if (static_cast<unsigned char>(c) < 0x20) {
      out += ' ';
    } else {
      out += c;
    }
  }
}

static inline const char* attestation_profile_name(const AttestationProfile p) {
  return (p == AttestationProfile::None) ? "none" : "diy";
}

static bool cred_store_validate(const uint8_t* data, const size_t len, uint16_t* countOut) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;

  if (data == nullptr || len < kStoreHdrLen) return false;
  if (read_le_u32(data) != CRED_STORE_MAGIC) return false;
  if (read_le_u16(data + 4) != CRED_STORE_VERSION) return false;

  const uint16_t count = read_le_u16(data + 6);
  size_t off = kStoreHdrLen;

  for (uint16_t i = 0; i < count; ++i) {
    if (off + kRecHdrLen > len) return false;
    const uint16_t rpLen = read_le_u16(data + off + 0);
    const uint16_t labelLen = read_le_u16(data + off + 2);
    const uint16_t idLen = read_le_u16(data + off + 4);
    const uint16_t secretLen = read_le_u16(data + off + 6);
    off += kRecHdrLen;

    if (rpLen == 0 || rpLen > CRED_MAX_RPID_LEN) return false;
    if (labelLen > CRED_MAX_LABEL_LEN) return false;
    if (idLen == 0 || idLen > CRED_MAX_ID_LEN) return false;
    if (secretLen > CRED_MAX_SECRET_LEN) return false;

    const size_t payload = static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) + static_cast<size_t>(idLen) +
                           static_cast<size_t>(secretLen);
    if (off + payload > len) return false;
    off += payload;
  }

  if (off != len) return false;
  if (countOut) *countOut = count;
  return true;
}

static void cred_store_clear() {
  prefs.begin("kbm", false);
  prefs.remove("cred");
  prefs.end();
}

static void write_cred_store_header(uint8_t* out, const uint16_t count) {
  write_le_u32(out + 0, CRED_STORE_MAGIC);
  write_le_u16(out + 4, CRED_STORE_VERSION);
  write_le_u16(out + 6, count);
  write_le_u32(out + 8, 0);
}

static bool cred_store_load(uint8_t** outBuf, size_t* outLen, uint16_t* outCount) {
  if (outBuf) *outBuf = nullptr;
  if (outLen) *outLen = 0;
  if (outCount) *outCount = 0;

  prefs.begin("kbm", true);
  const size_t len = prefs.getBytesLength("cred");
  if (len == 0) {
    prefs.end();
    return true;
  }
  if (len > CRED_STORE_MAX_BYTES) {
    prefs.end();
    return false;
  }

  uint8_t* buf = static_cast<uint8_t*>(malloc(len));
  if (!buf) {
    prefs.end();
    return false;
  }

  const size_t got = prefs.getBytes("cred", buf, len);
  prefs.end();

  if (got != len) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  uint16_t count = 0;
  if (!cred_store_validate(buf, len, &count)) {
    secure_zero(buf, len);
    free(buf);
    cred_store_clear();
    return true;
  }

  if (outBuf) *outBuf = buf;
  if (outLen) *outLen = len;
  if (outCount) *outCount = count;
  return true;
}

static bool cred_store_save(const uint8_t* data, const size_t len) {
  if (len > CRED_STORE_MAX_BYTES) return false;
  prefs.begin("kbm", false);
  bool ok = false;
  if (data == nullptr || len == 0) ok = prefs.remove("cred");
  else ok = prefs.putBytes("cred", data, len);
  prefs.end();
  return ok;
}

static bool cred_store_delete_id(const uint8_t* id, const size_t idLen) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;
  if (buf == nullptr || len < kStoreHdrLen) return false;

  // First pass: determine new size/count
  size_t off = kStoreHdrLen;
  uint16_t newCount = 0;
  size_t newLen = kStoreHdrLen;
  bool removed = false;

  for (uint16_t i = 0; i < count; ++i) {
    const uint16_t rpLen = read_le_u16(buf + off + 0);
    const uint16_t labelLen = read_le_u16(buf + off + 2);
    const uint16_t curIdLen = read_le_u16(buf + off + 4);
    const uint16_t secretLen = read_le_u16(buf + off + 6);
    const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) +
                            static_cast<size_t>(curIdLen) + static_cast<size_t>(secretLen);

    const size_t idOff = off + kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen);
    const bool match = (curIdLen == idLen) && (memcmp(buf + idOff, id, idLen) == 0);
    if (match) {
      // Overwrite sensitive bytes in the in-memory buffer as a best-effort.
      const size_t secretOff = idOff + static_cast<size_t>(curIdLen);
      secure_zero(buf + secretOff, secretLen);
      removed = true;
    } else {
      newCount++;
      newLen += recTotal;
    }

    off += recTotal;
  }

  if (!removed) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  if (newCount == 0) {
    const bool ok = cred_store_save(nullptr, 0);
    secure_zero(buf, len);
    free(buf);
    return ok;
  }

  if (newLen > CRED_STORE_MAX_BYTES) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  uint8_t* out = static_cast<uint8_t*>(malloc(newLen));
  if (!out) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  write_cred_store_header(out, newCount);
  size_t w = kStoreHdrLen;
  off = kStoreHdrLen;

