sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  for (uint16_t i = 0; i < count; ++i) {
    const uint16_t rpLen = read_le_u16(buf + off + 0);
    const uint16_t labelLen = read_le_u16(buf + off + 2);
    const uint16_t curIdLen = read_le_u16(buf + off + 4);
    const uint16_t secretLen = read_le_u16(buf + off + 6);
    const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) +
                            static_cast<size_t>(curIdLen) + static_cast<size_t>(secretLen);

    const size_t idOff = off + kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen);
    const bool match = (curIdLen == idLen) && (memcmp(buf + idOff, id, idLen) == 0);
    if (!match) {
      memcpy(out + w, buf + off, recTotal);
      w += recTotal;
    }
    off += recTotal;
  }

  const bool ok = (w == newLen) && cred_store_save(out, newLen);
  secure_zero(out, newLen);
  free(out);
  secure_zero(buf, len);
  free(buf);
  return ok;
}

static bool cred_store_set_label_id(const uint8_t* id, const size_t idLen, const char* label, size_t labelLen) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;

  if (labelLen > CRED_MAX_LABEL_LEN) labelLen = CRED_MAX_LABEL_LEN;

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;
  if (buf == nullptr || len < kStoreHdrLen) return false;

  // Find record and compute new length
  size_t off = kStoreHdrLen;
  bool found = false;
  uint16_t oldLabelLen = 0;
  size_t newLen = len;

  for (uint16_t i = 0; i < count; ++i) {
    const uint16_t rpLen = read_le_u16(buf + off + 0);
    const uint16_t curLabelLen = read_le_u16(buf + off + 2);
    const uint16_t curIdLen = read_le_u16(buf + off + 4);
    const uint16_t secretLen = read_le_u16(buf + off + 6);
    const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(curLabelLen) +
                            static_cast<size_t>(curIdLen) + static_cast<size_t>(secretLen);

    const size_t idOff = off + kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(curLabelLen);
    const bool match = (curIdLen == idLen) && (memcmp(buf + idOff, id, idLen) == 0);
    if (match) {
      found = true;
      oldLabelLen = curLabelLen;
      newLen = len - static_cast<size_t>(curLabelLen) + labelLen;
      break;
    }
    off += recTotal;
  }

  if (!found || newLen > CRED_STORE_MAX_BYTES) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  uint8_t* out = static_cast<uint8_t*>(malloc(newLen));
  if (!out) {
    secure_zero(buf, len);
    free(buf);
    return false;
  }

  // Copy + rewrite the one record's label
  write_cred_store_header(out, count);
  size_t w = kStoreHdrLen;
  off = kStoreHdrLen;

  for (uint16_t i = 0; i < count; ++i) {
    const uint16_t rpLen = read_le_u16(buf + off + 0);
    const uint16_t curLabelLen = read_le_u16(buf + off + 2);
    const uint16_t curIdLen = read_le_u16(buf + off + 4);
    const uint16_t secretLen = read_le_u16(buf + off + 6);
    const uint32_t createdAt = read_le_u32(buf + off + 8);

    const size_t recPayloadLen = static_cast<size_t>(rpLen) + static_cast<size_t>(curLabelLen) + static_cast<size_t>(curIdLen) +
                                 static_cast<size_t>(secretLen);
    const size_t recTotal = kRecHdrLen + recPayloadLen;

    const uint8_t* rp = buf + off + kRecHdrLen;
    const uint8_t* curLabel = rp + rpLen;
    const uint8_t* curId = curLabel + curLabelLen;
    const uint8_t* curSecret = curId + curIdLen;

    const bool match = (curIdLen == idLen) && (memcmp(curId, id, idLen) == 0);

    if (!match) {
      memcpy(out + w, buf + off, recTotal);
      w += recTotal;
      off += recTotal;
      continue;
    }

    // Write record header
    write_le_u16(out + w + 0, rpLen);
    write_le_u16(out + w + 2, static_cast<uint16_t>(labelLen));
    write_le_u16(out + w + 4, curIdLen);
    write_le_u16(out + w + 6, secretLen);
    write_le_u32(out + w + 8, createdAt);
    w += kRecHdrLen;

    memcpy(out + w, rp, rpLen);
    w += rpLen;
    if (labelLen > 0 && label != nullptr) {
      memcpy(out + w, label, labelLen);
    }
    w += labelLen;
    memcpy(out + w, curId, curIdLen);
    w += curIdLen;
    memcpy(out + w, curSecret, secretLen);
    w += secretLen;

    off += recTotal;
  }

  const bool ok = (w == newLen) && cred_store_save(out, newLen);
  secure_zero(out, newLen);
  free(out);
  // Only clear the old label bytes in memory (best effort).
  if (found && oldLabelLen > 0) {
    // Nothing sensitive here, but keep behavior consistent.
  }
  secure_zero(buf, len);
  free(buf);
  return ok;
}

static bool build_keys_json(String& outJson) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;

  outJson = "";
  outJson.reserve(512);
  outJson += "{";
  outJson += "\"attestation_profile\":\"";
  outJson += attestation_profile_name(attestationProfile);
  outJson += "\",";
  outJson += "\"count\":";
  outJson += String(count);
  outJson += ",\"entries\":[";

  if (buf != nullptr && len >= kStoreHdrLen) {
    size_t off = kStoreHdrLen;
    bool first = true;
    for (uint16_t i = 0; i < count; ++i) {
      const uint16_t rpLen = read_le_u16(buf + off + 0);
      const uint16_t labelLen = read_le_u16(buf + off + 2);
      const uint16_t idLen = read_le_u16(buf + off + 4);
      const uint16_t secretLen = read_le_u16(buf + off + 6);
      const uint32_t createdAt = read_le_u32(buf + off + 8);

      const uint8_t* rp = buf + off + kRecHdrLen;
      const uint8_t* label = rp + rpLen;
      const uint8_t* id = label + labelLen;

      char idHex[(CRED_MAX_ID_LEN * 2) + 1];
      bytes_to_hex(id, idLen, idHex, sizeof(idHex));

      if (!first) outJson += ",";
      first = false;
      outJson += "{";
      outJson += "\"rp\":\"";
      json_append_escaped(outJson, reinterpret_cast<const char*>(rp), rpLen);
      outJson += "\",";
      outJson += "\"label\":\"";
      json_append_escaped(outJson, reinterpret_cast<const char*>(label), labelLen);
      outJson += "\",";
      outJson += "\"id\":\"";
      outJson += idHex;
      outJson += "\",";
      outJson += "\"created\":";
      outJson += String(createdAt);
      outJson += "}";

