sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
      const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) + static_cast<size_t>(idLen) +
                              static_cast<size_t>(secretLen);
      off += recTotal;
    }
  }

  outJson += "]}";

  if (buf != nullptr) {
    secure_zero(buf, len);
    free(buf);
  }
  return true;
}

static bool derive_backup_key(const char* password, const uint8_t* salt, const size_t saltLen, const uint32_t iters, uint8_t outKey[32]) {
  if (password == nullptr || password[0] == '\0') return false;
  if (salt == nullptr || saltLen == 0) return false;
  const size_t plen = strlen(password);
  if (plen < 8) return false;

  const int rc = mbedtls_pkcs5_pbkdf2_hmac_ext(MBEDTLS_MD_SHA256, reinterpret_cast<const unsigned char*>(password), plen, salt,
                                               saltLen, iters, 32, outKey);
  return rc == 0;
}

static bool aes_gcm_encrypt(const uint8_t key[32], const uint8_t iv[12], const uint8_t* plain, const size_t plainLen,
                            uint8_t* cipher, uint8_t tag[16]) {
  if (!key || !iv || !plain || !cipher || !tag) return false;
  mbedtls_gcm_context gcm;
  mbedtls_gcm_init(&gcm);
  const int rc1 = mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, key, 256);
  if (rc1 != 0) {
    mbedtls_gcm_free(&gcm);
    return false;
  }
  const int rc2 = mbedtls_gcm_crypt_and_tag(&gcm, MBEDTLS_GCM_ENCRYPT, plainLen, iv, 12, nullptr, 0, plain, cipher, 16, tag);
  mbedtls_gcm_free(&gcm);
  return rc2 == 0;
}

static bool aes_gcm_decrypt(const uint8_t key[32], const uint8_t iv[12], const uint8_t* cipher, const size_t cipherLen,
                            const uint8_t tag[16], uint8_t* plainOut) {
  if (!key || !iv || !cipher || !plainOut || !tag) return false;
  mbedtls_gcm_context gcm;
  mbedtls_gcm_init(&gcm);
  const int rc1 = mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, key, 256);
  if (rc1 != 0) {
    mbedtls_gcm_free(&gcm);
    return false;
  }
  const int rc2 = mbedtls_gcm_auth_decrypt(&gcm, cipherLen, iv, 12, nullptr, 0, tag, 16, cipher, plainOut);
  mbedtls_gcm_free(&gcm);
  return rc2 == 0;
}

static bool build_backup_plain(uint8_t** out, size_t* outLen) {
  static constexpr uint32_t kPlainMagic = 0x3150424BU; // "KBP1"
  static constexpr uint16_t kPlainVer = 1;
  static constexpr size_t kHdrLen = 12; // magic(4) + ver(2) + profile(1) + rsv(1) + blobLen(4)

  if (out) *out = nullptr;
  if (outLen) *outLen = 0;

  uint8_t* cred = nullptr;
  size_t credLen = 0;
  uint16_t credCount = 0;
  if (!cred_store_load(&cred, &credLen, &credCount)) return false;

  const uint32_t blobLen32 = static_cast<uint32_t>(cred ? credLen : 0);
  const size_t total = kHdrLen + static_cast<size_t>(blobLen32);
  if (total > (CRED_STORE_MAX_BYTES + 64)) {
    if (cred) {
      secure_zero(cred, credLen);
      free(cred);
    }
    return false;
  }

  uint8_t* buf = static_cast<uint8_t*>(malloc(total));
  if (!buf) {
    if (cred) {
      secure_zero(cred, credLen);
      free(cred);
    }
    return false;
  }

  write_le_u32(buf + 0, kPlainMagic);
  write_le_u16(buf + 4, kPlainVer);
  buf[6] = static_cast<uint8_t>(attestationProfile);
  buf[7] = 0;
  write_le_u32(buf + 8, blobLen32);
  if (blobLen32 > 0 && cred != nullptr) {
    memcpy(buf + kHdrLen, cred, blobLen32);
  }

  if (cred) {
    secure_zero(cred, credLen);
    free(cred);
  }

  if (out) *out = buf;
  if (outLen) *outLen = total;
  return true;
}

static bool restore_from_backup_plain(const uint8_t* plain, const size_t plainLen) {
  static constexpr uint32_t kPlainMagic = 0x3150424BU; // "KBP1"
  static constexpr uint16_t kPlainVer = 1;
  static constexpr size_t kHdrLen = 12;

  if (plain == nullptr || plainLen < kHdrLen) return false;
  if (read_le_u32(plain + 0) != kPlainMagic) return false;
  if (read_le_u16(plain + 4) != kPlainVer) return false;

  const uint8_t profRaw = plain[6];
  const uint32_t blobLen = read_le_u32(plain + 8);
  if (static_cast<size_t>(blobLen) != (plainLen - kHdrLen)) return false;
  if (blobLen > CRED_STORE_MAX_BYTES) return false;

  AttestationProfile prof = (profRaw == static_cast<uint8_t>(AttestationProfile::None)) ? AttestationProfile::None : AttestationProfile::Diy;

  if (blobLen == 0) {
    // Clear credentials only; keep other settings.
    if (!cred_store_save(nullptr, 0)) return false;
    save_attestation_profile(prof);
    return true;
  }

  const uint8_t* blob = plain + kHdrLen;
  uint16_t count = 0;
  if (!cred_store_validate(blob, blobLen, &count)) return false;
  if (!cred_store_save(blob, blobLen)) return false;
  save_attestation_profile(prof);
  return true;
}

static bool build_encrypted_backup(const char* password, uint8_t** out, size_t* outLen) {
  static constexpr uint32_t kEncMagic = 0x3142424BU; // "KBB1"
  static constexpr uint16_t kEncVer = 1;
  static constexpr uint32_t kIters = 50000;
  static constexpr size_t kSaltLen = 16;
  static constexpr size_t kIvLen = 12;
  static constexpr size_t kTagLen = 16;
  static constexpr size_t kHdrLen = 4 + 2 + 2 + 4 + kSaltLen + kIvLen + 4;

  if (out) *out = nullptr;
  if (outLen) *outLen = 0;

  uint8_t* plain = nullptr;
  size_t plainLen = 0;
  if (!build_backup_plain(&plain, &plainLen)) return false;

  uint8_t salt[kSaltLen];
  uint8_t iv[kIvLen];
  esp_fill_random(salt, sizeof(salt));
  esp_fill_random(iv, sizeof(iv));

  uint8_t key[32];
  if (!derive_backup_key(password, salt, sizeof(salt), kIters, key)) {
    secure_zero(plain, plainLen);
    free(plain);
    return false;
  }

  const size_t total = kHdrLen + plainLen + kTagLen;
  uint8_t* enc = static_cast<uint8_t*>(malloc(total));
  if (!enc) {
    secure_zero(key, sizeof(key));
    secure_zero(plain, plainLen);
    free(plain);
    return false;
  }

  write_le_u32(enc + 0, kEncMagic);
  write_le_u16(enc + 4, kEncVer);
  write_le_u16(enc + 6, 0);
  write_le_u32(enc + 8, kIters);
  memcpy(enc + 12, salt, kSaltLen);
  memcpy(enc + 12 + kSaltLen, iv, kIvLen);
  write_le_u32(enc + 12 + kSaltLen + kIvLen, static_cast<uint32_t>(plainLen));

  uint8_t* cipher = enc + kHdrLen;
  uint8_t tag[kTagLen];
  const bool okEnc = aes_gcm_encrypt(key, iv, plain, plainLen, cipher, tag);
  secure_zero(key, sizeof(key));
  secure_zero(plain, plainLen);
  free(plain);

