sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  if (!okEnc) {
    secure_zero(enc, total);
    free(enc);
    return false;
  }

  memcpy(enc + kHdrLen + plainLen, tag, kTagLen);

  if (out) *out = enc;
  if (outLen) *outLen = total;
  return true;
}

static bool decrypt_and_restore_backup(const uint8_t* enc, const size_t encLen, const char* password) {
  static constexpr uint32_t kEncMagic = 0x3142424BU; // "KBB1"
  static constexpr uint16_t kEncVer = 1;
  static constexpr size_t kSaltLen = 16;
  static constexpr size_t kIvLen = 12;
  static constexpr size_t kTagLen = 16;
  static constexpr size_t kHdrLen = 4 + 2 + 2 + 4 + kSaltLen + kIvLen + 4;

  if (enc == nullptr || encLen < (kHdrLen + kTagLen)) return false;
  if (read_le_u32(enc + 0) != kEncMagic) return false;
  if (read_le_u16(enc + 4) != kEncVer) return false;

  const uint32_t iters = read_le_u32(enc + 8);
  if (iters < 1000 || iters > 200000) return false;

  const uint8_t* salt = enc + 12;
  const uint8_t* iv = enc + 12 + kSaltLen;
  const uint32_t plainLen32 = read_le_u32(enc + 12 + kSaltLen + kIvLen);
  const size_t plainLen = static_cast<size_t>(plainLen32);
  const size_t need = kHdrLen + plainLen + kTagLen;
  if (need != encLen) return false;
  if (plainLen > (CRED_STORE_MAX_BYTES + 64)) return false;

  uint8_t key[32];
  if (!derive_backup_key(password, salt, kSaltLen, iters, key)) return false;

  uint8_t* plain = static_cast<uint8_t*>(malloc(plainLen));
  if (!plain) {
    secure_zero(key, sizeof(key));
    return false;
  }

  const uint8_t* cipher = enc + kHdrLen;
  const uint8_t* tag = enc + kHdrLen + plainLen;
  const bool okDec = aes_gcm_decrypt(key, iv, cipher, plainLen, tag, plain);
  secure_zero(key, sizeof(key));

  if (!okDec) {
    secure_zero(plain, plainLen);
    free(plain);
    return false;
  }

  const bool okRestore = restore_from_backup_plain(plain, plainLen);
  secure_zero(plain, plainLen);
  free(plain);
  return okRestore;
}

static void reset_restore_upload() {
  if (restoreUpload.buf != nullptr && restoreUpload.cap > 0) {
    secure_zero(restoreUpload.buf, restoreUpload.cap);
    free(restoreUpload.buf);
  }
  restoreUpload.buf = nullptr;
  restoreUpload.len = 0;
  restoreUpload.cap = 0;
  restoreUpload.error = false;
}

static void handle_restore_upload_chunk() {
  // Upload handler for "/backup/restore" (multipart/form-data file).
  HTTPUpload& up = server.upload();

  static constexpr size_t kMaxUpload = CRED_STORE_MAX_BYTES + 256;

  if (up.status == UPLOAD_FILE_START) {
    reset_restore_upload();
    if (!is_authenticated_request() || !admin_unlocked()) {
      restoreUpload.error = true;
      return;
    }
    if (up.totalSize == 0 || up.totalSize > kMaxUpload) {
      restoreUpload.error = true;
      return;
    }
    restoreUpload.cap = up.totalSize;
    restoreUpload.buf = static_cast<uint8_t*>(malloc(restoreUpload.cap));
    if (!restoreUpload.buf) {
      restoreUpload.error = true;
      restoreUpload.cap = 0;
      return;
    }
    restoreUpload.len = 0;
    return;
  }

  if (up.status == UPLOAD_FILE_WRITE) {
    if (restoreUpload.error || restoreUpload.buf == nullptr) return;
    if (restoreUpload.len + up.currentSize > restoreUpload.cap) {
      restoreUpload.error = true;
      return;
    }
    memcpy(restoreUpload.buf + restoreUpload.len, up.buf, up.currentSize);
    restoreUpload.len += up.currentSize;
    return;
  }

  if (up.status == UPLOAD_FILE_ABORTED) {
    restoreUpload.error = true;
    return;
  }

  // UPLOAD_FILE_END: handled by the POST handler.
}

static int base32_value(char c) {
  if (c >= 'A' && c <= 'Z') return c - 'A';
  if (c >= 'a' && c <= 'z') return c - 'a';
  if (c >= '2' && c <= '7') return 26 + (c - '2');
  return -1;
}

static size_t base32_decode(const char* in, uint8_t* out, const size_t outMax) {
  if (in == nullptr || out == nullptr || outMax == 0) return 0;

  uint64_t buffer = 0;
  uint8_t bits = 0;
  size_t outLen = 0;

  for (const char* p = in; *p; ++p) {
    if (*p == '=') break;
    const int v = base32_value(*p);
    if (v < 0) continue;  // skip spaces, dashes, etc

    buffer = (buffer << 5) | static_cast<uint64_t>(v);
    bits = static_cast<uint8_t>(bits + 5);
    while (bits >= 8) {
      bits = static_cast<uint8_t>(bits - 8);
      if (outLen >= outMax) return 0;
      out[outLen++] = static_cast<uint8_t>((buffer >> bits) & 0xFFU);
    }
  }

  return outLen;
}

static void clear_totp_config() {
  totpKeyLen = 0;
  totpDigits = TOTP_DEFAULT_DIGITS;
  totpPeriodS = TOTP_DEFAULT_PERIOD_S;
  totpAppendEnter = false;
}

static void load_totp_config() {
  clear_totp_config();

  prefs.begin("kbm", true);
  const String secret = prefs.getString("totp_s", "");
  totpDigits = prefs.getUChar("totp_d", TOTP_DEFAULT_DIGITS);
  totpPeriodS = prefs.getUInt("totp_p", TOTP_DEFAULT_PERIOD_S);
  totpAppendEnter = prefs.getBool("totp_e", false);
  prefs.end();

  if (totpDigits < 6) totpDigits = 6;
  if (totpDigits > 10) totpDigits = 10;
  if (totpPeriodS < 10) totpPeriodS = 10;
  if (totpPeriodS > 120) totpPeriodS = 120;

  if (secret.length() == 0) return;
  totpKeyLen = base32_decode(secret.c_str(), totpKey, sizeof(totpKey));
  if (totpKeyLen == 0) clear_totp_config();
}

static bool save_totp_config_from_form(const String& secretRaw, const String& digitsRaw, const String& periodRaw, const bool appendEnter) {
  String s = secretRaw;
  s.trim();

  // Normalize secret for storage: keep base32 chars only, uppercase.
  String cleaned;
  cleaned.reserve(s.length());
  for (size_t i = 0; i < s.length(); ++i) {
    const char c = s[i];
    if (c == '=' || c == ' ' || c == '\t' || c == '\r' || c == '\n' || c == '-') continue;
    const int v = base32_value(c);
    if (v < 0) continue;
    cleaned += static_cast<char>(toupper(static_cast<unsigned char>(c)));
  }

  if (cleaned.length() == 0) return false;

  uint8_t decoded[TOTP_KEY_MAX_BYTES];
  const size_t decodedLen = base32_decode(cleaned.c_str(), decoded, sizeof(decoded));
  if (decodedLen == 0) return false;

  uint32_t period = TOTP_DEFAULT_PERIOD_S;
  int64_t tmp = 0;
  if (parse_i64(periodRaw, &tmp) && tmp >= 10 && tmp <= 120) period = static_cast<uint32_t>(tmp);

  uint8_t digits = TOTP_DEFAULT_DIGITS;
  if (parse_i64(digitsRaw, &tmp) && tmp >= 6 && tmp <= 10) digits = static_cast<uint8_t>(tmp);

  prefs.begin("kbm", false);
  prefs.putString("totp_s", cleaned);
  prefs.putUChar("totp_d", digits);
  prefs.putUInt("totp_p", period);
  prefs.putBool("totp_e", appendEnter);
  prefs.end();

