sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  memcpy(totpKey, decoded, decodedLen);
  totpKeyLen = decodedLen;
  totpDigits = digits;
  totpPeriodS = period;
  totpAppendEnter = appendEnter;
  return true;
}

static void clear_totp_prefs() {
  prefs.begin("kbm", false);
  prefs.remove("totp_s");
  prefs.remove("totp_d");
  prefs.remove("totp_p");
  prefs.remove("totp_e");
  prefs.end();
  clear_totp_config();
}

static bool set_time_from_unix_ms(const int64_t unixMs) {
  if (unixMs <= 0) return false;
  const int64_t nowUs = esp_timer_get_time();
  timeOffsetUs = (unixMs * 1000LL) - nowUs;
  timeSynced = true;
  return true;
}

static bool get_unix_seconds(uint64_t* unixSecondsOut) {
  if (!timeSynced) return false;
  const int64_t nowUs = esp_timer_get_time() + timeOffsetUs;
  if (nowUs <= 0) return false;
  *unixSecondsOut = static_cast<uint64_t>(nowUs / 1000000LL);
  return true;
}

static bool ct_equal(const uint8_t* a, const uint8_t* b, const size_t len) {
  if (!a || !b) return false;
  uint8_t diff = 0;
  for (size_t i = 0; i < len; ++i) diff |= static_cast<uint8_t>(a[i] ^ b[i]);
  return diff == 0;
}

static void hsm_mark_presence_now() {
  hsmPresenceUntil = millis() + HSM_PRESENCE_WINDOW_MS;
}

static void hsm_consume_presence() {
  hsmPresenceUntil = 0;
}

static bool fido_pin_hash16_derive(const char* pin, uint8_t outHash16[FIDO_PIN_HASH16_BYTES]) {
  if (!pin || !outHash16) return false;
  const size_t pinLen = strlen(pin);
  if (pinLen < HSM_PIN_MIN_LEN || pinLen > HSM_PIN_MAX_LEN) return false;

  uint8_t full[32] = {0};
  if (mbedtls_sha256(reinterpret_cast<const uint8_t*>(pin), pinLen, full, 0) != 0) return false;
  memcpy(outHash16, full, FIDO_PIN_HASH16_BYTES);
  secure_zero(full, sizeof(full));
  return true;
}

static bool fido_pin_hash16_save(const uint8_t hash16[FIDO_PIN_HASH16_BYTES]) {
  if (!hash16) return false;
  prefs.begin("kbm", false);
  const size_t n = prefs.putBytes("fido_ph", hash16, FIDO_PIN_HASH16_BYTES);
  prefs.end();
  return n == FIDO_PIN_HASH16_BYTES;
}

static bool fido_pin_hash16_set_from_pin(const char* pin) {
  uint8_t h[FIDO_PIN_HASH16_BYTES] = {0};
  if (!fido_pin_hash16_derive(pin, h)) return false;
  if (!fido_pin_hash16_save(h)) {
    secure_zero(h, sizeof(h));
    return false;
  }
  memcpy(fidoPinHash16, h, sizeof(fidoPinHash16));
  fidoPinHash16Valid = true;
  secure_zero(h, sizeof(h));
  return true;
}

static void fido_pin_hash16_clear_local() {
  fidoPinHash16Valid = false;
  secure_zero(fidoPinHash16, sizeof(fidoPinHash16));
}

static bool fido_pin_hash16_load_from_prefs() {
  uint8_t h[FIDO_PIN_HASH16_BYTES] = {0};
  prefs.begin("kbm", true);
  const size_t hl = prefs.getBytesLength("fido_ph");
  if (hl != FIDO_PIN_HASH16_BYTES) {
    prefs.end();
    fido_pin_hash16_clear_local();
    return false;
  }
  const size_t hg = prefs.getBytes("fido_ph", h, sizeof(h));
  prefs.end();
  if (hg != sizeof(h)) {
    fido_pin_hash16_clear_local();
    return false;
  }
  memcpy(fidoPinHash16, h, sizeof(fidoPinHash16));
  fidoPinHash16Valid = true;
  secure_zero(h, sizeof(h));
  return true;
}

static bool hsm_pin_save_hash(const uint8_t salt[HSM_PIN_SALT_BYTES], const uint8_t hash[HSM_PIN_HASH_BYTES]) {
  if (!salt || !hash) return false;
  prefs.begin("kbm", false);
  const size_t sw = prefs.putBytes("hsm_ps", salt, HSM_PIN_SALT_BYTES);
  const size_t hw = prefs.putBytes("hsm_ph", hash, HSM_PIN_HASH_BYTES);
  prefs.end();
  return sw == HSM_PIN_SALT_BYTES && hw == HSM_PIN_HASH_BYTES;
}

static void hsm_pin_clear_local() {
  hsmPinConfigured = false;
  hsmPinUnlockedUntil = 0;
  secure_zero(hsmPinSalt, sizeof(hsmPinSalt));
  secure_zero(hsmPinHash, sizeof(hsmPinHash));
  fido_pin_hash16_clear_local();
}

static void hsm_pin_clear_prefs() {
  prefs.begin("kbm", false);
  prefs.remove("hsm_ps");
  prefs.remove("hsm_ph");
  prefs.remove("fido_ph");
  prefs.end();
  hsm_pin_clear_local();
}

static bool hsm_pin_derive(const char* pin, const uint8_t* salt, const size_t saltLen, uint8_t outHash[HSM_PIN_HASH_BYTES]) {
  if (!pin || !salt || !outHash) return false;
  const size_t pinLen = strlen(pin);
  if (pinLen < HSM_PIN_MIN_LEN || pinLen > HSM_PIN_MAX_LEN) return false;
  const int rc = mbedtls_pkcs5_pbkdf2_hmac_ext(MBEDTLS_MD_SHA256, reinterpret_cast<const unsigned char*>(pin), pinLen, salt, saltLen,
                                               HSM_PIN_PBKDF2_ITERS, HSM_PIN_HASH_BYTES, outHash);
  return rc == 0;
}

static bool hsm_pin_verify(const char* pin) {
  if (!hsmPinConfigured) return false;
  uint8_t derived[HSM_PIN_HASH_BYTES] = {0};
  if (!hsm_pin_derive(pin, hsmPinSalt, sizeof(hsmPinSalt), derived)) return false;
  const bool ok = ct_equal(derived, hsmPinHash, sizeof(derived));
  secure_zero(derived, sizeof(derived));
  return ok;
}

static bool hsm_pin_set(const char* pin) {
  if (!pin) return false;
  uint8_t salt[HSM_PIN_SALT_BYTES] = {0};
  uint8_t hash[HSM_PIN_HASH_BYTES] = {0};
  esp_fill_random(salt, sizeof(salt));
  if (!hsm_pin_derive(pin, salt, sizeof(salt), hash)) {
    secure_zero(hash, sizeof(hash));
    return false;
  }
  if (!hsm_pin_save_hash(salt, hash)) {
    secure_zero(hash, sizeof(hash));
    return false;
  }
  memcpy(hsmPinSalt, salt, sizeof(hsmPinSalt));
  memcpy(hsmPinHash, hash, sizeof(hsmPinHash));
  hsmPinConfigured = true;
  hsmPinUnlockedUntil = millis() + HSM_PIN_UNLOCK_WINDOW_MS;
  (void)fido_pin_hash16_set_from_pin(pin);
  secure_zero(hash, sizeof(hash));
  return true;
}

static bool hsm_pin_load_from_prefs() {
  uint8_t salt[HSM_PIN_SALT_BYTES] = {0};
  uint8_t hash[HSM_PIN_HASH_BYTES] = {0};
  prefs.begin("kbm", true);
  const size_t sl = prefs.getBytesLength("hsm_ps");
  const size_t hl = prefs.getBytesLength("hsm_ph");
  if (sl != HSM_PIN_SALT_BYTES || hl != HSM_PIN_HASH_BYTES) {
    prefs.end();
    hsm_pin_clear_local();
    return false;
  }
  const size_t sg = prefs.getBytes("hsm_ps", salt, sizeof(salt));
  const size_t hg = prefs.getBytes("hsm_ph", hash, sizeof(hash));
  prefs.end();
  if (sg != sizeof(salt) || hg != sizeof(hash)) {
    hsm_pin_clear_prefs();
    return false;
  }
  memcpy(hsmPinSalt, salt, sizeof(hsmPinSalt));
  memcpy(hsmPinHash, hash, sizeof(hsmPinHash));
  hsmPinConfigured = true;
  hsmPinUnlockedUntil = 0;
  (void)fido_pin_hash16_load_from_prefs();
  return true;
}

static bool hsm_pin_unlock_with_pin(const char* pin) {
  if (!hsmPinConfigured) return false;
  if (!hsm_pin_verify(pin)) return false;
  hsmPinUnlockedUntil = millis() + HSM_PIN_UNLOCK_WINDOW_MS;
  if (!fidoPinHash16Valid) {
    (void)fido_pin_hash16_set_from_pin(pin);
  }
  return true;
}

// Shared policy hooks used by HSM and FIDO paths.
bool security_pin_configured() {
  return hsmPinConfigured;
}

bool security_pin_unlocked_now() {
  return (!hsmPinConfigured) || hsm_pin_unlocked();
}

bool security_fido_pin_hash16_get(uint8_t outHash16[16]) {
  if (!outHash16) return false;
  if (!hsmPinConfigured || !fidoPinHash16Valid) return false;
  memcpy(outHash16, fidoPinHash16, 16);
  return true;
}

bool security_presence_satisfied_now() {
  return hsm_presence_satisfied();
}

void security_presence_consume() {
  hsm_consume_presence();
}

static int hsm_mbedtls_rng(void* ctx, unsigned char* out, const size_t len) {
  (void)ctx;
  esp_fill_random(out, len);
  return 0;
}

static void hsm_clear_runtime() {
  secure_zero(hsmState.priv, sizeof(hsmState.priv));
  secure_zero(hsmState.pub, sizeof(hsmState.pub));
  hsmState.loaded = false;
  hsmState.createdAt = 0;
  hsmState.signCount = 0;
  hsmState.lastSignMs = 0;
}

static void hsm_delete_private_key_prefs() {
  prefs.begin("kbm", false);
  prefs.remove("hsm_prv");
  prefs.remove("hsm_ct");
  prefs.end();
}

static bool hsm_store_private_key(const uint8_t priv[HSM_PRIVKEY_BYTES], const uint32_t createdAt) {
  if (!priv) return false;
  prefs.begin("kbm", false);
  const size_t wr = prefs.putBytes("hsm_prv", priv, HSM_PRIVKEY_BYTES);
  prefs.putUInt("hsm_ct", createdAt);
  prefs.end();
  return wr == HSM_PRIVKEY_BYTES;
}

static bool hsm_compute_pub_from_priv(const uint8_t priv[HSM_PRIVKEY_BYTES], uint8_t outPub[HSM_PUBKEY_BYTES]) {
  if (!priv || !outPub) return false;

