sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);

  if (mbedtls_ecp_read_key(MBEDTLS_ECP_DP_SECP256R1, &key, priv, HSM_PRIVKEY_BYTES) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  if (mbedtls_ecp_keypair_calc_public(&key, hsm_mbedtls_rng, nullptr) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  uint8_t pub[65] = {0};
  size_t pubLen = 0;
  const int rc = mbedtls_ecp_write_public_key(&key, MBEDTLS_ECP_PF_UNCOMPRESSED, &pubLen, pub, sizeof(pub));
  mbedtls_ecp_keypair_free(&key);
  if (rc != 0 || pubLen != sizeof(pub) || pub[0] != 0x04) return false;

  memcpy(outPub, pub + 1, HSM_PUBKEY_BYTES);
  return true;
}

static bool hsm_set_runtime_key(const uint8_t priv[HSM_PRIVKEY_BYTES], const uint32_t createdAt) {
  uint8_t pub[HSM_PUBKEY_BYTES] = {0};
  if (!hsm_compute_pub_from_priv(priv, pub)) return false;
  memcpy(hsmState.priv, priv, HSM_PRIVKEY_BYTES);
  memcpy(hsmState.pub, pub, HSM_PUBKEY_BYTES);
  hsmState.loaded = true;
  hsmState.createdAt = createdAt;
  hsmState.signCount = 0;
  hsmState.lastSignMs = 0;
  return true;
}

static uint32_t hsm_now_unix_or_zero() {
  uint64_t unixS = 0;
  if (!get_unix_seconds(&unixS)) return 0;
  if (unixS > UINT32_MAX) return 0;
  return static_cast<uint32_t>(unixS);
}

static bool hsm_load_from_prefs() {
  uint8_t priv[HSM_PRIVKEY_BYTES] = {0};

  prefs.begin("kbm", true);
  const size_t len = prefs.getBytesLength("hsm_prv");
  if (len != HSM_PRIVKEY_BYTES) {
    prefs.end();
    hsm_clear_runtime();
    return false;
  }
  const size_t got = prefs.getBytes("hsm_prv", priv, sizeof(priv));
  const uint32_t createdAt = prefs.getUInt("hsm_ct", 0);
  prefs.end();

  if (got != HSM_PRIVKEY_BYTES) {
    secure_zero(priv, sizeof(priv));
    hsm_clear_runtime();
    return false;
  }

  const bool ok = hsm_set_runtime_key(priv, createdAt);
  secure_zero(priv, sizeof(priv));
  if (!ok) {
    hsm_delete_private_key_prefs();
    hsm_clear_runtime();
  }
  return ok;
}

static bool hsm_generate_and_store_key() {
  uint8_t priv[HSM_PRIVKEY_BYTES] = {0};
  uint8_t pub[65] = {0};

  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);
  const int rc = mbedtls_ecp_gen_key(MBEDTLS_ECP_DP_SECP256R1, &key, hsm_mbedtls_rng, nullptr);
  if (rc != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  size_t privLen = 0;
  if (mbedtls_ecp_write_key_ext(&key, &privLen, priv, sizeof(priv)) != 0 || privLen != sizeof(priv)) {
    mbedtls_ecp_keypair_free(&key);
    secure_zero(priv, sizeof(priv));
    return false;
  }

  size_t pubLen = 0;
  if (mbedtls_ecp_write_public_key(&key, MBEDTLS_ECP_PF_UNCOMPRESSED, &pubLen, pub, sizeof(pub)) != 0 || pubLen != sizeof(pub) ||
      pub[0] != 0x04) {
    mbedtls_ecp_keypair_free(&key);
    secure_zero(priv, sizeof(priv));
    return false;
  }
  mbedtls_ecp_keypair_free(&key);

  const uint32_t createdAt = hsm_now_unix_or_zero();
  const bool stored = hsm_store_private_key(priv, createdAt);
  if (!stored) {
    secure_zero(priv, sizeof(priv));
    return false;
  }

  const bool loaded = hsm_set_runtime_key(priv, createdAt);
  secure_zero(priv, sizeof(priv));
  if (!loaded) {
    hsm_delete_private_key_prefs();
    hsm_clear_runtime();
    return false;
  }
  return true;
}

static bool hsm_delete_key() {
  hsm_delete_private_key_prefs();
  hsm_clear_runtime();
  return true;
}

static bool hsm_digest_from_form_input(const String& fmt, const String& value, uint8_t outDigest[32], size_t* inputLenOut) {
  if (!outDigest) return false;
  if (inputLenOut) *inputLenOut = 0;

  String mode = fmt;
  mode.trim();
  mode.toLowerCase();

  if (mode.length() == 0 || mode == "text") {
    if (value.length() > HSM_SIGN_INPUT_MAX) return false;
    const uint8_t* msg = reinterpret_cast<const uint8_t*>(value.c_str());
    const size_t msgLen = value.length();
    if (mbedtls_sha256(msg, msgLen, outDigest, 0) != 0) return false;
    if (inputLenOut) *inputLenOut = msgLen;
    return true;
  }

  if (mode == "hex") {
    if (value.length() == 0 || (value.length() % 2) != 0) return false;
    uint8_t tmp[HSM_SIGN_INPUT_MAX] = {0};
    const size_t n = hex_to_bytes(value.c_str(), tmp, sizeof(tmp));
    if (n == 0) return false;
    const bool ok = (mbedtls_sha256(tmp, n, outDigest, 0) == 0);
    secure_zero(tmp, sizeof(tmp));
    if (!ok) return false;
    if (inputLenOut) *inputLenOut = n;
    return true;
  }

  if (mode == "digesthex") {
    uint8_t tmp[32] = {0};
    const size_t n = hex_to_bytes(value.c_str(), tmp, sizeof(tmp));
    if (n != sizeof(tmp)) {
      secure_zero(tmp, sizeof(tmp));
      return false;
    }
    memcpy(outDigest, tmp, sizeof(tmp));
    secure_zero(tmp, sizeof(tmp));
    if (inputLenOut) *inputLenOut = 32;
    return true;
  }

  return false;
}

static bool hsm_sign_digest_der(const uint8_t digest[32], uint8_t* sigOut, const size_t sigOutMax, size_t* sigLenOut) {
  if (sigLenOut) *sigLenOut = 0;
  if (!digest || !sigOut || !sigLenOut) return false;
  if (!hsmState.loaded) return false;
  if (sigOutMax < 8) return false;

  const uint32_t now = millis();
  if (hsmState.lastSignMs != 0 &&
      static_cast<int32_t>(now - hsmState.lastSignMs) < static_cast<int32_t>(HSM_SIGN_COOLDOWN_MS)) {
    return false;
  }

  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);
  if (mbedtls_ecp_read_key(MBEDTLS_ECP_DP_SECP256R1, &key, hsmState.priv, HSM_PRIVKEY_BYTES) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  if (mbedtls_ecp_keypair_calc_public(&key, hsm_mbedtls_rng, nullptr) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  mbedtls_ecdsa_context ecdsa;
  mbedtls_ecdsa_init(&ecdsa);
  if (mbedtls_ecdsa_from_keypair(&ecdsa, &key) != 0) {
    mbedtls_ecdsa_free(&ecdsa);
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  size_t sigLen = 0;
  const int rc = mbedtls_ecdsa_write_signature(&ecdsa, MBEDTLS_MD_SHA256, digest, 32, sigOut, sigOutMax, &sigLen, hsm_mbedtls_rng,
                                               nullptr);
  mbedtls_ecdsa_free(&ecdsa);
  mbedtls_ecp_keypair_free(&key);
  if (rc != 0 || sigLen == 0 || sigLen > sigOutMax) return false;

  *sigLenOut = sigLen;
  hsmState.lastSignMs = now;
  hsmState.signCount++;
  return true;
}

