sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static bool hsm_verify_digest_der(const uint8_t digest[32], const uint8_t* sigDer, const size_t sigDerLen) {
  if (!digest || !sigDer || sigDerLen == 0) return false;
  if (!hsmState.loaded) return false;

  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);
  if (mbedtls_ecp_read_key(MBEDTLS_ECP_DP_SECP256R1, &key, hsmState.priv, HSM_PRIVKEY_BYTES) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  if (mbedtls_ecp_keypair_calc_public(&key, hsm_mbedtls_rng, nullptr) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  mbedtls_ecdsa_context ecdsa;
  mbedtls_ecdsa_init(&ecdsa);
  if (mbedtls_ecdsa_from_keypair(&ecdsa, &key) != 0) {
    mbedtls_ecdsa_free(&ecdsa);
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  const int rc = mbedtls_ecdsa_read_signature(&ecdsa, digest, 32, sigDer, sigDerLen);
  mbedtls_ecdsa_free(&ecdsa);
  mbedtls_ecp_keypair_free(&key);
  return rc == 0;
}

static void hsm_public_key_uncompressed(uint8_t out65[65]) {
  if (!out65) return;
  memset(out65, 0, 65);
  if (!hsmState.loaded) return;
  out65[0] = 0x04;
  memcpy(out65 + 1, hsmState.pub, HSM_PUBKEY_BYTES);
}

static void hsm_pubkey_hex(char* out, const size_t outLen) {
  uint8_t pub[65] = {0};
  hsm_public_key_uncompressed(pub);
  bytes_to_hex(pub, hsmState.loaded ? sizeof(pub) : 0, out, outLen);
}

static void hsm_pubkey_fingerprint_hex(char* out, const size_t outLen) {
  if (!out || outLen == 0) return;
  out[0] = '\0';
  if (!hsmState.loaded) return;

  uint8_t pub[65] = {0};
  uint8_t hash[32] = {0};
  hsm_public_key_uncompressed(pub);
  if (mbedtls_sha256(pub, sizeof(pub), hash, 0) != 0) return;
  // 8-byte short fingerprint (16 hex chars) for quick visual checks.
  bytes_to_hex(hash, 8, out, outLen);
}

static bool build_hsm_status_json(String& outJson) {
  char pubHex[(65 * 2) + 1] = {0};
  char fpHex[(8 * 2) + 1] = {0};
  uint32_t pinRem = 0;
  if (hsm_pin_unlocked()) {
    const uint32_t now = millis();
    pinRem = static_cast<uint32_t>((hsmPinUnlockedUntil > now) ? ((hsmPinUnlockedUntil - now) / 1000U) : 0U);
  }
  uint32_t presenceRem = 0;
  if (hsm_presence_satisfied()) {
    const uint32_t now = millis();
    presenceRem = static_cast<uint32_t>((hsmPresenceUntil > now) ? ((hsmPresenceUntil - now) / 1000U) : 0U);
  }

  if (hsmState.loaded) {
    hsm_pubkey_hex(pubHex, sizeof(pubHex));
    hsm_pubkey_fingerprint_hex(fpHex, sizeof(fpHex));
  }

  outJson = "";
  outJson.reserve(520);
  outJson += "{";
  outJson += "\"key_present\":";
  outJson += (hsmState.loaded ? "true" : "false");
  outJson += ",\"algorithm\":\"ES256\"";
  outJson += ",\"curve\":\"P-256\"";
  outJson += ",\"created_unix\":";
  outJson += (hsmState.loaded && hsmState.createdAt > 0) ? String(hsmState.createdAt) : String("null");
  outJson += ",\"sign_count\":";
  outJson += String(hsmState.signCount);
  outJson += ",\"pubkey_fingerprint\":\"";
  if (hsmState.loaded) outJson += fpHex;
  outJson += "\"";
  outJson += ",\"public_key_hex\":\"";
  if (hsmState.loaded) outJson += pubHex;
  outJson += "\"";
  outJson += ",\"pin_configured\":";
  outJson += (hsmPinConfigured ? "true" : "false");
  outJson += ",\"pin_unlocked\":";
  outJson += (hsm_pin_unlocked() ? "true" : "false");
  outJson += ",\"pin_seconds_remaining\":";
  outJson += hsm_pin_unlocked() ? String(pinRem) : String("null");
  outJson += ",\"presence_satisfied\":";
  outJson += (hsm_presence_satisfied() ? "true" : "false");
  outJson += ",\"presence_seconds_remaining\":";
  outJson += hsm_presence_satisfied() ? String(presenceRem) : String("null");
  outJson += "}";
  return true;
}

static bool hmac_sha1(const uint8_t* key, const size_t keyLen, const uint8_t* msg, const size_t msgLen, uint8_t out20[20]) {
  const mbedtls_md_info_t* info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA1);
  if (info == nullptr) return false;

  mbedtls_md_context_t ctx;
  mbedtls_md_init(&ctx);
  if (mbedtls_md_setup(&ctx, info, 1) != 0) {
    mbedtls_md_free(&ctx);
    return false;
  }
  if (mbedtls_md_hmac_starts(&ctx, key, keyLen) != 0) {
    mbedtls_md_free(&ctx);
    return false;
  }
  if (mbedtls_md_hmac_update(&ctx, msg, msgLen) != 0) {
    mbedtls_md_free(&ctx);
    return false;
  }
  if (mbedtls_md_hmac_finish(&ctx, out20) != 0) {
    mbedtls_md_free(&ctx);
    return false;
  }
  mbedtls_md_free(&ctx);
  return true;
}

static bool generate_totp(char* out, const size_t outLen, uint32_t* secondsRemainingOut) {
  if (out == nullptr || outLen < 8) return false;
  if (totpKeyLen == 0) return false;

  uint64_t unixSeconds = 0;
  if (!get_unix_seconds(&unixSeconds)) return false;

  const uint32_t period = totpPeriodS;
  const uint64_t counter = unixSeconds / period;
  const uint32_t rem = static_cast<uint32_t>(period - (unixSeconds % period));
  if (secondsRemainingOut) *secondsRemainingOut = rem;

  uint8_t msg[8];
  uint64_t c = counter;
  for (int i = 7; i >= 0; --i) {
    msg[i] = static_cast<uint8_t>(c & 0xFFU);
    c >>= 8;
  }

  uint8_t mac[20];
  if (!hmac_sha1(totpKey, totpKeyLen, msg, sizeof(msg), mac)) return false;

  const int offset = mac[19] & 0x0F;
  const uint32_t bin =
      ((static_cast<uint32_t>(mac[offset]) & 0x7FU) << 24) | (static_cast<uint32_t>(mac[offset + 1]) << 16) |
      (static_cast<uint32_t>(mac[offset + 2]) << 8) | (static_cast<uint32_t>(mac[offset + 3]));

  uint64_t mod = 1;
  for (uint8_t i = 0; i < totpDigits; ++i) mod *= 10ULL;
  const uint64_t otp = static_cast<uint64_t>(bin) % mod;
  snprintf(out, outLen, "%0*llu", static_cast<int>(totpDigits), static_cast<unsigned long long>(otp));
  return true;
}

static void handle_single_tap_action() {
  char code[16];
  uint32_t rem = 0;
  if (!generate_totp(code, sizeof(code), &rem)) {
    Serial.println("Single tap: TOTP not ready (secret/time).");
    return;
  }
  if (!usb_type_text(String(code))) {
    Serial.println("Single tap: USB keyboard HID disabled (FIDO-only mode).");
    return;
  }
  if (totpAppendEnter) {
    (void)usb_type_text("\n");
  }
}

static void start_wifi_control() {
  Serial.println("Starting control mode: Wi-Fi AP");
  WiFi.mode(WIFI_MODE_AP);
  WiFi.softAP(AP_SSID, AP_PASS);
  WiFi.setSleep(false);

  // We use a cookie for the portal session.
  static const char* hdrs[] = {"Cookie"};
  server.collectHeaders(hdrs, 1);

