sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  const IPAddress ip = WiFi.softAPIP();
  dnsServer.start(DNS_PORT, "*", ip);

  Serial.print("Connect to Wi-Fi: ");
  Serial.println(AP_SSID);
  Serial.print("Then open browser to: http://");
  Serial.println(ip);

  // --- WEB SERVER ROUTING ---
  server.on("/", []() {
    if (is_authenticated_request()) {
      if (apManagementMode) send_ap_page();
      else send_ui_page();
    }
    else send_login_page();
  });
  server.on("/generate_204", []() {
    if (is_authenticated_request()) {
      if (apManagementMode) send_ap_page();
      else send_ui_page();
    }
    else send_login_page();
  });
  server.on("/hotspot-detect.html", []() { // iOS/macOS
    if (is_authenticated_request()) {
      if (apManagementMode) send_ap_page();
      else send_ui_page();
    }
    else send_login_page();
  });
  server.on("/connecttest.txt", []() {     // Windows
    if (is_authenticated_request()) {
      if (apManagementMode) send_ap_page();
      else send_ui_page();
    }
    else send_login_page();
  });
  server.on("/favicon.ico", []() { server.send(204); });

  server.on("/login", HTTP_GET, []() { send_login_page(); });

  server.on("/login", HTTP_POST, []() {
    const String t = server.arg("t");
    if (pairTokenHex[0] != '\0' && t.length() > 0 && t.equalsIgnoreCase(pairTokenHex)) {
      set_token_cookie_and_redirect("/");
      return;
    }
    server.sendHeader("Location", "/login?e=1", true);
    server.send(303, "text/plain", "");
  });

  server.on("/logout", HTTP_GET, []() { clear_token_cookie_and_redirect("/"); });

  server.on("/pair", HTTP_GET, []() {
    if (!pairing_active()) {
      server.send(403, "text/plain", "Pairing not active");
      return;
    }
    if (pairingRotateArmed || pairTokenHex[0] == '\0') {
      generate_pair_token();
      pairingRotateArmed = false;
    }
    set_token_cookie_and_redirect("/");
  });

  server.on("/time", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!server.hasArg("ms")) {
      server.send(400, "text/plain", "Missing ms");
      return;
    }
    int64_t unixMs = 0;
    if (!parse_i64(server.arg("ms"), &unixMs) || !set_time_from_unix_ms(unixMs)) {
      server.send(400, "text/plain", "Invalid ms");
      return;
    }
    send_ok_minimal();
  });

  server.on("/totp", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      send_login_page();
      return;
    }
    send_totp_page();
  });

  server.on("/totp", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    const String s = server.arg("s");
    const String d = server.arg("d");
    const String p = server.arg("p");
    const bool e = server.hasArg("e");
    if (!save_totp_config_from_form(s, d, p, e)) {
      server.sendHeader("Location", "/totp?e=1", true);
      server.send(303, "text/plain", "");
      return;
    }
    server.sendHeader("Location", "/totp", true);
    server.send(303, "text/plain", "");
  });

  server.on("/totp/clear", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    clear_totp_prefs();
    server.sendHeader("Location", "/totp", true);
    server.send(303, "text/plain", "");
  });

  server.on("/totp/status", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }

    bool configured = totpKeyLen > 0;
    char code[16] = {0};
    uint32_t rem = 0;
    const bool canCode = configured && generate_totp(code, sizeof(code), &rem);

    String json;
    json.reserve(192);
    json += "{";
    json += "\"configured\":";
    json += (configured ? "true" : "false");
    json += ",\"time_synced\":";
    json += (timeSynced ? "true" : "false");
    json += ",\"flash_encryption\":";
    json += (flash_encryption_enabled() ? "true" : "false");
    json += ",\"code\":\"";
    if (canCode) json += code;
    json += "\"";
    json += ",\"seconds_remaining\":";
    json += canCode ? String(rem) : String("null");
    json += "}";

    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/keys", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      send_login_page();
      return;
    }
    send_keys_page();
  });

  server.on("/ap", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      send_login_page();
      return;
    }
    send_ap_page();
  });

  server.on("/diag", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      send_login_page();
      return;
    }
    send_diag_page();
  });

  server.on("/diag/status", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }
    String json;
    fido_diag_build_json(json);
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/diag/reset", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    fido_diag_clear();
    server.send(200, "text/plain", "Diagnostics reset");
  });

  server.on("/ap/status", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }
    String json;
    if (!build_ap_status_json(json)) {
      server.send(500, "application/json", "{\"error\":\"ap\"}");
      return;
    }
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/ap/mode", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    const String mode = server.arg("mode");
    if (mode == "manage") {
      save_ap_management_mode(true);
      server.send(200, "text/plain", "AP mode set to management-only");
      return;
    }
    if (mode == "control") {
      save_ap_management_mode(false);
      server.send(200, "text/plain", "AP mode set to full control");
      return;
    }
    server.send(400, "text/plain", "Invalid mode");
  });

  server.on("/hsm", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      send_login_page();
      return;
    }
    send_hsm_page();
  });

