sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  server.on("/hsm/status", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }

    String json;
    if (!build_hsm_status_json(json)) {
      server.send(500, "application/json", "{\"error\":\"hsm\"}");
      return;
    }
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/hsm/pin/unlock", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!hsmPinConfigured) {
      server.send(409, "text/plain", "HSM PIN is not configured");
      return;
    }
    const String pin = server.arg("p");
    if (!hsm_pin_unlock_with_pin(pin.c_str())) {
      server.send(403, "text/plain", "Invalid PIN");
      return;
    }
    server.send(200, "text/plain", "PIN unlocked");
  });

  server.on("/hsm/pin/set", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    if (!hsm_presence_satisfied()) {
      server.send(428, "text/plain", "Physical presence required (hold BOOT ~0.5-1.2s, then retry).");
      return;
    }

    const String newPin = server.arg("n");
    if (newPin.length() < HSM_PIN_MIN_LEN || newPin.length() > HSM_PIN_MAX_LEN) {
      server.send(400, "text/plain", "PIN length invalid");
      return;
    }
    if (hsmPinConfigured) {
      const String oldPin = server.arg("p");
      if (!hsm_pin_verify(oldPin.c_str())) {
        server.send(403, "text/plain", "Current PIN invalid");
        return;
      }
    }

    if (!hsm_pin_set(newPin.c_str())) {
      server.send(500, "text/plain", "Failed to set PIN");
      return;
    }
    hsm_consume_presence();
    server.send(200, "text/plain", "PIN saved");
  });

  server.on("/hsm/pin/clear", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    if (!hsmPinConfigured) {
      server.send(409, "text/plain", "HSM PIN is not configured");
      return;
    }
    if (!hsm_presence_satisfied()) {
      server.send(428, "text/plain", "Physical presence required (hold BOOT ~0.5-1.2s, then retry).");
      return;
    }
    const String pin = server.arg("p");
    if (!hsm_pin_verify(pin.c_str())) {
      server.send(403, "text/plain", "Invalid PIN");
      return;
    }
    hsm_pin_clear_prefs();
    hsm_consume_presence();
    server.send(200, "text/plain", "PIN cleared");
  });

  server.on("/hsm/generate", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    if (!hsmPinConfigured) {
      server.send(428, "text/plain", "Set an HSM PIN first");
      return;
    }
    if (!hsm_pin_unlocked()) {
      server.send(428, "text/plain", "PIN locked. Unlock PIN first.");
      return;
    }
    if (!hsm_presence_satisfied()) {
      server.send(428, "text/plain", "Physical presence required (hold BOOT ~0.5-1.2s, then retry).");
      return;
    }
    if (!hsm_generate_and_store_key()) {
      server.send(500, "text/plain", "HSM key generation failed");
      return;
    }
    hsm_consume_presence();
    server.send(200, "text/plain", "HSM key generated");
  });

  server.on("/hsm/delete", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2-4s to unlock).");
      return;
    }
    if (!hsmPinConfigured) {
      server.send(428, "text/plain", "Set an HSM PIN first");
      return;
    }
    if (!hsm_pin_unlocked()) {
      server.send(428, "text/plain", "PIN locked. Unlock PIN first.");
      return;
    }
    if (!hsm_presence_satisfied()) {
      server.send(428, "text/plain", "Physical presence required (hold BOOT ~0.5-1.2s, then retry).");
      return;
    }
    if (!hsm_delete_key()) {
      server.send(500, "text/plain", "HSM key delete failed");
      return;
    }
    hsm_consume_presence();
    server.send(200, "text/plain", "HSM key deleted");
  });

  server.on("/hsm/sign", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!hsmState.loaded) {
      server.send(409, "text/plain", "No HSM key loaded");
      return;
    }
    if (!hsmPinConfigured) {
      server.send(428, "text/plain", "Set an HSM PIN first");
      return;
    }
    if (!hsm_pin_unlocked()) {
      server.send(428, "text/plain", "PIN locked. Unlock PIN first.");
      return;
    }
    if (!hsm_presence_satisfied()) {
      server.send(428, "text/plain", "Physical presence required (hold BOOT ~0.5-1.2s, then retry).");
      return;
    }
    if (!server.hasArg("m")) {
      server.send(400, "text/plain", "Missing m");
      return;
    }

    const String fmt = server.arg("fmt");
    const String m = server.arg("m");
    uint8_t digest[32] = {0};
    size_t inputLen = 0;
    if (!hsm_digest_from_form_input(fmt, m, digest, &inputLen)) {
      server.send(400, "text/plain", "Invalid input. Use fmt=text|hex|digesthex.");
      return;
    }

    uint8_t sig[HSM_SIGNATURE_DER_MAX] = {0};
    size_t sigLen = 0;
    if (!hsm_sign_digest_der(digest, sig, sizeof(sig), &sigLen)) {
      secure_zero(digest, sizeof(digest));
      secure_zero(sig, sizeof(sig));
      server.send(429, "text/plain", "Sign failed or throttled");
      return;
    }

    char digestHex[(32 * 2) + 1] = {0};
    char sigHex[(HSM_SIGNATURE_DER_MAX * 2) + 1] = {0};
    bytes_to_hex(digest, sizeof(digest), digestHex, sizeof(digestHex));
    bytes_to_hex(sig, sigLen, sigHex, sizeof(sigHex));
    secure_zero(digest, sizeof(digest));
    secure_zero(sig, sizeof(sig));

    String json;
    json.reserve(320);
    json += "{";
    json += "\"ok\":true";
    json += ",\"input_len\":";
    json += String(inputLen);
    json += ",\"digest_hex\":\"";
    json += digestHex;
    json += "\"";
    json += ",\"signature_der_hex\":\"";
    json += sigHex;
    json += "\"";
    json += ",\"sign_count\":";
    json += String(hsmState.signCount);
    json += "}";

    hsm_consume_presence();
    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/hsm/verify", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!hsmState.loaded) {
      server.send(409, "text/plain", "No HSM key loaded");
      return;
    }
    if (!server.hasArg("m") || !server.hasArg("sig")) {
      server.send(400, "text/plain", "Missing m or sig");
      return;
    }

