sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    const String fmt = server.arg("fmt");
    const String m = server.arg("m");
    const String sigHexIn = server.arg("sig");

    uint8_t digest[32] = {0};
    size_t inputLen = 0;
    if (!hsm_digest_from_form_input(fmt, m, digest, &inputLen)) {
      server.send(400, "text/plain", "Invalid input. Use fmt=text|hex|digesthex.");
      return;
    }

    uint8_t sig[HSM_SIGNATURE_DER_MAX] = {0};
    const size_t sigLen = hex_to_bytes(sigHexIn.c_str(), sig, sizeof(sig));
    if (sigLen == 0) {
      secure_zero(digest, sizeof(digest));
      secure_zero(sig, sizeof(sig));
      server.send(400, "text/plain", "Invalid signature hex");
      return;
    }

    const bool valid = hsm_verify_digest_der(digest, sig, sigLen);
    char digestHex[(32 * 2) + 1] = {0};
    bytes_to_hex(digest, sizeof(digest), digestHex, sizeof(digestHex));
    secure_zero(digest, sizeof(digest));
    secure_zero(sig, sizeof(sig));

    String json;
    json.reserve(160);
    json += "{";
    json += "\"valid\":";
    json += (valid ? "true" : "false");
    json += ",\"input_len\":";
    json += String(inputLen);
    json += ",\"digest_hex\":\"";
    json += digestHex;
    json += "\"";
    json += "}";

    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/keys/list", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }

    String json;
    if (!build_keys_json(json)) {
      server.send(500, "application/json", "{\"error\":\"store\"}");
      return;
    }

    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.on("/keys/label", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!server.hasArg("id")) {
      server.send(400, "text/plain", "Missing id");
      return;
    }

    const String idHex = server.arg("id");
    uint8_t id[CRED_MAX_ID_LEN];
    const size_t idLen = hex_to_bytes(idHex.c_str(), id, sizeof(id));
    if (idLen == 0) {
      server.send(400, "text/plain", "Invalid id");
      return;
    }

    String label = server.arg("label");
    label.trim();
    if (label.length() > CRED_MAX_LABEL_LEN) label.remove(CRED_MAX_LABEL_LEN);

    const bool ok = cred_store_set_label_id(id, idLen, label.c_str(), label.length());
    if (!ok) {
      server.send(400, "text/plain", "Label not saved");
      return;
    }
    send_ok_minimal();
  });

  server.on("/keys/delete", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2–4s to unlock).");
      return;
    }
    if (!server.hasArg("id")) {
      server.send(400, "text/plain", "Missing id");
      return;
    }

    const String idHex = server.arg("id");
    uint8_t id[CRED_MAX_ID_LEN];
    const size_t idLen = hex_to_bytes(idHex.c_str(), id, sizeof(id));
    if (idLen == 0) {
      server.send(400, "text/plain", "Invalid id");
      return;
    }

    if (!cred_store_delete_id(id, idLen)) {
      server.send(404, "text/plain", "Not found");
      return;
    }

    server.send(200, "text/plain", "Deleted");
  });

  server.on("/keys/settings", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2–4s to unlock).");
      return;
    }
    const String a = server.arg("a");
    if (a == "none") save_attestation_profile(AttestationProfile::None);
    else if (a == "diy" || a.length() == 0) save_attestation_profile(AttestationProfile::Diy);
    else {
      server.send(400, "text/plain", "Invalid setting");
      return;
    }
    server.send(200, "text/plain", "Saved");
  });

  server.on("/backup/download", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2–4s to unlock).");
      return;
    }

    const String p = server.arg("p");
    uint8_t* enc = nullptr;
    size_t encLen = 0;
    if (!build_encrypted_backup(p.c_str(), &enc, &encLen)) {
      server.send(400, "text/plain", "Backup not available (check password length).");
      return;
    }

    send_no_cache_headers();
    server.sendHeader("Content-Disposition", "attachment; filename=esp32s3-kbm-backup.bin", true);
    server.setContentLength(encLen);
    server.send(200, "application/octet-stream", "");
    server.sendContent(reinterpret_cast<const char*>(enc), encLen);

    secure_zero(enc, encLen);
    free(enc);
  });

  server.on("/backup/restore", HTTP_POST, []() {
    if (!is_authenticated_request()) {
      reset_restore_upload();
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (!admin_unlocked()) {
      reset_restore_upload();
      server.send(403, "text/plain", "Admin actions locked (hold BOOT ~2–4s to unlock).");
      return;
    }

    const String p = server.arg("p");
    if (restoreUpload.error || restoreUpload.buf == nullptr || restoreUpload.len == 0) {
      reset_restore_upload();
      server.sendHeader("Location", "/keys?r=0", true);
      server.send(303, "text/plain", "");
      return;
    }

    const bool ok = decrypt_and_restore_backup(restoreUpload.buf, restoreUpload.len, p.c_str());
    reset_restore_upload();

    server.sendHeader("Location", ok ? "/keys?r=1" : "/keys?r=0", true);
    server.send(303, "text/plain", "");
  }, handle_restore_upload_chunk);

  server.on("/admin/status", HTTP_GET, []() {
    if (!is_authenticated_request()) {
      server.send(401, "application/json", "{\"error\":\"auth\"}");
      return;
    }

    const bool unlocked = admin_unlocked();
    uint32_t remS = 0;
    if (unlocked) {
      const uint32_t now = millis();
      remS = static_cast<uint32_t>((adminUnlockedUntil > now) ? ((adminUnlockedUntil - now) / 1000U) : 0U);
    }

    String json;
    json.reserve(160);
    json += "{";
    json += "\"admin_unlocked\":";
    json += (unlocked ? "true" : "false");
    json += ",\"admin_seconds_remaining\":";
    json += unlocked ? String(remS) : String("null");
    json += ",\"flash_encryption\":";
    json += (flash_encryption_enabled() ? "true" : "false");
    json += "}";

    server.sendHeader("Cache-Control", "no-store");
    server.send(200, "application/json", json);
  });

  server.onNotFound([ip]() {
    server.sendHeader("Location", String("http://") + ip.toString() + "/", true);
    server.send(302, "text/plain", "");
  });

  server.on("/move", []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (apManagementMode) {
      server.send(403, "text/plain", "AP is in management-only mode");
      return;
    }
    if (!usb_kbm_hid_enabled()) {
      server.send(409, "text/plain", "USB keyboard/mouse HID disabled");
      return;
    }
    if (server.hasArg("x") && server.hasArg("y")) {
      int x = server.arg("x").toInt();
      int y = server.arg("y").toInt();
      x = constrain(x, -127, 127);
      y = constrain(y, -127, 127);
      (void)usb_mouse_move(x, y);
    }
    send_ok_minimal();
  });

  server.on("/click", []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (apManagementMode) {
      server.send(403, "text/plain", "AP is in management-only mode");
      return;
    }
    if (!usb_kbm_hid_enabled()) {
      server.send(409, "text/plain", "USB keyboard/mouse HID disabled");
      return;
    }
    if (server.hasArg("b")) {
      const String btn = server.arg("b");
      (void)usb_mouse_click(btn);
    }
    send_ok_minimal();
  });

  server.on("/type", []() {
    if (!is_authenticated_request()) {
      server.send(401, "text/plain", "Sign in required");
      return;
    }
    if (apManagementMode) {
      server.send(403, "text/plain", "AP is in management-only mode");
      return;
    }
    if (!usb_kbm_hid_enabled()) {
      server.send(409, "text/plain", "USB keyboard/mouse HID disabled");
      return;
    }
    if (server.hasArg("t")) {
      String text = server.arg("t");
      if (text.length() > 256) text.remove(256);
      (void)usb_type_text(text);
    }
    send_ok_minimal();
  });

  server.begin();
}

static void poll_boot_button() {
  const uint32_t now = millis();

  // Expire pairing window.
  if (!pairing_active()) {
    pairingActiveUntil = 0;
    pairingRotateArmed = false;
  }

  // Expire admin unlock window.
  if (!admin_unlocked()) {
    adminUnlockedUntil = 0;
  }
  if (!hsm_pin_unlocked()) {
    hsmPinUnlockedUntil = 0;
  }
  if (!hsm_presence_satisfied()) {
    hsmPresenceUntil = 0;
  }

  // While the authenticator is waiting for user presence, avoid interpreting BOOT presses as portal gestures.
  if (fido_waiting_for_user_presence()) {
    pendingSingleTap = false;
    tapCount = 0;
    buttonDown = false;
    buttonDownSince = 0;
    return;
  }

