sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  const bool down = boot_button_down();
  if (down) {
    if (!buttonDown) buttonDownSince = now;
    buttonDown = true;
    return;
  }

  // Handle pending single-tap action when the multi-tap gap expires.
  if (pendingSingleTap && (static_cast<int32_t>(now - pendingSingleTapDue) >= 0)) {
    pendingSingleTap = false;
    tapCount = 0;
    handle_single_tap_action();
  }

  // Released.
  if (!buttonDown) return;

  const uint32_t held = now - buttonDownSince;

  if (held <= TAP_MAX_MS) {
    if (static_cast<int32_t>(now - lastTapAt) > static_cast<int32_t>(TAP_GAP_MS)) {
      tapCount = 0;
    }
    ++tapCount;
    lastTapAt = now;

    if (tapCount >= PAIRING_TAP_COUNT) {
      pairingActiveUntil = now + PAIRING_WINDOW_MS;
      pairingRotateArmed = true;
      tapCount = 0;
      pendingSingleTap = false;
      Serial.println("Pairing window enabled (open the portal and press Pair).");
    } else {
      pendingSingleTap = true;
      pendingSingleTapDue = now + TAP_GAP_MS;
    }
  } else {
    if (held >= HSM_PRESENCE_HOLD_MIN_MS && held <= HSM_PRESENCE_HOLD_MAX_MS) {
      hsm_mark_presence_now();
      Serial.println("HSM/FIDO physical presence window opened.");
    }
    if (held >= ADMIN_UNLOCK_HOLD_MIN_MS && held <= ADMIN_UNLOCK_HOLD_MAX_MS) {
      adminUnlockedUntil = now + ADMIN_UNLOCK_WINDOW_MS;
      Serial.println("Admin actions unlocked (keys + HSM).");
    }
    pendingSingleTap = false;
    tapCount = 0;
  }

  buttonDown = false;
}

static void update_status_led() {
  if (!led_available()) return;

  const uint32_t now = millis();

  // Waiting for user presence (FIDO2) indicator (cyan blink).
  if (fido_waiting_for_user_presence()) {
    const bool on = ((now / 200U) % 2U) == 0U;
    set_led_rgb(0, on ? 32 : 0, on ? 32 : 0);
    return;
  }

  // While BOOT is held, show a brief indicator (useful for long-press actions).
  if (buttonDown) {
    const bool on = ((now / 125U) % 2U) == 0U;
    set_led_rgb(on ? 24 : 0, on ? 24 : 0, on ? 24 : 0);
    return;
  }

  // Pairing window indicator (magenta blink).
  if (pairing_active()) {
    const bool on = ((now / 200U) % 2U) == 0U;
    set_led_rgb(on ? 32 : 0, 0, on ? 32 : 0);
    return;
  }

  // Admin unlock window indicator (yellow blink).
  if (admin_unlocked()) {
    const bool on = ((now / 350U) % 2U) == 0U;
    set_led_rgb(on ? 48 : 0, on ? 32 : 0, 0);
    return;
  }

  // Physical-presence window (green blink).
  if (hsm_presence_satisfied()) {
    const bool on = ((now / 180U) % 2U) == 0U;
    set_led_rgb(0, on ? 36 : 0, 0);
    return;
  }

  // Default indicator: Wi-Fi AP running (blue pulse every 2s).
  const uint32_t t = now % 2000U;
  const bool on = t < 120U;
  set_led_rgb(0, 0, on ? 32 : 0);
}

void setup() {
  Serial.begin(115200);
  pinMode(BOOT_BUTTON_PIN, INPUT_PULLUP);
  init_led();

  // FIDO makeCredential/getAssertion can spend noticeable time in ECC operations.
  // Prevent loop-task watchdog resets from dropping USB during those operations.
  disableLoopWDT();

  load_pair_token();
  load_totp_config();
  attestationProfile = load_attestation_profile();
  apManagementMode = load_ap_management_mode();
  (void)hsm_load_from_prefs();
  (void)hsm_pin_load_from_prefs();

  USB.begin();
  usb_input_begin();
  fido_begin();

  Serial.println("Triple-tap BOOT to enable portal pairing.");
  serial_diag_print_help();
  serial_diag_print_status();

#if FIDO_STABILITY_MODE
  // Disable radio during FIDO transport troubleshooting to minimize USB dropouts.
  WiFi.mode(WIFI_OFF);
  WiFi.setSleep(false);
#else
  start_wifi_control();
#endif
}

void loop() {
  fido_task();
  serial_diag_task();
  poll_boot_button();
  update_status_led();

#if !FIDO_STABILITY_MODE
  dnsServer.processNextRequest();
  server.handleClient();
#endif

  delay(1); // yield to WiFi/USB stacks
}

#line 1 "C:\\Users\\Justin\\Documents\\Arduino\\esp32s3-wifi-kbm\\fido2_ctap2.ino"
// FIDO2 / CTAP2 (WebAuthn) over USB HID for ESP32-S3 (TinyUSB).
//
// This file is compiled as part of the same Arduino sketch translation unit.
// It relies on helpers and globals defined in `esp32s3-wifi-kbm.ino` (LED, BOOT button, NVS cred store).
//
// Supported:
// - authenticatorGetInfo (0x04)
// - authenticatorMakeCredential (0x01) with ES256 (-7), user presence (BOOT)
// - authenticatorGetAssertion (0x02) with allowList, user presence (BOOT)
// - authenticatorReset (0x07), user presence (BOOT)
//
// Not supported:
// - Full CTAP2.1 PIN/UV feature set (this build supports a minimal ClientPIN entry flow)
// - Resident/discoverable credentials (rk)
// - CTAP1/U2F (CTAPHID_MSG)
// - Extensions and enterprise attestation

#ifndef FIDO_DEBUG
#define FIDO_DEBUG 0
#endif

#ifndef FIDO_FORCE_MAKECRED_EARLY_ERROR
#define FIDO_FORCE_MAKECRED_EARLY_ERROR 0
#endif

#ifndef FIDO_FORCE_MAKECRED_PARSE_ONLY_ERROR
#define FIDO_FORCE_MAKECRED_PARSE_ONLY_ERROR 0
#endif

#ifndef FIDO_FORCE_DIRECT_MAKECRED_ERROR
#define FIDO_FORCE_DIRECT_MAKECRED_ERROR 0
#endif

// Debug stage checkpoints for makeCredential:
// 0 = normal flow
// 1 = return error after successful parse
// 2 = return error after key generation
// 3 = return error after credential store write
// 4 = return error after attestation/signing
#ifndef FIDO_MAKECRED_TEST_STAGE
#define FIDO_MAKECRED_TEST_STAGE 0
#endif

// Temporary troubleshooting switch:
// - 1: use a fixed P-256 test keypair (private = 1, public = generator point)
// - 0: generate a random keypair with mbedTLS
#ifndef FIDO_USE_STATIC_TEST_KEYPAIR
#define FIDO_USE_STATIC_TEST_KEYPAIR 0
#endif

// Writing credentials/sign counters to NVS can stall long enough to destabilize
// CTAP HID on some ESP32-S3 setups. Keep FIDO state in RAM for reliability.
#ifndef FIDO_DISABLE_PERSISTENCE
#define FIDO_DISABLE_PERSISTENCE 1
#endif

#ifndef FIDO_STABILITY_SKIP_CRED_DESCRIPTOR_PARSE
#define FIDO_STABILITY_SKIP_CRED_DESCRIPTOR_PARSE 1
#endif

#ifndef FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
#define FIDO_STABILITY_MINIMAL_MAKECRED_PARSE 1
#endif

#ifndef USB_ENABLE_KBM_HID
#define USB_ENABLE_KBM_HID 0
#endif

static constexpr size_t   FIDO_HID_PACKET_SIZE = 64;
// In composite keyboard/mouse mode, keep FIDO on its own report ID.
// In FIDO-only mode, use report ID 0 (no report ID).
#if USB_ENABLE_KBM_HID
static constexpr uint8_t  FIDO_HID_REPORT_ID = HID_REPORT_ID_GAMEPAD;
#else
static constexpr uint8_t  FIDO_HID_REPORT_ID = HID_REPORT_ID_NONE;
#endif
static constexpr uint32_t CTAPHID_BROADCAST_CID = 0xFFFFFFFFUL;

static constexpr uint8_t CTAPHID_CMD_PING = 0x01;
static constexpr uint8_t CTAPHID_CMD_MSG = 0x03;
static constexpr uint8_t CTAPHID_CMD_INIT = 0x06;
static constexpr uint8_t CTAPHID_CMD_WINK = 0x08;
static constexpr uint8_t CTAPHID_CMD_CBOR = 0x10;
static constexpr uint8_t CTAPHID_CMD_CANCEL = 0x11;
static constexpr uint8_t CTAPHID_CMD_KEEPALIVE = 0x3B;
static constexpr uint8_t CTAPHID_CMD_ERROR = 0x3F;

static constexpr uint8_t CTAPHID_KEEPALIVE_STATUS_PROCESSING = 0x01;
static constexpr uint8_t CTAPHID_KEEPALIVE_STATUS_UP_NEEDED = 0x02;

static constexpr uint8_t CTAPHID_ERR_INVALID_CMD = 0x01;
static constexpr uint8_t CTAPHID_ERR_INVALID_LEN = 0x03;
static constexpr uint8_t CTAPHID_ERR_INVALID_SEQ = 0x04;
static constexpr uint8_t CTAPHID_ERR_CHANNEL_BUSY = 0x06;
static constexpr uint8_t CTAPHID_ERR_INVALID_CHANNEL = 0x0B;

static constexpr uint8_t CTAPHID_CAP_WINK = 0x01;
static constexpr uint8_t CTAPHID_CAP_CBOR = 0x04;
static constexpr uint8_t CTAPHID_CAP_NMSG = 0x08;

static constexpr uint8_t CTAP2_OK = 0x00;
static constexpr uint8_t CTAP2_ERR_INVALID_COMMAND = 0x01;
static constexpr uint8_t CTAP2_ERR_INVALID_PARAMETER = 0x02;
static constexpr uint8_t CTAP2_ERR_INVALID_LENGTH = 0x03;
static constexpr uint8_t CTAP2_ERR_TIMEOUT = 0x05;
static constexpr uint8_t CTAP2_ERR_CHANNEL_BUSY = 0x06;
static constexpr uint8_t CTAP2_ERR_CBOR_PARSING = 0x10;
static constexpr uint8_t CTAP2_ERR_CBOR_UNEXPECTED_TYPE = 0x11;
static constexpr uint8_t CTAP2_ERR_INVALID_CBOR = 0x12;
static constexpr uint8_t CTAP2_ERR_MISSING_PARAMETER = 0x14;
static constexpr uint8_t CTAP2_ERR_LIMIT_EXCEEDED = 0x15;
static constexpr uint8_t CTAP2_ERR_CREDENTIAL_EXCLUDED = 0x19;
static constexpr uint8_t CTAP2_ERR_PROCESSING = 0x21;
static constexpr uint8_t CTAP2_ERR_INVALID_CREDENTIAL = 0x22;
static constexpr uint8_t CTAP2_ERR_UNSUPPORTED_ALGORITHM = 0x26;
static constexpr uint8_t CTAP2_ERR_KEY_STORE_FULL = 0x28;
static constexpr uint8_t CTAP2_ERR_UNSUPPORTED_OPTION = 0x2B;
static constexpr uint8_t CTAP2_ERR_KEEPALIVE_CANCEL = 0x2D;
static constexpr uint8_t CTAP2_ERR_NO_CREDENTIALS = 0x2E;
static constexpr uint8_t CTAP2_ERR_USER_ACTION_TIMEOUT = 0x2F;
static constexpr uint8_t CTAP2_ERR_NOT_ALLOWED = 0x30;
static constexpr uint8_t CTAP2_ERR_PIN_INVALID = 0x31;
static constexpr uint8_t CTAP2_ERR_PIN_BLOCKED = 0x32;
static constexpr uint8_t CTAP2_ERR_PIN_AUTH_INVALID = 0x33;
static constexpr uint8_t CTAP2_ERR_PIN_NOT_SET = 0x35;
static constexpr uint8_t CTAP2_ERR_PIN_REQUIRED = 0x36;
static constexpr uint8_t CTAP2_ERR_REQUEST_TOO_LARGE = 0x39;
static constexpr uint8_t CTAP1_ERR_OTHER = 0x7F;

static constexpr uint8_t CTAP_CMD_MAKE_CREDENTIAL = 0x01;
static constexpr uint8_t CTAP_CMD_GET_ASSERTION = 0x02;
static constexpr uint8_t CTAP_CMD_GET_INFO = 0x04;
static constexpr uint8_t CTAP_CMD_CLIENT_PIN = 0x06;
static constexpr uint8_t CTAP_CMD_RESET = 0x07;
static constexpr uint8_t CTAP_CMD_GET_NEXT_ASSERTION = 0x08;
static constexpr uint8_t CTAP_CMD_BIO_ENROLLMENT = 0x09;
static constexpr uint8_t CTAP_CMD_CREDENTIAL_MANAGEMENT = 0x0A;
static constexpr uint8_t CTAP_CMD_SELECTION = 0x0B;
static constexpr uint8_t CTAP_CMD_LARGE_BLOBS = 0x0C;
static constexpr uint8_t CTAP_CMD_CONFIG = 0x0D;

static constexpr uint8_t CTAP_CLIENT_PIN_GET_RETRIES = 0x01;
static constexpr uint8_t CTAP_CLIENT_PIN_GET_KEY_AGREEMENT = 0x02;
static constexpr uint8_t CTAP_CLIENT_PIN_SET_PIN = 0x03;
static constexpr uint8_t CTAP_CLIENT_PIN_CHANGE_PIN = 0x04;
static constexpr uint8_t CTAP_CLIENT_PIN_GET_PIN_TOKEN = 0x05;
static constexpr uint8_t CTAP_CLIENT_PIN_GET_UV_RETRIES = 0x07;
static constexpr uint8_t CTAP_CLIENT_PIN_GET_PIN_UV_AUTH_TOKEN_USING_PIN_WITH_PERMISSIONS = 0x09;
static constexpr uint8_t CTAP_PIN_UV_AUTH_PROTOCOL_1 = 0x01;
static constexpr size_t CTAP_PIN_HASH_ENC_LEN = 16;
static constexpr size_t CTAP_PIN_UV_AUTH_PARAM_LEN = 16;
static constexpr size_t CTAP_PIN_TOKEN_LEN = 32;

static constexpr size_t FIDO_MAX_PAYLOAD = 1024;
static constexpr uint32_t CTAP_UP_TIMEOUT_MS = 30 * 1000;
static constexpr uint32_t CTAP_KEEPALIVE_EVERY_MS = 100;

// Development toggle:
// - 1: require BOOT button for user presence (stronger local-presence semantics)
// - 0: auto-approve UP after a short delay (easier interoperability testing)
#ifndef FIDO_REQUIRE_BOOT_BUTTON_FOR_UP
#define FIDO_REQUIRE_BOOT_BUTTON_FOR_UP 1
#endif
#if !FIDO_REQUIRE_BOOT_BUTTON_FOR_UP
#error "Auto user-presence is disabled in this build; set FIDO_REQUIRE_BOOT_BUTTON_FOR_UP=1."
#endif
static constexpr uint32_t CTAP_UP_MIN_HOLD_MS = 250;

