sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static constexpr uint8_t CTAP_CRED_SECRET_VER = 1;
static constexpr uint8_t CTAP_CRED_FLAG_RK = 0x01;

static const uint8_t CTAP_AAGUID[16] = {0x7a, 0x85, 0x2a, 0x5d, 0x77, 0x6a, 0x4a, 0x12,
                                        0x86, 0x1d, 0x0b, 0x4f, 0x2b, 0x67, 0x0c, 0x8e};

static uint32_t fidoAssignedCid = 0;
static uint32_t fidoSignCount = 0;
static bool fidoAwaitingUserPresence = false;

// Shared security policy hooks implemented in esp32s3-wifi-kbm.ino.
bool security_pin_configured();
bool security_pin_unlocked_now();
bool security_fido_pin_hash16_get(uint8_t outHash16[16]);

struct FidoDiagState {
  uint32_t lastCid = 0;
  uint8_t lastHidCmd = 0;
  uint8_t lastCtapCmd = 0;
  uint8_t lastCtapStatus = 0;
  uint8_t lastHidError = 0;
  uint8_t lastReportIdSeen = 0;
  uint8_t lastReportIdDropped = 0;
  uint16_t lastReportLenSeen = 0;
  uint16_t lastReportLenDropped = 0;
  uint32_t totalCtapRequests = 0;
  uint32_t totalCtapOk = 0;
  uint32_t totalCtapErr = 0;
  uint32_t totalPinGateBlocks = 0;
  uint32_t totalUpSatisfied = 0;
  uint32_t totalHidOutCallbacks = 0;
  uint32_t totalHidSetFeatureCallbacks = 0;
  uint32_t totalHidGetFeatureCallbacks = 0;
  uint32_t totalUnexpectedReportId = 0;
  uint32_t totalDroppedBadLen = 0;
  uint32_t totalNormalizedPackets = 0;
  uint32_t lastRxMs = 0;
  uint32_t lastTxMs = 0;
};

static FidoDiagState fidoDiag;

struct FidoClientPinState {
  uint8_t keyAgreementPriv[32] = {0};
  uint8_t keyAgreementX[32] = {0};
  uint8_t keyAgreementY[32] = {0};
  bool keyAgreementReady = false;
  uint8_t pinUvAuthToken[CTAP_PIN_TOKEN_LEN] = {0};
  uint8_t pinRetries = 8;
};

static FidoClientPinState fidoClientPin;

static bool fido_client_pin_available();
static bool fido_client_pin_hash_ready();

static const char* ctaphid_cmd_name(const uint8_t cmd) {
  switch (cmd) {
    case CTAPHID_CMD_PING: return "PING";
    case CTAPHID_CMD_MSG: return "MSG";
    case CTAPHID_CMD_INIT: return "INIT";
    case CTAPHID_CMD_WINK: return "WINK";
    case CTAPHID_CMD_CBOR: return "CBOR";
    case CTAPHID_CMD_CANCEL: return "CANCEL";
    case CTAPHID_CMD_KEEPALIVE: return "KEEPALIVE";
    case CTAPHID_CMD_ERROR: return "ERROR";
    default: return "UNKNOWN";
  }
}

static const char* ctaphid_err_name(const uint8_t err) {
  switch (err) {
    case CTAPHID_ERR_INVALID_CMD: return "INVALID_CMD";
    case CTAPHID_ERR_INVALID_LEN: return "INVALID_LEN";
    case CTAPHID_ERR_INVALID_SEQ: return "INVALID_SEQ";
    case CTAPHID_ERR_CHANNEL_BUSY: return "CHANNEL_BUSY";
    case CTAPHID_ERR_INVALID_CHANNEL: return "INVALID_CHANNEL";
    default: return "ERR_UNKNOWN";
  }
}

static const char* ctap_cmd_name(const uint8_t cmd) {
  switch (cmd) {
    case CTAP_CMD_MAKE_CREDENTIAL: return "authenticatorMakeCredential";
    case CTAP_CMD_GET_ASSERTION: return "authenticatorGetAssertion";
    case CTAP_CMD_GET_INFO: return "authenticatorGetInfo";
    case CTAP_CMD_CLIENT_PIN: return "authenticatorClientPIN";
    case CTAP_CMD_RESET: return "authenticatorReset";
    case CTAP_CMD_GET_NEXT_ASSERTION: return "authenticatorGetNextAssertion";
    case CTAP_CMD_BIO_ENROLLMENT: return "authenticatorBioEnrollment";
    case CTAP_CMD_CREDENTIAL_MANAGEMENT: return "authenticatorCredentialManagement";
    case CTAP_CMD_SELECTION: return "authenticatorSelection";
    case CTAP_CMD_LARGE_BLOBS: return "authenticatorLargeBlobs";
    case CTAP_CMD_CONFIG: return "authenticatorConfig";
    default: return "ctapUnknown";
  }
}

static const char* ctap2_status_name(const uint8_t st) {
  switch (st) {
    case CTAP2_OK: return "CTAP2_OK";
    case CTAP2_ERR_INVALID_COMMAND: return "CTAP2_ERR_INVALID_COMMAND";
    case CTAP2_ERR_INVALID_PARAMETER: return "CTAP2_ERR_INVALID_PARAMETER";
    case CTAP2_ERR_INVALID_LENGTH: return "CTAP2_ERR_INVALID_LENGTH";
    case CTAP2_ERR_TIMEOUT: return "CTAP2_ERR_TIMEOUT";
    case CTAP2_ERR_CHANNEL_BUSY: return "CTAP2_ERR_CHANNEL_BUSY";
    case CTAP2_ERR_CBOR_PARSING: return "CTAP2_ERR_CBOR_PARSING";
    case CTAP2_ERR_CBOR_UNEXPECTED_TYPE: return "CTAP2_ERR_CBOR_UNEXPECTED_TYPE";
    case CTAP2_ERR_INVALID_CBOR: return "CTAP2_ERR_INVALID_CBOR";
    case CTAP2_ERR_MISSING_PARAMETER: return "CTAP2_ERR_MISSING_PARAMETER";
    case CTAP2_ERR_LIMIT_EXCEEDED: return "CTAP2_ERR_LIMIT_EXCEEDED";
    case CTAP2_ERR_CREDENTIAL_EXCLUDED: return "CTAP2_ERR_CREDENTIAL_EXCLUDED";
    case CTAP2_ERR_PROCESSING: return "CTAP2_ERR_PROCESSING";
    case CTAP2_ERR_INVALID_CREDENTIAL: return "CTAP2_ERR_INVALID_CREDENTIAL";
    case CTAP2_ERR_UNSUPPORTED_ALGORITHM: return "CTAP2_ERR_UNSUPPORTED_ALGORITHM";
    case CTAP2_ERR_KEY_STORE_FULL: return "CTAP2_ERR_KEY_STORE_FULL";
    case CTAP2_ERR_UNSUPPORTED_OPTION: return "CTAP2_ERR_UNSUPPORTED_OPTION";
    case CTAP2_ERR_KEEPALIVE_CANCEL: return "CTAP2_ERR_KEEPALIVE_CANCEL";
    case CTAP2_ERR_NO_CREDENTIALS: return "CTAP2_ERR_NO_CREDENTIALS";
    case CTAP2_ERR_USER_ACTION_TIMEOUT: return "CTAP2_ERR_USER_ACTION_TIMEOUT";
    case CTAP2_ERR_NOT_ALLOWED: return "CTAP2_ERR_NOT_ALLOWED";
    case CTAP2_ERR_PIN_INVALID: return "CTAP2_ERR_PIN_INVALID";
    case CTAP2_ERR_PIN_BLOCKED: return "CTAP2_ERR_PIN_BLOCKED";
    case CTAP2_ERR_PIN_AUTH_INVALID: return "CTAP2_ERR_PIN_AUTH_INVALID";
    case CTAP2_ERR_PIN_NOT_SET: return "CTAP2_ERR_PIN_NOT_SET";
    case CTAP2_ERR_PIN_REQUIRED: return "CTAP2_ERR_PIN_REQUIRED";
    case CTAP2_ERR_REQUEST_TOO_LARGE: return "CTAP2_ERR_REQUEST_TOO_LARGE";
    default: return "CTAP2_ERR_OTHER";
  }
}

#if FIDO_DEBUG
#define FIDO_LOG(fmt, ...) Serial.printf("[FIDO] " fmt "\n", ##__VA_ARGS__)
#else
#define FIDO_LOG(...) \
  do {                \
  } while (0)
#endif

static inline uint32_t read_be_u32(const uint8_t* p) {
  return (static_cast<uint32_t>(p[0]) << 24) | (static_cast<uint32_t>(p[1]) << 16) | (static_cast<uint32_t>(p[2]) << 8) |
         static_cast<uint32_t>(p[3]);
}

static inline void write_be_u16(uint8_t* p, const uint16_t v) {
  p[0] = static_cast<uint8_t>((v >> 8) & 0xFFU);
  p[1] = static_cast<uint8_t>(v & 0xFFU);
}

static inline void write_be_u32(uint8_t* p, const uint32_t v) {
  p[0] = static_cast<uint8_t>((v >> 24) & 0xFFU);
  p[1] = static_cast<uint8_t>((v >> 16) & 0xFFU);
  p[2] = static_cast<uint8_t>((v >> 8) & 0xFFU);
  p[3] = static_cast<uint8_t>(v & 0xFFU);
}

static bool sha256_ret(const uint8_t* data, const size_t len, uint8_t out[32]) {
  if (data == nullptr || out == nullptr) return false;
  return mbedtls_sha256(data, len, out, 0) == 0;
}

static int mbedtls_rng(void* ctx, unsigned char* out, const size_t len) {
  (void)ctx;
  if (out == nullptr || len == 0) return 0;
  esp_fill_random(out, len);
  return 0;
}

struct EcKeyPair {
  uint8_t priv[32];
  uint8_t x[32];
  uint8_t y[32];
};

static bool ec_generate(EcKeyPair* out) {
  if (!out) return false;
#if FIDO_USE_STATIC_TEST_KEYPAIR
  static const uint8_t kPriv[32] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                                    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                                    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01};
  static const uint8_t kX[32] = {0x6b, 0x17, 0xd1, 0xf2, 0xe1, 0x2c, 0x42, 0x47, 0xf8, 0xbc, 0xe6,
                                 0xe5, 0x63, 0xa4, 0x40, 0xf2, 0x77, 0x03, 0x7d, 0x81, 0x2d, 0xeb,
                                 0x33, 0xa0, 0xf4, 0xa1, 0x39, 0x45, 0xd8, 0x98, 0xc2, 0x96};
  static const uint8_t kY[32] = {0x4f, 0xe3, 0x42, 0xe2, 0xfe, 0x1a, 0x7f, 0x9b, 0x8e, 0xe7, 0xeb,
                                 0x4a, 0x7c, 0x0f, 0x9e, 0x16, 0x2c, 0xbc, 0xe3, 0x35, 0x76, 0xb3,
                                 0x15, 0xec, 0xec, 0xbb, 0x64, 0x06, 0x83, 0x7b, 0xf5, 0x1f};
  memcpy(out->priv, kPriv, sizeof(out->priv));
  memcpy(out->x, kX, sizeof(out->x));
  memcpy(out->y, kY, sizeof(out->y));
  return true;
#else
  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);
  const int rc = mbedtls_ecp_gen_key(MBEDTLS_ECP_DP_SECP256R1, &key, mbedtls_rng, nullptr);
  if (rc != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  size_t privLen = 0;
  const int rc1 = mbedtls_ecp_write_key_ext(&key, &privLen, out->priv, sizeof(out->priv));

  uint8_t pub[65] = {0};
  size_t pubLen = 0;
  const int rc2 = mbedtls_ecp_write_public_key(&key, MBEDTLS_ECP_PF_UNCOMPRESSED, &pubLen, pub, sizeof(pub));
  int rc3 = -1;
  if (rc2 == 0 && pubLen == sizeof(pub) && pub[0] == 0x04) {
    memcpy(out->x, pub + 1, sizeof(out->x));
    memcpy(out->y, pub + 1 + sizeof(out->x), sizeof(out->y));
    rc3 = 0;
  }
  mbedtls_ecp_keypair_free(&key);
  return (rc1 == 0) && (privLen == sizeof(out->priv)) && (rc2 == 0) && (rc3 == 0);
#endif
}

