sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static bool ec_sign_der(const uint8_t priv[32], const uint8_t hash[32], uint8_t* sigOut, const size_t sigOutMax, size_t* sigLenOut) {
  if (!priv || !hash || !sigOut || !sigLenOut) return false;
  *sigLenOut = 0;

  mbedtls_ecp_keypair key;
  mbedtls_ecp_keypair_init(&key);
  if (mbedtls_ecp_read_key(MBEDTLS_ECP_DP_SECP256R1, &key, priv, 32) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }
  if (mbedtls_ecp_keypair_calc_public(&key, mbedtls_rng, nullptr) != 0) {
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  mbedtls_ecdsa_context ecdsa;
  mbedtls_ecdsa_init(&ecdsa);
  if (mbedtls_ecdsa_from_keypair(&ecdsa, &key) != 0) {
    mbedtls_ecdsa_free(&ecdsa);
    mbedtls_ecp_keypair_free(&key);
    return false;
  }

  size_t sigLen = 0;
  const int rc = mbedtls_ecdsa_write_signature(&ecdsa, MBEDTLS_MD_SHA256, hash, 32, sigOut, sigOutMax, &sigLen, mbedtls_rng,
                                               nullptr);
  mbedtls_ecdsa_free(&ecdsa);
  mbedtls_ecp_keypair_free(&key);
  if (rc != 0) return false;
  if (sigLen > sigOutMax) return false;
  *sigLenOut = sigLen;
  return true;
}

static bool fido_ct_equal(const uint8_t* a, const uint8_t* b, const size_t len) {
  if (!a || !b) return false;
  uint8_t diff = 0;
  for (size_t i = 0; i < len; ++i) diff |= static_cast<uint8_t>(a[i] ^ b[i]);
  return diff == 0;
}

static bool fido_hmac_sha256(const uint8_t* key, const size_t keyLen, const uint8_t* msg, const size_t msgLen, uint8_t out[32]) {
  if (!key || !msg || !out) return false;
  const mbedtls_md_info_t* info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (!info) return false;

  mbedtls_md_context_t ctx;
  mbedtls_md_init(&ctx);
  int rc = mbedtls_md_setup(&ctx, info, 1);
  if (rc == 0) rc = mbedtls_md_hmac_starts(&ctx, key, keyLen);
  if (rc == 0) rc = mbedtls_md_hmac_update(&ctx, msg, msgLen);
  if (rc == 0) rc = mbedtls_md_hmac_finish(&ctx, out);
  mbedtls_md_free(&ctx);
  return rc == 0;
}

static bool fido_aes256_cbc_crypt(const uint8_t key[32], const bool encrypt, const uint8_t* in, const size_t len, uint8_t* out) {
  if (!key || !in || !out) return false;
  if (len == 0 || (len % 16U) != 0U) return false;

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  uint8_t iv[16] = {0};
  int rc = encrypt ? mbedtls_aes_setkey_enc(&aes, key, 256) : mbedtls_aes_setkey_dec(&aes, key, 256);
  if (rc == 0) {
    rc = mbedtls_aes_crypt_cbc(&aes, encrypt ? MBEDTLS_AES_ENCRYPT : MBEDTLS_AES_DECRYPT, len, iv, in, out);
  }
  mbedtls_aes_free(&aes);
  return rc == 0;
}

static bool fido_client_pin_prepare_key_agreement() {
  EcKeyPair kp;
  if (!ec_generate(&kp)) return false;
  memcpy(fidoClientPin.keyAgreementPriv, kp.priv, sizeof(fidoClientPin.keyAgreementPriv));
  memcpy(fidoClientPin.keyAgreementX, kp.x, sizeof(fidoClientPin.keyAgreementX));
  memcpy(fidoClientPin.keyAgreementY, kp.y, sizeof(fidoClientPin.keyAgreementY));
  fidoClientPin.keyAgreementReady = true;
  return true;
}

static bool fido_client_pin_compute_shared_secret(const uint8_t peerX[32], const uint8_t peerY[32], uint8_t outSharedSecret[32]) {
  if (!peerX || !peerY || !outSharedSecret) return false;
  if (!fidoClientPin.keyAgreementReady && !fido_client_pin_prepare_key_agreement()) return false;

  uint8_t peerPub[65] = {0};
  peerPub[0] = 0x04;
  memcpy(peerPub + 1, peerX, 32);
  memcpy(peerPub + 33, peerY, 32);

  mbedtls_ecp_group grp;
  mbedtls_ecp_group_init(&grp);
  mbedtls_mpi d;
  mbedtls_mpi_init(&d);
  mbedtls_ecp_point qPeer;
  mbedtls_ecp_point_init(&qPeer);
  mbedtls_mpi z;
  mbedtls_mpi_init(&z);

  int rc = mbedtls_ecp_group_load(&grp, MBEDTLS_ECP_DP_SECP256R1);
  if (rc == 0) rc = mbedtls_mpi_read_binary(&d, fidoClientPin.keyAgreementPriv, sizeof(fidoClientPin.keyAgreementPriv));
  if (rc == 0) rc = mbedtls_ecp_point_read_binary(&grp, &qPeer, peerPub, sizeof(peerPub));
  if (rc == 0) rc = mbedtls_ecdh_compute_shared(&grp, &z, &qPeer, &d, mbedtls_rng, nullptr);

  uint8_t zBytes[32] = {0};
  if (rc == 0) rc = mbedtls_mpi_write_binary(&z, zBytes, sizeof(zBytes));
  bool ok = false;
  if (rc == 0) ok = sha256_ret(zBytes, sizeof(zBytes), outSharedSecret);

  secure_zero(zBytes, sizeof(zBytes));
  mbedtls_mpi_free(&z);
  mbedtls_ecp_point_free(&qPeer);
  mbedtls_mpi_free(&d);
  mbedtls_ecp_group_free(&grp);
  return ok;
}

static uint8_t fido_parse_cose_p256_pubkey(CborValue* value, uint8_t outX[32], uint8_t outY[32]) {
  if (!value || !outX || !outY) return CTAP2_ERR_INVALID_PARAMETER;
  if (!cbor_value_is_map(value)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;

  CborValue it;
  if (cbor_value_enter_container(value, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  bool haveX = false;
  bool haveY = false;
  while (!cbor_value_at_end(&it)) {
    int key = 0;
    if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &key) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    if (key == -2 || key == -3) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != 32) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = 32;
      uint8_t* dst = (key == -2) ? outX : outY;
      if (cbor_value_copy_byte_string(&it, dst, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (copy != 32) return CTAP2_ERR_INVALID_LENGTH;
      if (key == -2) haveX = true;
      else haveY = true;
    }
    if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  }
  if (cbor_value_leave_container(value, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  if (!haveX || !haveY) return CTAP2_ERR_MISSING_PARAMETER;
  return CTAP2_OK;
}

static bool fido_verify_pin_uv_auth_param(const uint8_t clientDataHash[32], const uint8_t pinUvAuthParam[16]) {
  if (!clientDataHash || !pinUvAuthParam) return false;
  uint8_t mac[32] = {0};
  bool ok = false;

