sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  // Legacy CTAP2.0 path (getPINToken): token is treated as 16-byte key material.
  if (fido_hmac_sha256(fidoClientPin.pinUvAuthToken, 16, clientDataHash, 32, mac) && fido_ct_equal(mac, pinUvAuthParam, 16)) {
    ok = true;
  }

  // CTAP2.1-style path (token-with-permissions): token may be 32-byte key material.
  if (!ok && fido_hmac_sha256(fidoClientPin.pinUvAuthToken, sizeof(fidoClientPin.pinUvAuthToken), clientDataHash, 32, mac) &&
      fido_ct_equal(mac, pinUvAuthParam, 16)) {
    ok = true;
  }

  secure_zero(mac, sizeof(mac));
  return ok;
}

static uint8_t ctap2_client_pin(const uint8_t* req, const size_t reqLen, uint8_t* out, const size_t outMax, size_t* outLen) {
  if (!req || !out || !outLen) return CTAP1_ERR_OTHER;
  *outLen = 0;
  if (reqLen == 0) return CTAP2_ERR_INVALID_LENGTH;

  CborParser parser;
  CborValue root;
  if (cbor_parser_init(req, reqLen, 0, &parser, &root) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  if (!cbor_value_is_map(&root)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;

  int pinUvAuthProtocol = 0;
  int subCommand = 0;
  bool haveSubCommand = false;
  uint8_t peerX[32] = {0};
  uint8_t peerY[32] = {0};
  bool haveKeyAgreement = false;
  uint8_t pinHashEnc[CTAP_PIN_HASH_ENC_LEN] = {0};
  bool havePinHashEnc = false;
  uint64_t permissions = 0;
  bool havePermissions = false;

  CborValue it;
  if (cbor_value_enter_container(&root, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  while (!cbor_value_at_end(&it)) {
    bool valueConsumedByLeave = false;
    int k = 0;
    if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &k) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;

    if (k == 0x01) {
      if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &pinUvAuthProtocol) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    } else if (k == 0x02) {
      if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &subCommand) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      haveSubCommand = true;
    } else if (k == 0x03) {
      const uint8_t st = fido_parse_cose_p256_pubkey(&it, peerX, peerY);
      if (st != CTAP2_OK) return st;
      haveKeyAgreement = true;
      valueConsumedByLeave = true;
    } else if (k == 0x06) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != CTAP_PIN_HASH_ENC_LEN) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = sizeof(pinHashEnc);
      if (cbor_value_copy_byte_string(&it, pinHashEnc, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (copy != sizeof(pinHashEnc)) return CTAP2_ERR_INVALID_LENGTH;
      havePinHashEnc = true;
    } else if (k == 0x09) {
      if (!cbor_value_is_integer(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      if (cbor_value_get_uint64(&it, &permissions) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      havePermissions = true;
    } else if (k == 0x0A) {
      // rpId (optional for makeCredential/assertion permissions); accepted and ignored in this minimal flow.
      if (!cbor_value_is_text_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
    }

    if (!valueConsumedByLeave) {
      if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    }
  }
  if (cbor_value_leave_container(&root, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  if (!haveSubCommand) return CTAP2_ERR_MISSING_PARAMETER;

  if (subCommand == CTAP_CLIENT_PIN_GET_RETRIES) {
    CborEncoder enc;
    cbor_encoder_init(&enc, out, outMax, 0);
    CborEncoder map;
    if (cbor_encoder_create_map(&enc, &map, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&map, 0x03) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_uint(&map, fidoClientPin.pinRetries) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    *outLen = cbor_encoder_get_buffer_size(&enc, out);
    return CTAP2_OK;
  }

  if (subCommand == CTAP_CLIENT_PIN_GET_UV_RETRIES) {
    CborEncoder enc;
    cbor_encoder_init(&enc, out, outMax, 0);
    CborEncoder map;
    if (cbor_encoder_create_map(&enc, &map, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&map, 0x05) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_uint(&map, 0) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    *outLen = cbor_encoder_get_buffer_size(&enc, out);
    return CTAP2_OK;
  }

  if (subCommand == CTAP_CLIENT_PIN_GET_KEY_AGREEMENT) {
    if (!fido_client_pin_prepare_key_agreement()) return CTAP2_ERR_PROCESSING;
    CborEncoder enc;
    cbor_encoder_init(&enc, out, outMax, 0);
    CborEncoder map;
    if (cbor_encoder_create_map(&enc, &map, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&map, 0x01) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    CborEncoder ka;
    if (cbor_encoder_create_map(&map, &ka, 5) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, 2) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, 3) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, -25) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, -1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, -2) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_byte_string(&ka, fidoClientPin.keyAgreementX, sizeof(fidoClientPin.keyAgreementX)) != CborNoError)
      return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&ka, -3) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_byte_string(&ka, fidoClientPin.keyAgreementY, sizeof(fidoClientPin.keyAgreementY)) != CborNoError)
      return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&map, &ka) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    *outLen = cbor_encoder_get_buffer_size(&enc, out);
    return CTAP2_OK;
  }

  if (subCommand == CTAP_CLIENT_PIN_GET_PIN_TOKEN || subCommand == CTAP_CLIENT_PIN_GET_PIN_UV_AUTH_TOKEN_USING_PIN_WITH_PERMISSIONS) {
    if (!security_pin_configured()) return CTAP2_ERR_PIN_NOT_SET;
    if (pinUvAuthProtocol != CTAP_PIN_UV_AUTH_PROTOCOL_1) return CTAP2_ERR_INVALID_PARAMETER;
    if (!haveKeyAgreement || !havePinHashEnc) return CTAP2_ERR_MISSING_PARAMETER;
    if (subCommand == CTAP_CLIENT_PIN_GET_PIN_UV_AUTH_TOKEN_USING_PIN_WITH_PERMISSIONS && !havePermissions)
      return CTAP2_ERR_MISSING_PARAMETER;
    if (fidoClientPin.pinRetries == 0) return CTAP2_ERR_PIN_BLOCKED;
    if (!fido_client_pin_hash_ready()) return CTAP2_ERR_PIN_NOT_SET;

    uint8_t expectedHash16[16] = {0};
    if (!security_fido_pin_hash16_get(expectedHash16)) return CTAP2_ERR_PIN_NOT_SET;

