sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    uint8_t sharedSecret[32] = {0};
    if (!fido_client_pin_compute_shared_secret(peerX, peerY, sharedSecret)) {
      secure_zero(expectedHash16, sizeof(expectedHash16));
      return CTAP2_ERR_PROCESSING;
    }

    uint8_t pinHashPlain[16] = {0};
    const bool decOk = fido_aes256_cbc_crypt(sharedSecret, false, pinHashEnc, sizeof(pinHashEnc), pinHashPlain);
    if (!decOk || !fido_ct_equal(pinHashPlain, expectedHash16, sizeof(pinHashPlain))) {
      if (fidoClientPin.pinRetries > 0) fidoClientPin.pinRetries--;
      const uint8_t st = (fidoClientPin.pinRetries == 0) ? CTAP2_ERR_PIN_BLOCKED : CTAP2_ERR_PIN_INVALID;
      secure_zero(sharedSecret, sizeof(sharedSecret));
      secure_zero(pinHashPlain, sizeof(pinHashPlain));
      secure_zero(expectedHash16, sizeof(expectedHash16));
      return st;
    }

    fidoClientPin.pinRetries = 8;
    const size_t tokenOutLen =
      (subCommand == CTAP_CLIENT_PIN_GET_PIN_TOKEN) ? static_cast<size_t>(16) : static_cast<size_t>(CTAP_PIN_TOKEN_LEN);
    uint8_t pinTokenEnc[CTAP_PIN_TOKEN_LEN] = {0};
    if (!fido_aes256_cbc_crypt(sharedSecret, true, fidoClientPin.pinUvAuthToken, tokenOutLen, pinTokenEnc)) {
      secure_zero(sharedSecret, sizeof(sharedSecret));
      secure_zero(pinHashPlain, sizeof(pinHashPlain));
      secure_zero(expectedHash16, sizeof(expectedHash16));
      secure_zero(pinTokenEnc, sizeof(pinTokenEnc));
      return CTAP2_ERR_PROCESSING;
    }

    CborEncoder enc;
    cbor_encoder_init(&enc, out, outMax, 0);
    CborEncoder map;
    if (cbor_encoder_create_map(&enc, &map, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&map, 0x02) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_byte_string(&map, pinTokenEnc, tokenOutLen) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    *outLen = cbor_encoder_get_buffer_size(&enc, out);

    secure_zero(sharedSecret, sizeof(sharedSecret));
    secure_zero(pinHashPlain, sizeof(pinHashPlain));
    secure_zero(expectedHash16, sizeof(expectedHash16));
    secure_zero(pinTokenEnc, sizeof(pinTokenEnc));
    return CTAP2_OK;
  }

  if (subCommand == CTAP_CLIENT_PIN_SET_PIN || subCommand == CTAP_CLIENT_PIN_CHANGE_PIN) {
    // PIN provisioning is done through /hsm web UI; ClientPIN currently supports entry flow only.
    return CTAP2_ERR_NOT_ALLOWED;
  }

  // Some hosts probe additional ClientPIN subcommands; respond softly.
  return CTAP2_ERR_NOT_ALLOWED;
}

static bool fido_client_pin_available() {
  return security_pin_configured();
}

static bool fido_client_pin_hash_ready() {
  uint8_t h[16] = {0};
  const bool ok = security_fido_pin_hash16_get(h);
  secure_zero(h, sizeof(h));
  return ok;
}

static bool build_cred_secret(const bool rk, const uint8_t* user, const size_t userLen, const uint8_t priv[32], uint8_t* out,
                              size_t* outLen) {
  if (!priv || !out || !outLen) return false;
  if (userLen > 64) return false;
  const size_t need = 3 + userLen + 32;
  if (need > CRED_MAX_SECRET_LEN) return false;
  out[0] = CTAP_CRED_SECRET_VER;
  out[1] = rk ? CTAP_CRED_FLAG_RK : 0;
  out[2] = static_cast<uint8_t>(userLen);
  if (userLen > 0 && user) memcpy(out + 3, user, userLen);
  memcpy(out + 3 + userLen, priv, 32);
  *outLen = need;
  return true;
}

static bool parse_cred_secret(const uint8_t* secret, const size_t secretLen, bool* rkOut, uint8_t* userOut, size_t* userLenOut,
                              uint8_t privOut[32]) {
  if (!secret || secretLen < (3 + 32) || !rkOut || !userLenOut || !privOut) return false;
  if (secret[0] != CTAP_CRED_SECRET_VER) return false;
  const bool rk = (secret[1] & CTAP_CRED_FLAG_RK) != 0;
  const size_t userLen = secret[2];
  const size_t need = 3 + userLen + 32;
  if (need != secretLen) return false;
  if (userLen > 64) return false;
  if (userLen > 0 && userOut) memcpy(userOut, secret + 3, userLen);
  memcpy(privOut, secret + 3 + userLen, 32);
  *rkOut = rk;
  *userLenOut = userLen;
  return true;
}

static uint32_t load_sign_count() {
#if FIDO_DISABLE_PERSISTENCE
  return 0;
#else
  prefs.begin("kbm", true);
  const uint32_t v = prefs.getUInt("sc", 0);
  prefs.end();
  return v;
#endif
}

static void save_sign_count(const uint32_t v) {
#if FIDO_DISABLE_PERSISTENCE
  (void)v;
#else
  prefs.begin("kbm", false);
  prefs.putUInt("sc", v);
  prefs.end();
#endif
}

static constexpr size_t RUNTIME_CRED_SLOTS = 8;
struct RuntimeCredRecord {
  bool used = false;
  char rpId[CRED_MAX_RPID_LEN + 1] = {0};
  uint8_t id[CRED_MAX_ID_LEN] = {0};
  uint16_t idLen = 0;
  uint8_t secret[CRED_MAX_SECRET_LEN] = {0};
  uint16_t secretLen = 0;
  uint32_t stamp = 0;
};

static RuntimeCredRecord runtimeCreds[RUNTIME_CRED_SLOTS];
static uint32_t runtimeCredStamp = 1;

static int runtime_cred_find(const uint8_t* id, const size_t idLen) {
  if (!id || idLen == 0 || idLen > CRED_MAX_ID_LEN) return -1;
  for (size_t i = 0; i < RUNTIME_CRED_SLOTS; ++i) {
    const RuntimeCredRecord& rec = runtimeCreds[i];
    if (!rec.used) continue;
    if (rec.idLen != idLen) continue;
    if (memcmp(rec.id, id, idLen) == 0) return static_cast<int>(i);
  }
  return -1;
}

static void runtime_cred_clear() {
  for (size_t i = 0; i < RUNTIME_CRED_SLOTS; ++i) {
    RuntimeCredRecord& rec = runtimeCreds[i];
    if (rec.used && rec.secretLen > 0) secure_zero(rec.secret, rec.secretLen);
    rec.used = false;
    rec.rpId[0] = '\0';
    rec.idLen = 0;
    rec.secretLen = 0;
    rec.stamp = 0;
  }
  runtimeCredStamp = 1;
}

static bool runtime_cred_exists(const uint8_t* id, const size_t idLen) {
  return runtime_cred_find(id, idLen) >= 0;
}

static bool runtime_cred_add(const char* rpId, const uint8_t* id, const size_t idLen, const uint8_t* secret, const size_t secretLen) {
  if (!rpId || rpId[0] == '\0' || !id || idLen == 0 || idLen > CRED_MAX_ID_LEN || !secret || secretLen == 0 ||
      secretLen > CRED_MAX_SECRET_LEN) {
    return false;
  }

  int idx = runtime_cred_find(id, idLen);
  if (idx < 0) {
    for (size_t i = 0; i < RUNTIME_CRED_SLOTS; ++i) {
      if (!runtimeCreds[i].used) {
        idx = static_cast<int>(i);
        break;
      }
    }
  }
  if (idx < 0) {
    uint32_t oldest = UINT32_MAX;
    size_t oldestIdx = 0;
    for (size_t i = 0; i < RUNTIME_CRED_SLOTS; ++i) {
      if (runtimeCreds[i].stamp < oldest) {
        oldest = runtimeCreds[i].stamp;
        oldestIdx = i;
      }
    }
    idx = static_cast<int>(oldestIdx);
  }

  RuntimeCredRecord& rec = runtimeCreds[idx];
  if (rec.used && rec.secretLen > 0) secure_zero(rec.secret, rec.secretLen);
  rec.used = true;

  const size_t rpLen = strnlen(rpId, CRED_MAX_RPID_LEN);
  memcpy(rec.rpId, rpId, rpLen);
  rec.rpId[rpLen] = '\0';

  rec.idLen = static_cast<uint16_t>(idLen);
  memcpy(rec.id, id, idLen);

  rec.secretLen = static_cast<uint16_t>(secretLen);
  memcpy(rec.secret, secret, secretLen);

  rec.stamp = runtimeCredStamp++;
  if (runtimeCredStamp == 0) runtimeCredStamp = 1;
  return true;
}

