sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static bool runtime_cred_lookup(const uint8_t* id, const size_t idLen, char* rpOut, const size_t rpOutMax, uint8_t* secretOut,
                                size_t* secretLenOut) {
  if (secretLenOut) *secretLenOut = 0;
  if (rpOut && rpOutMax) rpOut[0] = '\0';

  const int idx = runtime_cred_find(id, idLen);
  if (idx < 0) return false;
  const RuntimeCredRecord& rec = runtimeCreds[idx];

  if (rpOut && rpOutMax) {
    const size_t rpLen = strnlen(rec.rpId, CRED_MAX_RPID_LEN);
    const size_t copyLen = (rpLen < (rpOutMax - 1)) ? rpLen : (rpOutMax - 1);
    memcpy(rpOut, rec.rpId, copyLen);
    rpOut[copyLen] = '\0';
  }
  if (secretOut && secretLenOut) {
    memcpy(secretOut, rec.secret, rec.secretLen);
    *secretLenOut = rec.secretLen;
  }
  return true;
}

static bool runtime_cred_lookup_by_rpid(const char* rpId, uint8_t* idOut, const size_t idOutMax, size_t* idLenOut, uint8_t* secretOut,
                                        const size_t secretOutMax, size_t* secretLenOut) {
  if (idLenOut) *idLenOut = 0;
  if (secretLenOut) *secretLenOut = 0;
  if (!rpId || rpId[0] == '\0' || !idOut || !idLenOut || !secretOut || !secretLenOut) return false;
  if (idOutMax < CRED_MAX_ID_LEN || secretOutMax < CRED_MAX_SECRET_LEN) return false;

  int bestIdx = -1;
  uint32_t bestStamp = 0;
  for (size_t i = 0; i < RUNTIME_CRED_SLOTS; ++i) {
    const RuntimeCredRecord& rec = runtimeCreds[i];
    if (!rec.used) continue;
    if (strcmp(rec.rpId, rpId) != 0) continue;
    if (bestIdx < 0 || rec.stamp >= bestStamp) {
      bestIdx = static_cast<int>(i);
      bestStamp = rec.stamp;
    }
  }
  if (bestIdx < 0) return false;

  const RuntimeCredRecord& rec = runtimeCreds[bestIdx];
  memcpy(idOut, rec.id, rec.idLen);
  *idLenOut = rec.idLen;
  memcpy(secretOut, rec.secret, rec.secretLen);
  *secretLenOut = rec.secretLen;
  return true;
}

static bool cred_store_id_exists(const uint8_t* id, const size_t idLen) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;
  if (!id || idLen == 0 || idLen > CRED_MAX_ID_LEN) return false;
  if (runtime_cred_exists(id, idLen)) return true;

#if FIDO_DISABLE_PERSISTENCE
  return false;
#endif

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;

  bool found = false;
  if (buf && len >= kStoreHdrLen) {
    size_t off = kStoreHdrLen;
    for (uint16_t i = 0; i < count; ++i) {
      const uint16_t rpLen = read_le_u16(buf + off + 0);
      const uint16_t labelLen = read_le_u16(buf + off + 2);
      const uint16_t curIdLen = read_le_u16(buf + off + 4);
      const uint16_t secretLen = read_le_u16(buf + off + 6);
      const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) + static_cast<size_t>(curIdLen) +
                              static_cast<size_t>(secretLen);
      const uint8_t* rp = buf + off + kRecHdrLen;
      const uint8_t* label = rp + rpLen;
      const uint8_t* curId = label + labelLen;
      if (curIdLen == idLen && memcmp(curId, id, idLen) == 0) {
        found = true;
        break;
      }
      off += recTotal;
    }
  }

  if (buf) {
    secure_zero(buf, len);
    free(buf);
  }
  return found;
}

static bool cred_store_add_credential(const char* rpId, const uint8_t* id, const size_t idLen, const uint8_t* secret, const size_t secretLen) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;
  if (!rpId || rpId[0] == '\0' || !id || idLen == 0 || idLen > CRED_MAX_ID_LEN || !secret || secretLen == 0 ||
      secretLen > CRED_MAX_SECRET_LEN) {
    return false;
  }
  const size_t rpLen = strnlen(rpId, CRED_MAX_RPID_LEN + 1);
  if (rpLen == 0 || rpLen > CRED_MAX_RPID_LEN) return false;
  if (runtime_cred_exists(id, idLen)) return false;
  if (!runtime_cred_add(rpId, id, idLen, secret, secretLen)) return false;

#if FIDO_DISABLE_PERSISTENCE
  return true;
#endif

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;

  // Check for duplicate IDs within the loaded blob.
  if (buf && len >= kStoreHdrLen) {
    size_t off = kStoreHdrLen;
    for (uint16_t i = 0; i < count; ++i) {
      const uint16_t rpLen2 = read_le_u16(buf + off + 0);
      const uint16_t labelLen2 = read_le_u16(buf + off + 2);
      const uint16_t curIdLen = read_le_u16(buf + off + 4);
      const uint16_t secretLen2 = read_le_u16(buf + off + 6);
      const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen2) + static_cast<size_t>(labelLen2) + static_cast<size_t>(curIdLen) +
                              static_cast<size_t>(secretLen2);
      const uint8_t* rp = buf + off + kRecHdrLen;
      const uint8_t* label = rp + rpLen2;
      const uint8_t* curId = label + labelLen2;
      if (curIdLen == idLen && memcmp(curId, id, idLen) == 0) {
        secure_zero(buf, len);
        free(buf);
        return false;
      }
      off += recTotal;
    }
  }

  const size_t recTotal = kRecHdrLen + rpLen + 0 + idLen + secretLen;
  const size_t baseLen = (buf && len >= kStoreHdrLen) ? len : kStoreHdrLen;
  const size_t newLen = baseLen + recTotal;
  if (newLen > CRED_STORE_MAX_BYTES) {
    if (buf) {
      secure_zero(buf, len);
      free(buf);
    }
    return false;
  }

  const uint16_t newCount = count + 1;
  uint8_t* out = static_cast<uint8_t*>(malloc(newLen));
  if (!out) {
    if (buf) {
      secure_zero(buf, len);
      free(buf);
    }
    return false;
  }

  write_cred_store_header(out, newCount);
  size_t w = kStoreHdrLen;
  if (buf && len >= kStoreHdrLen) {
    memcpy(out + w, buf + kStoreHdrLen, len - kStoreHdrLen);
    w += (len - kStoreHdrLen);
  }

  const uint32_t createdAt = static_cast<uint32_t>(millis());
  write_le_u16(out + w + 0, static_cast<uint16_t>(rpLen));
  write_le_u16(out + w + 2, 0);
  write_le_u16(out + w + 4, static_cast<uint16_t>(idLen));
  write_le_u16(out + w + 6, static_cast<uint16_t>(secretLen));
  write_le_u32(out + w + 8, createdAt);
  w += kRecHdrLen;
  memcpy(out + w, rpId, rpLen);
  w += rpLen;
  memcpy(out + w, id, idLen);
  w += idLen;
  memcpy(out + w, secret, secretLen);
  w += secretLen;

  const bool ok = (w == newLen) && cred_store_save(out, newLen);
  secure_zero(out, newLen);
  free(out);
  if (buf) {
    secure_zero(buf, len);
    free(buf);
  }
  return ok;
}

