sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static bool cred_store_lookup(const uint8_t* id, const size_t idLen, char* rpOut, const size_t rpOutMax, uint8_t* secretOut,
                              size_t* secretLenOut) {
  static constexpr size_t kStoreHdrLen = 12;
  static constexpr size_t kRecHdrLen = 12;
  if (secretLenOut) *secretLenOut = 0;
  if (rpOut && rpOutMax) rpOut[0] = '\0';
  if (!id || idLen == 0 || idLen > CRED_MAX_ID_LEN) return false;

  if (runtime_cred_lookup(id, idLen, rpOut, rpOutMax, secretOut, secretLenOut)) return true;
#if FIDO_DISABLE_PERSISTENCE
  return false;
#endif

  uint8_t* buf = nullptr;
  size_t len = 0;
  uint16_t count = 0;
  if (!cred_store_load(&buf, &len, &count)) return false;
  if (!buf || len < kStoreHdrLen) return false;

  bool found = false;
  size_t off = kStoreHdrLen;
  for (uint16_t i = 0; i < count; ++i) {
    const uint16_t rpLen = read_le_u16(buf + off + 0);
    const uint16_t labelLen = read_le_u16(buf + off + 2);
    const uint16_t curIdLen = read_le_u16(buf + off + 4);
    const uint16_t secretLen = read_le_u16(buf + off + 6);
    const size_t recTotal = kRecHdrLen + static_cast<size_t>(rpLen) + static_cast<size_t>(labelLen) + static_cast<size_t>(curIdLen) +
                            static_cast<size_t>(secretLen);
    const uint8_t* rp = buf + off + kRecHdrLen;
    const uint8_t* label = rp + rpLen;
    const uint8_t* curId = label + labelLen;
    const uint8_t* curSecret = curId + curIdLen;
    if (curIdLen == idLen && memcmp(curId, id, idLen) == 0) {
      if (rpOut && rpOutMax) {
        const size_t copyLen = (rpLen < (rpOutMax - 1)) ? rpLen : (rpOutMax - 1);
        memcpy(rpOut, rp, copyLen);
        rpOut[copyLen] = '\0';
      }
      if (secretOut && secretLenOut && secretLen <= CRED_MAX_SECRET_LEN) {
        memcpy(secretOut, curSecret, secretLen);
        *secretLenOut = secretLen;
      }
      found = true;
      break;
    }
    off += recTotal;
  }

  secure_zero(buf, len);
  free(buf);
  return found;
}

static bool ctap2_build_cose_p256_es256(const uint8_t x[32], const uint8_t y[32], uint8_t* out, const size_t outMax, size_t* outLen) {
  if (!x || !y || !out || !outLen) return false;
  *outLen = 0;
  CborEncoder enc;
  cbor_encoder_init(&enc, out, outMax, 0);
  CborEncoder m;
  if (cbor_encoder_create_map(&enc, &m, 5) != CborNoError) return false;
  if (cbor_encode_int(&m, 1) != CborNoError) return false;
  if (cbor_encode_int(&m, 2) != CborNoError) return false; // kty: EC2
  if (cbor_encode_int(&m, 3) != CborNoError) return false;
  if (cbor_encode_int(&m, -7) != CborNoError) return false; // alg: ES256
  if (cbor_encode_int(&m, -1) != CborNoError) return false;
  if (cbor_encode_int(&m, 1) != CborNoError) return false; // crv: P-256
  if (cbor_encode_int(&m, -2) != CborNoError) return false;
  if (cbor_encode_byte_string(&m, x, 32) != CborNoError) return false;
  if (cbor_encode_int(&m, -3) != CborNoError) return false;
  if (cbor_encode_byte_string(&m, y, 32) != CborNoError) return false;
  if (cbor_encoder_close_container(&enc, &m) != CborNoError) return false;
  *outLen = cbor_encoder_get_buffer_size(&enc, out);
  return (*outLen > 0) && (*outLen <= outMax);
}

static uint8_t ctap2_parse_pubkey_cred_descriptor(CborValue* descMap, uint8_t* idOut, const size_t idOutMax, size_t* idLenOut,
                                                   bool* typePublicKeyOut) {
  if (!descMap || !idOut || !idLenOut || !typePublicKeyOut) return CTAP1_ERR_OTHER;
  if (!cbor_value_is_map(descMap)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;

  *idLenOut = 0;
  *typePublicKeyOut = false;

  CborValue dIt;
  if (cbor_value_enter_container(descMap, &dIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;

  uint16_t descLoopGuard = 0;
  while (!cbor_value_at_end(&dIt)) {
    if (++descLoopGuard > 16) return CTAP2_ERR_INVALID_CBOR;
    bool keyIsType = false;
    bool keyIsId = false;

    if (cbor_value_is_integer(&dIt)) {
      int dk = 0;
      if (cbor_value_get_int(&dIt, &dk) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      keyIsType = (dk == 0x01);
      keyIsId = (dk == 0x02);
      if (cbor_value_advance(&dIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    } else if (cbor_value_is_text_string(&dIt)) {
      if (cbor_value_text_string_equals(&dIt, "type", &keyIsType) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (cbor_value_text_string_equals(&dIt, "id", &keyIsId) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (cbor_value_advance(&dIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
    } else {
      return CTAP2_ERR_INVALID_CBOR;
    }

    if (keyIsType) {
      if (!cbor_value_is_text_string(&dIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      bool isPublicKey = false;
      if (cbor_value_text_string_equals(&dIt, "public-key", &isPublicKey) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (isPublicKey) *typePublicKeyOut = true;
    } else if (keyIsId) {
      if (!cbor_value_is_byte_string(&dIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&dIt, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n == 0 || n > idOutMax) return CTAP2_ERR_LIMIT_EXCEEDED;
      size_t copyLen = idOutMax;
      if (cbor_value_copy_byte_string(&dIt, idOut, &copyLen, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      *idLenOut = copyLen;
    }

    if (cbor_value_advance(&dIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // value -> next key/end
  }

  if (cbor_value_leave_container(descMap, &dIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  return CTAP2_OK;
}

static uint8_t ctap2_get_info(uint8_t* out, const size_t outMax, size_t* outLen) {
  if (!out || !outLen) return CTAP1_ERR_OTHER;
  *outLen = 0;
  const bool clientPin = fido_client_pin_available();
  const size_t mapPairs = clientPin ? 5 : 4;
  CborEncoder enc;
  cbor_encoder_init(&enc, out, outMax, 0);

  // Keep getInfo compact enough to fit a single CTAPHID frame.
  // Map keys:
  // - 0x01 versions
  // - 0x03 aaguid
  // - 0x04 options
  // - 0x05 maxMsgSize
  // - 0x06 pinUvAuthProtocols (when clientPin is configured)
  CborEncoder map;
  if (cbor_encoder_create_map(&enc, &map, mapPairs) != CborNoError) return CTAP2_ERR_CBOR_PARSING;

