sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  // versions
  if (cbor_encode_int(&map, 0x01) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  CborEncoder versions;
  if (cbor_encoder_create_array(&map, &versions, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&versions, "FIDO_2_0") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encoder_close_container(&map, &versions) != CborNoError) return CTAP2_ERR_CBOR_PARSING;

  // aaguid
  if (cbor_encode_int(&map, 0x03) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_byte_string(&map, CTAP_AAGUID, sizeof(CTAP_AAGUID)) != CborNoError) return CTAP2_ERR_CBOR_PARSING;

  // options
  if (cbor_encode_int(&map, 0x04) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  CborEncoder opt;
  if (cbor_encoder_create_map(&map, &opt, 3) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&opt, "up") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_boolean(&opt, true) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&opt, "rk") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_boolean(&opt, true) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&opt, "clientPin") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_boolean(&opt, clientPin) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encoder_close_container(&map, &opt) != CborNoError) return CTAP2_ERR_CBOR_PARSING;

  // maxMsgSize
  if (cbor_encode_int(&map, 0x05) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_uint(&map, FIDO_MAX_PAYLOAD) != CborNoError) return CTAP2_ERR_CBOR_PARSING;

  if (clientPin) {
    // pinUvAuthProtocols = [1]
    if (cbor_encode_int(&map, 0x06) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    CborEncoder prots;
    if (cbor_encoder_create_array(&map, &prots, 1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_uint(&prots, CTAP_PIN_UV_AUTH_PROTOCOL_1) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encoder_close_container(&map, &prots) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  }

  if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  *outLen = cbor_encoder_get_buffer_size(&enc, out);
  return CTAP2_OK;
}

static uint8_t ctap2_make_credential(const uint8_t* req, const size_t reqLen, uint8_t* out, const size_t outMax, size_t* outLen) {
  if (!req || !out || !outLen) return CTAP1_ERR_OTHER;
  *outLen = 0;
  if (reqLen == 0) return CTAP2_ERR_INVALID_LENGTH;
  FIDO_LOG("makeCredential: begin reqLen=%u", static_cast<unsigned>(reqLen));
#if FIDO_FORCE_MAKECRED_EARLY_ERROR
  FIDO_LOG("makeCredential: forced early error");
  return CTAP2_ERR_INVALID_CBOR;
#endif
  if (reqLen >= 8) {
    FIDO_LOG("makeCredential: head=%02X%02X%02X%02X tail=%02X%02X%02X%02X", req[0], req[1], req[2], req[3], req[reqLen - 4],
             req[reqLen - 3], req[reqLen - 2], req[reqLen - 1]);
  }
  uint8_t reqHash[32];
  if (sha256_ret(req, reqLen, reqHash)) {
    FIDO_LOG("makeCredential: hash=%02X%02X%02X%02X...%02X%02X%02X%02X", reqHash[0], reqHash[1], reqHash[2], reqHash[3],
             reqHash[28], reqHash[29], reqHash[30], reqHash[31]);
  }

  // Parse request map
  CborParser parser;
  CborValue root;
  if (cbor_parser_init(req, reqLen, 0, &parser, &root) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  FIDO_LOG("makeCredential: cbor_parser_init ok");
  if (!cbor_value_is_map(&root)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
  FIDO_LOG("makeCredential: root is map");

  uint8_t clientDataHash[32] = {0};
  bool haveClientHash = false;
  char rpId[CRED_MAX_RPID_LEN + 1];
  rpId[0] = '\0';
  bool haveRpId = false;
  uint8_t userId[64];
  size_t userIdLen = 0;
  bool haveUser = false;
  bool haveAlg = false;
  bool optionRk = false;
  bool optionUv = false;
  bool excludeHit = false;
  const bool pinGate = security_pin_configured() && !security_pin_unlocked_now();
  bool pinAuthSatisfied = false;
  uint8_t pinUvAuthParam[CTAP_PIN_UV_AUTH_PARAM_LEN] = {0};
  bool havePinUvAuthParam = false;
  int pinUvAuthProtocol = 0;
  bool havePinUvAuthProtocol = false;

  CborValue it;
  if (cbor_value_enter_container(&root, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  FIDO_LOG("makeCredential: entered root map");
  uint16_t topLoopGuard = 0;
  bool minimalParsedEnough = false;
  while (!cbor_value_at_end(&it)) {
    if (++topLoopGuard > 64) return CTAP2_ERR_INVALID_CBOR;
    bool valueConsumedByLeave = false;
    int k = 0;
    if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &k) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    FIDO_LOG("makeCredential: key=%d", k);

#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
    if (!pinGate && haveClientHash && haveRpId && (k != 0x01) && (k != 0x02)) {
      // Stop after the required fields to avoid unstable deep-map traversal paths.
      FIDO_LOG("makeCredential: minimal parse early exit at key=%d", k);
      minimalParsedEnough = true;
      break;
    }
#endif

    if (k == 0x01) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != 32) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = sizeof(clientDataHash);
      if (cbor_value_copy_byte_string(&it, clientDataHash, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      haveClientHash = true;
      FIDO_LOG("makeCredential: key 0x01 ok");
    } else if (k == 0x02) {
      if (!cbor_value_is_map(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      CborValue rpIt;
      if (cbor_value_enter_container(&it, &rpIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t rpLoopGuard = 0;
      while (!cbor_value_at_end(&rpIt)) {
        if (++rpLoopGuard > 16) return CTAP2_ERR_INVALID_CBOR;
        if (!cbor_value_is_text_string(&rpIt)) return CTAP2_ERR_INVALID_CBOR;
        bool keyIsId = false;
        if (cbor_value_text_string_equals(&rpIt, "id", &keyIsId) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (cbor_value_advance(&rpIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
        if (keyIsId) {
          if (!cbor_value_is_text_string(&rpIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
          size_t idLen = 0;
          if (cbor_value_calculate_string_length(&rpIt, &idLen) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          if (idLen == 0 || idLen > CRED_MAX_RPID_LEN) return CTAP2_ERR_LIMIT_EXCEEDED;
          size_t copyLen = sizeof(rpId);
          if (cbor_value_copy_text_string(&rpIt, rpId, &copyLen, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          rpId[sizeof(rpId) - 1] = '\0';
          haveRpId = true;
        }
        if (cbor_value_advance(&rpIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // value -> next key/end
      }
      if (cbor_value_leave_container(&it, &rpIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("makeCredential: key 0x02 ok");
    } else if (k == 0x03) {
      if (!cbor_value_is_map(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
      // Stability mode: do not parse user map deeply.
      FIDO_LOG("makeCredential: key 0x03 skip deep user parse");
#else
      CborValue uIt;
      if (cbor_value_enter_container(&it, &uIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t userLoopGuard = 0;
      while (!cbor_value_at_end(&uIt)) {
        if (++userLoopGuard > 24) return CTAP2_ERR_INVALID_CBOR;
        if (!cbor_value_is_text_string(&uIt)) return CTAP2_ERR_INVALID_CBOR;
        bool keyIsId = false;
        if (cbor_value_text_string_equals(&uIt, "id", &keyIsId) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (cbor_value_advance(&uIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
        if (keyIsId) {
          if (!cbor_value_is_byte_string(&uIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
          size_t n = 0;
          if (cbor_value_calculate_string_length(&uIt, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          if (n == 0 || n > sizeof(userId)) return CTAP2_ERR_LIMIT_EXCEEDED;
          userIdLen = sizeof(userId);
          if (cbor_value_copy_byte_string(&uIt, userId, &userIdLen, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          haveUser = true;
        }
        if (cbor_value_advance(&uIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // value -> next key/end
      }
      if (cbor_value_leave_container(&it, &uIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("makeCredential: key 0x03 ok");
#endif
    } else if (k == 0x04) {
      if (!cbor_value_is_array(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
      // Stability mode: accept supported algorithm set from platform request
      // without parsing each descriptor.
      haveAlg = true;
      FIDO_LOG("makeCredential: key 0x04 skip deep alg parse");
#else
      CborValue aIt;
      if (cbor_value_enter_container(&it, &aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t paramsOuterLoopGuard = 0;
      while (!cbor_value_at_end(&aIt)) {
        if (++paramsOuterLoopGuard > 16) return CTAP2_ERR_INVALID_CBOR;
        if (!cbor_value_is_map(&aIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
        bool typeOk = false;
        bool algOk = false;
        int alg = 0;
        CborValue pIt;
        if (cbor_value_enter_container(&aIt, &pIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        uint16_t paramsInnerLoopGuard = 0;
        while (!cbor_value_at_end(&pIt)) {
          if (++paramsInnerLoopGuard > 12) return CTAP2_ERR_INVALID_CBOR;
          if (!cbor_value_is_text_string(&pIt)) return CTAP2_ERR_INVALID_CBOR;
          bool keyIsType = false;
          bool keyIsAlg = false;
          if (cbor_value_text_string_equals(&pIt, "type", &keyIsType) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          if (cbor_value_text_string_equals(&pIt, "alg", &keyIsAlg) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
          if (cbor_value_advance(&pIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
          if (keyIsType) {
            if (!cbor_value_is_text_string(&pIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
            bool isPublicKey = false;
            if (cbor_value_text_string_equals(&pIt, "public-key", &isPublicKey) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
            if (isPublicKey) typeOk = true;
          } else if (keyIsAlg) {
            if (!cbor_value_is_integer(&pIt) || cbor_value_get_int(&pIt, &alg) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
            if (alg == -7) algOk = true;
          }
          if (cbor_value_advance(&pIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // value -> next key/end
        }
        if (cbor_value_leave_container(&aIt, &pIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (typeOk && algOk) haveAlg = true;
        if (cbor_value_advance(&aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      }
      if (cbor_value_leave_container(&it, &aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("makeCredential: key 0x04 ok alg=%u", static_cast<unsigned>(haveAlg));
#endif
    } else if (k == 0x05) {
      // excludeList
      if (!cbor_value_is_array(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
#if FIDO_STABILITY_SKIP_CRED_DESCRIPTOR_PARSE
      // Stability mode: skip parsing credential descriptors to avoid parser crash paths.
      FIDO_LOG("makeCredential: key 0x05 skip descriptor parsing");
#else
      CborValue exIt;
      if (cbor_value_enter_container(&it, &exIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t excludeLoopGuard = 0;
      while (!cbor_value_at_end(&exIt)) {
        if (++excludeLoopGuard > 16) return CTAP2_ERR_INVALID_CBOR;
        uint8_t cid[CRED_MAX_ID_LEN];
        size_t cidLen = 0;
        bool typePublicKey = false;
        const uint8_t st = ctap2_parse_pubkey_cred_descriptor(&exIt, cid, sizeof(cid), &cidLen, &typePublicKey);
        if (st != CTAP2_OK) return st;
        if (typePublicKey && cidLen > 0 && cred_store_id_exists(cid, cidLen)) excludeHit = true;
        if (cbor_value_advance(&exIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      }
      if (cbor_value_leave_container(&it, &exIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("makeCredential: key 0x05 ok excludeHit=%u", static_cast<unsigned>(excludeHit));
#endif
    } else if (k == 0x07) {
      // options
      if (!cbor_value_is_map(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
      FIDO_LOG("makeCredential: key 0x07 skip options parse");
#else
      CborValue oIt;
      if (cbor_value_enter_container(&it, &oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t optionsLoopGuard = 0;
      while (!cbor_value_at_end(&oIt)) {
        if (++optionsLoopGuard > 12) return CTAP2_ERR_INVALID_CBOR;
        if (!cbor_value_is_text_string(&oIt)) return CTAP2_ERR_INVALID_CBOR;
        bool keyIsRk = false;
        bool keyIsUv = false;
        if (cbor_value_text_string_equals(&oIt, "rk", &keyIsRk) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (cbor_value_text_string_equals(&oIt, "uv", &keyIsUv) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (cbor_value_advance(&oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
        if (!cbor_value_is_boolean(&oIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
        bool v = false;
        if (cbor_value_get_boolean(&oIt, &v) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (keyIsRk) optionRk = v;
        else if (keyIsUv) optionUv = v;
        if (cbor_value_advance(&oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      }
      if (cbor_value_leave_container(&it, &oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("makeCredential: key 0x07 ok rk=%u uv=%u", static_cast<unsigned>(optionRk), static_cast<unsigned>(optionUv));
#endif
    } else if (k == 0x08) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != CTAP_PIN_UV_AUTH_PARAM_LEN) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = sizeof(pinUvAuthParam);
      if (cbor_value_copy_byte_string(&it, pinUvAuthParam, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (copy != sizeof(pinUvAuthParam)) return CTAP2_ERR_INVALID_LENGTH;
      havePinUvAuthParam = true;
    } else if (k == 0x09) {
      if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &pinUvAuthProtocol) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      havePinUvAuthProtocol = true;
    }

    if (!valueConsumedByLeave) {
      if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    }
  }
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
  if (!minimalParsedEnough) cbor_value_leave_container(&root, &it);
#else
  cbor_value_leave_container(&root, &it);
#endif
  FIDO_LOG("makeCredential: finished parse loop");

