sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
  haveUser = true;
  haveAlg = true;
#endif

  if (excludeHit) return CTAP2_ERR_CREDENTIAL_EXCLUDED;
  if (!haveClientHash || !haveRpId || !haveUser) return CTAP2_ERR_MISSING_PARAMETER;
  if (!haveAlg) return CTAP2_ERR_UNSUPPORTED_ALGORITHM;
  if (optionUv) return CTAP2_ERR_UNSUPPORTED_OPTION;
  if (pinGate) {
    if (!fido_client_pin_available()) return CTAP2_ERR_PIN_NOT_SET;
    if (!fido_client_pin_hash_ready()) return CTAP2_ERR_PIN_NOT_SET;
    if (!havePinUvAuthParam || !havePinUvAuthProtocol) return CTAP2_ERR_PIN_REQUIRED;
    if (pinUvAuthProtocol != CTAP_PIN_UV_AUTH_PROTOCOL_1) return CTAP2_ERR_PIN_AUTH_INVALID;
    if (!fido_verify_pin_uv_auth_param(clientDataHash, pinUvAuthParam)) return CTAP2_ERR_PIN_AUTH_INVALID;
    pinAuthSatisfied = true;
  }
  FIDO_LOG("makeCredential: parsed rpId=%s userIdLen=%u optionRk=%u", rpId, static_cast<unsigned>(userIdLen),
           static_cast<unsigned>(optionRk));

#if FIDO_MAKECRED_TEST_STAGE == 1
  FIDO_LOG("makeCredential: test-stage 1 (after parse)");
  return CTAP2_ERR_INVALID_CBOR;
#endif

#if FIDO_FORCE_MAKECRED_PARSE_ONLY_ERROR
  FIDO_LOG("makeCredential: forced parse-only error");
  return CTAP2_ERR_INVALID_CBOR;
#endif

  // Create keypair and credentialId
  EcKeyPair kp;
  FIDO_LOG("makeCredential: ec_generate start");
  if (!ec_generate(&kp)) return CTAP2_ERR_PROCESSING;
  FIDO_LOG("makeCredential: ec_generate done");

#if FIDO_MAKECRED_TEST_STAGE == 2
  FIDO_LOG("makeCredential: test-stage 2 (after keygen)");
  return CTAP2_ERR_INVALID_CBOR;
#endif

  uint8_t credId[16];
  for (uint8_t tries = 0; tries < 10; ++tries) {
    esp_fill_random(credId, sizeof(credId));
    if (!cred_store_id_exists(credId, sizeof(credId))) break;
  }
  if (cred_store_id_exists(credId, sizeof(credId))) return CTAP2_ERR_KEY_STORE_FULL;
  FIDO_LOG("makeCredential: credId allocated");

  uint8_t secret[CRED_MAX_SECRET_LEN];
  size_t secretLen = 0;
  FIDO_LOG("makeCredential: build_cred_secret start");
  if (!build_cred_secret(optionRk, userId, userIdLen, kp.priv, secret, &secretLen)) return CTAP2_ERR_PROCESSING;
  FIDO_LOG("makeCredential: build_cred_secret done len=%u", static_cast<unsigned>(secretLen));

  FIDO_LOG("makeCredential: cred_store_add start");
  if (!cred_store_add_credential(rpId, credId, sizeof(credId), secret, secretLen)) return CTAP2_ERR_KEY_STORE_FULL;
  FIDO_LOG("makeCredential: cred_store_add done");

#if FIDO_MAKECRED_TEST_STAGE == 3
  FIDO_LOG("makeCredential: test-stage 3 (after store)");
  return CTAP2_ERR_INVALID_CBOR;
#endif

  // Build COSE public key
  uint8_t cose[96];
  size_t coseLen = 0;
  FIDO_LOG("makeCredential: build cose start");
  if (!ctap2_build_cose_p256_es256(kp.x, kp.y, cose, sizeof(cose), &coseLen)) return CTAP2_ERR_PROCESSING;
  FIDO_LOG("makeCredential: build cose done len=%u", static_cast<unsigned>(coseLen));

  // Build authenticatorData
  uint8_t rpIdHash[32];
  FIDO_LOG("makeCredential: rpId hash start");
  if (!sha256_ret(reinterpret_cast<const uint8_t*>(rpId), strlen(rpId), rpIdHash)) return CTAP2_ERR_PROCESSING;
  FIDO_LOG("makeCredential: rpId hash done");

  uint8_t authData[256];
  size_t authLen = 0;
  memcpy(authData + authLen, rpIdHash, 32);
  authLen += 32;
  const uint8_t flags = 0x01 /*UP*/ | (pinAuthSatisfied ? 0x04 : 0x00) /*UV*/ | 0x40 /*AT*/;
  authData[authLen++] = flags;
  write_be_u32(authData + authLen, fidoSignCount);
  authLen += 4;
  memcpy(authData + authLen, CTAP_AAGUID, sizeof(CTAP_AAGUID));
  authLen += sizeof(CTAP_AAGUID);
  write_be_u16(authData + authLen, sizeof(credId));
  authLen += 2;
  memcpy(authData + authLen, credId, sizeof(credId));
  authLen += sizeof(credId);
  memcpy(authData + authLen, cose, coseLen);
  authLen += coseLen;

  // Attestation
  const bool attestNone = (attestationProfile == AttestationProfile::None);
  const char* fmt = attestNone ? "none" : "packed";

  uint8_t sigDer[80];
  size_t sigLen = 0;
  if (!attestNone) {
    uint8_t msg[256 + 32];
    const size_t msgLen = authLen + 32;
    memcpy(msg, authData, authLen);
    memcpy(msg + authLen, clientDataHash, 32);
    uint8_t msgHash[32];
    if (!sha256_ret(msg, msgLen, msgHash)) return CTAP2_ERR_PROCESSING;
    if (!ec_sign_der(kp.priv, msgHash, sigDer, sizeof(sigDer), &sigLen)) return CTAP2_ERR_PROCESSING;
  }
  FIDO_LOG("makeCredential: attestation done fmt=%s sigLen=%u", fmt, static_cast<unsigned>(sigLen));

#if FIDO_MAKECRED_TEST_STAGE == 4
  FIDO_LOG("makeCredential: test-stage 4 (after attestation)");
  return CTAP2_ERR_INVALID_CBOR;
#endif

  // Build response map (definite length)
  CborEncoder enc;
  cbor_encoder_init(&enc, out, outMax, 0);
  CborEncoder map;
  if (cbor_encoder_create_map(&enc, &map, 3) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x01) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&map, fmt) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x02) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_byte_string(&map, authData, authLen) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x03) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  CborEncoder att;
  const size_t attPairs = attestNone ? 0 : 2;
  if (cbor_encoder_create_map(&map, &att, attPairs) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (!attestNone) {
    if (cbor_encode_text_stringz(&att, "alg") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_int(&att, -7) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_text_stringz(&att, "sig") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
    if (cbor_encode_byte_string(&att, sigDer, sigLen) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  }
  if (cbor_encoder_close_container(&map, &att) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  *outLen = cbor_encoder_get_buffer_size(&enc, out);
  FIDO_LOG("makeCredential: response cborLen=%u", static_cast<unsigned>(*outLen));
  FIDO_LOG("makeCredential OK rpId=%s credIdLen=%u authDataLen=%u fmt=%s", rpId, static_cast<unsigned>(sizeof(credId)),
           static_cast<unsigned>(authLen), fmt);
  return CTAP2_OK;
}

static uint8_t ctap2_get_assertion(const uint8_t* req, const size_t reqLen, uint8_t* out, const size_t outMax, size_t* outLen) {
  if (!req || !out || !outLen) return CTAP1_ERR_OTHER;
  *outLen = 0;
  if (reqLen == 0) return CTAP2_ERR_INVALID_LENGTH;
  FIDO_LOG("getAssertion: begin reqLen=%u", static_cast<unsigned>(reqLen));

  CborParser parser;
  CborValue root;
  if (cbor_parser_init(req, reqLen, 0, &parser, &root) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  if (!cbor_value_is_map(&root)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
  FIDO_LOG("getAssertion: root is map");

  char rpId[CRED_MAX_RPID_LEN + 1];
  rpId[0] = '\0';
  bool haveRpId = false;
  uint8_t clientDataHash[32] = {0};
  bool haveClientHash = false;
  bool optionUv = false;
  const bool pinGate = security_pin_configured() && !security_pin_unlocked_now();
  bool pinAuthSatisfied = false;
  uint8_t pinUvAuthParam[CTAP_PIN_UV_AUTH_PARAM_LEN] = {0};
  bool havePinUvAuthParam = false;
  int pinUvAuthProtocol = 0;
  bool havePinUvAuthProtocol = false;

  // allowList required in this minimal implementation (non-discoverable credentials)
  static constexpr size_t kMaxAllowCreds = 8;
  uint8_t allowCredIds[kMaxAllowCreds][CRED_MAX_ID_LEN];
  size_t allowCredLens[kMaxAllowCreds] = {0};
  size_t allowCredCount = 0;

  uint8_t selectedCredId[CRED_MAX_ID_LEN];
  size_t selectedCredIdLen = 0;
  uint8_t selectedSecret[CRED_MAX_SECRET_LEN];
  size_t selectedSecretLen = 0;
  bool haveCred = false;

  CborValue it;
  if (cbor_value_enter_container(&root, &it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
  uint16_t topLoopGuard = 0;
  bool minimalParsedEnough = false;
  while (!cbor_value_at_end(&it)) {
    if (++topLoopGuard > 64) return CTAP2_ERR_INVALID_CBOR;
    bool valueConsumedByLeave = false;
    int k = 0;
    if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &k) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    FIDO_LOG("getAssertion: key=%d", k);

