sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
    if (!pinGate && haveRpId && haveClientHash && (k != 0x01) && (k != 0x02)) {
      FIDO_LOG("getAssertion: minimal parse early exit at key=%d", k);
      minimalParsedEnough = true;
      break;
    }
#endif

    if (k == 0x01) {
      if (!cbor_value_is_text_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t idLen = 0;
      if (cbor_value_calculate_string_length(&it, &idLen) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (idLen == 0 || idLen > CRED_MAX_RPID_LEN) return CTAP2_ERR_LIMIT_EXCEEDED;
      size_t copyLen = sizeof(rpId);
      if (cbor_value_copy_text_string(&it, rpId, &copyLen, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      rpId[sizeof(rpId) - 1] = '\0';
      haveRpId = true;
      FIDO_LOG("getAssertion: key 0x01 rpId=%s", rpId);
    } else if (k == 0x02) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != 32) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = sizeof(clientDataHash);
      if (cbor_value_copy_byte_string(&it, clientDataHash, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      haveClientHash = true;
      FIDO_LOG("getAssertion: key 0x02 clientDataHash ok");
    } else if (k == 0x03) {
      if (!cbor_value_is_array(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
#if FIDO_STABILITY_SKIP_CRED_DESCRIPTOR_PARSE
      // Stability mode: skip allowList descriptor parsing; silent probing will
      // return NO_CREDENTIALS without touching descriptor internals.
      FIDO_LOG("getAssertion: key 0x03 skip descriptor parsing");
#else
      CborValue aIt;
      if (cbor_value_enter_container(&it, &aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t allowListLoopGuard = 0;
      while (!cbor_value_at_end(&aIt)) {
        if (++allowListLoopGuard > 16) return CTAP2_ERR_INVALID_CBOR;
        uint8_t cid[CRED_MAX_ID_LEN];
        size_t cidLen = 0;
        bool typePublicKey = false;
        const uint8_t st = ctap2_parse_pubkey_cred_descriptor(&aIt, cid, sizeof(cid), &cidLen, &typePublicKey);
        if (st != CTAP2_OK) return st;
        if (typePublicKey && cidLen > 0) {
          if (allowCredCount >= kMaxAllowCreds) return CTAP2_ERR_LIMIT_EXCEEDED;
          memcpy(allowCredIds[allowCredCount], cid, cidLen);
          allowCredLens[allowCredCount] = cidLen;
          allowCredCount++;
        }
        if (cbor_value_advance(&aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      }
      if (cbor_value_leave_container(&it, &aIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("getAssertion: key 0x03 allowCredCount=%u", static_cast<unsigned>(allowCredCount));
#endif
    } else if (k == 0x05) {
      // options
      if (!cbor_value_is_map(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      CborValue oIt;
      if (cbor_value_enter_container(&it, &oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      uint16_t optionsLoopGuard = 0;
      while (!cbor_value_at_end(&oIt)) {
        if (++optionsLoopGuard > 12) return CTAP2_ERR_INVALID_CBOR;
        if (!cbor_value_is_text_string(&oIt)) return CTAP2_ERR_INVALID_CBOR;
        bool keyIsUv = false;
        if (cbor_value_text_string_equals(&oIt, "uv", &keyIsUv) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (cbor_value_advance(&oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR; // key -> value
        if (!cbor_value_is_boolean(&oIt)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
        bool v = false;
        if (cbor_value_get_boolean(&oIt, &v) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
        if (keyIsUv) optionUv = v;
        if (cbor_value_advance(&oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      }
      if (cbor_value_leave_container(&it, &oIt) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      valueConsumedByLeave = true;
      FIDO_LOG("getAssertion: key 0x05 options uv=%u", static_cast<unsigned>(optionUv));
    } else if (k == 0x06) {
      if (!cbor_value_is_byte_string(&it)) return CTAP2_ERR_CBOR_UNEXPECTED_TYPE;
      size_t n = 0;
      if (cbor_value_calculate_string_length(&it, &n) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (n != CTAP_PIN_UV_AUTH_PARAM_LEN) return CTAP2_ERR_INVALID_LENGTH;
      size_t copy = sizeof(pinUvAuthParam);
      if (cbor_value_copy_byte_string(&it, pinUvAuthParam, &copy, nullptr) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      if (copy != sizeof(pinUvAuthParam)) return CTAP2_ERR_INVALID_LENGTH;
      havePinUvAuthParam = true;
    } else if (k == 0x07) {
      if (!cbor_value_is_integer(&it) || cbor_value_get_int(&it, &pinUvAuthProtocol) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
      havePinUvAuthProtocol = true;
    }

    if (!valueConsumedByLeave) {
      if (cbor_value_advance(&it) != CborNoError) return CTAP2_ERR_INVALID_CBOR;
    }
  }
#if FIDO_STABILITY_MINIMAL_MAKECRED_PARSE
  if (!minimalParsedEnough) cbor_value_leave_container(&root, &it);
#else
  cbor_value_leave_container(&root, &it);
#endif
  FIDO_LOG("getAssertion: parse done haveRpId=%u haveClientHash=%u allowCredCount=%u", static_cast<unsigned>(haveRpId),
           static_cast<unsigned>(haveClientHash), static_cast<unsigned>(allowCredCount));

  if (!haveRpId || !haveClientHash) return CTAP2_ERR_MISSING_PARAMETER;
  if (optionUv) return CTAP2_ERR_UNSUPPORTED_OPTION;
  if (pinGate) {
    if (!fido_client_pin_available()) return CTAP2_ERR_PIN_NOT_SET;
    if (!fido_client_pin_hash_ready()) return CTAP2_ERR_PIN_NOT_SET;
    if (!havePinUvAuthParam || !havePinUvAuthProtocol) return CTAP2_ERR_PIN_REQUIRED;
    if (pinUvAuthProtocol != CTAP_PIN_UV_AUTH_PROTOCOL_1) return CTAP2_ERR_PIN_AUTH_INVALID;
    if (!fido_verify_pin_uv_auth_param(clientDataHash, pinUvAuthParam)) return CTAP2_ERR_PIN_AUTH_INVALID;
    pinAuthSatisfied = true;
  }
  for (size_t i = 0; i < allowCredCount && !haveCred; ++i) {
    char storedRp[CRED_MAX_RPID_LEN + 1];
    uint8_t secret[CRED_MAX_SECRET_LEN];
    size_t secretLen = 0;
    if (cred_store_lookup(allowCredIds[i], allowCredLens[i], storedRp, sizeof(storedRp), secret, &secretLen)) {
      if (strcmp(storedRp, rpId) == 0) {
        memcpy(selectedCredId, allowCredIds[i], allowCredLens[i]);
        selectedCredIdLen = allowCredLens[i];
        memcpy(selectedSecret, secret, secretLen);
        selectedSecretLen = secretLen;
        haveCred = true;
      }
    }
    secure_zero(secret, secretLen);
  }
  if (!haveCred && allowCredCount == 0) {
    if (runtime_cred_lookup_by_rpid(rpId, selectedCredId, sizeof(selectedCredId), &selectedCredIdLen, selectedSecret,
                                    sizeof(selectedSecret), &selectedSecretLen)) {
      haveCred = true;
      FIDO_LOG("getAssertion: runtime rp fallback selected idLen=%u", static_cast<unsigned>(selectedCredIdLen));
    }
  }
  FIDO_LOG("getAssertion: credential matched=%u", static_cast<unsigned>(haveCred));
  if (!haveCred) return CTAP2_ERR_NO_CREDENTIALS;

  bool rk = false;
  uint8_t userHandle[64];
  size_t userHandleLen = 0;
  uint8_t priv[32];
  if (!parse_cred_secret(selectedSecret, selectedSecretLen, &rk, userHandle, &userHandleLen, priv)) {
    secure_zero(selectedSecret, selectedSecretLen);
    return CTAP2_ERR_INVALID_CREDENTIAL;
  }
  secure_zero(selectedSecret, selectedSecretLen);

  // Build authenticatorData
  uint8_t rpIdHash[32];
  if (!sha256_ret(reinterpret_cast<const uint8_t*>(rpId), strlen(rpId), rpIdHash)) return CTAP2_ERR_PROCESSING;

  // Update signCount
  fidoSignCount++;
  save_sign_count(fidoSignCount);

