sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
  uint8_t authData[37];
  memcpy(authData + 0, rpIdHash, 32);
  authData[32] = static_cast<uint8_t>(0x01U | (pinAuthSatisfied ? 0x04U : 0x00U)); // UP + optional UV
  write_be_u32(authData + 33, fidoSignCount);

  // Signature over authData || clientDataHash
  uint8_t msg[37 + 32];
  memcpy(msg, authData, 37);
  memcpy(msg + 37, clientDataHash, 32);
  uint8_t msgHash[32];
  if (!sha256_ret(msg, sizeof(msg), msgHash)) return CTAP2_ERR_PROCESSING;
  uint8_t sigDer[80];
  size_t sigLen = 0;
  if (!ec_sign_der(priv, msgHash, sigDer, sizeof(sigDer), &sigLen)) return CTAP2_ERR_PROCESSING;

  // Build response map (definite length): credential, authData, signature
  CborEncoder enc;
  cbor_encoder_init(&enc, out, outMax, 0);
  CborEncoder map;
  if (cbor_encoder_create_map(&enc, &map, 3) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x01) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  CborEncoder cred;
  if (cbor_encoder_create_map(&map, &cred, 2) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&cred, "type") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&cred, "public-key") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_text_stringz(&cred, "id") != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_byte_string(&cred, selectedCredId, selectedCredIdLen) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encoder_close_container(&map, &cred) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x02) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_byte_string(&map, authData, sizeof(authData)) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_int(&map, 0x03) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encode_byte_string(&map, sigDer, sigLen) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  if (cbor_encoder_close_container(&enc, &map) != CborNoError) return CTAP2_ERR_CBOR_PARSING;
  *outLen = cbor_encoder_get_buffer_size(&enc, out);
  FIDO_LOG("getAssertion OK rpId=%s credIdLen=%u signCount=%lu", rpId, static_cast<unsigned>(selectedCredIdLen),
           static_cast<unsigned long>(fidoSignCount));
  return CTAP2_OK;
}

static uint8_t ctap2_reset() {
  runtime_cred_clear();
#if !FIDO_DISABLE_PERSISTENCE
  cred_store_clear();
#endif
  fidoSignCount = 0;
  save_sign_count(0);
  return CTAP2_OK;
}

// FIDO descriptor with explicit FEATURE report support.
// Some Windows CTAP paths probe/report via HID feature transactions.
static const uint8_t fido_report_descriptor[] = {
  HID_USAGE_PAGE_N(HID_USAGE_PAGE_FIDO, 2),
  HID_USAGE(HID_USAGE_FIDO_U2FHID),
  HID_COLLECTION(HID_COLLECTION_APPLICATION),
#if USB_ENABLE_KBM_HID
    HID_REPORT_ID(FIDO_HID_REPORT_ID)
#endif
    HID_USAGE(HID_USAGE_FIDO_DATA_IN),
    HID_LOGICAL_MIN(0),
    HID_LOGICAL_MAX_N(0xFF, 2),
    HID_REPORT_SIZE(8),
    HID_REPORT_COUNT(FIDO_HID_PACKET_SIZE),
    HID_INPUT(HID_DATA | HID_VARIABLE | HID_ABSOLUTE),
    HID_USAGE(HID_USAGE_FIDO_DATA_OUT),
    HID_LOGICAL_MIN(0),
    HID_LOGICAL_MAX_N(0xFF, 2),
    HID_REPORT_SIZE(8),
    HID_REPORT_COUNT(FIDO_HID_PACKET_SIZE),
    HID_OUTPUT(HID_DATA | HID_VARIABLE | HID_ABSOLUTE),
    HID_USAGE(HID_USAGE_FIDO_DATA_OUT),
    HID_LOGICAL_MIN(0),
    HID_LOGICAL_MAX_N(0xFF, 2),
    HID_REPORT_SIZE(8),
    HID_REPORT_COUNT(FIDO_HID_PACKET_SIZE),
    HID_FEATURE(HID_DATA | HID_VARIABLE | HID_ABSOLUTE),
  HID_COLLECTION_END
};

struct FidoRxState {
  bool active = false;
  uint32_t cid = 0;
  uint8_t cmd = 0;
  uint16_t total = 0;
  uint16_t received = 0;
  uint8_t nextSeq = 0;
  uint32_t lastMs = 0;
};

static FidoRxState fidoRx;

struct FidoRequest {
  volatile bool ready = false;
  uint32_t cid = 0;
  uint8_t cmd = 0;
  uint16_t len = 0;
  uint8_t data[FIDO_MAX_PAYLOAD];
};

static FidoRequest fidoReq;

struct PendingCtap {
  bool active = false;
  uint32_t cid = 0;
  uint8_t cmd = 0; // CTAP command byte
  uint16_t len = 0;
  uint8_t data[FIDO_MAX_PAYLOAD];
  uint32_t startedMs = 0;
  uint32_t lastKeepaliveMs = 0;
  bool sawButtonRelease = false;
  uint32_t buttonDownSinceMs = 0;
};

static PendingCtap pendingCtap;

struct ActiveCtap {
  volatile bool active = false;
  volatile uint32_t cid = 0;
};

static ActiveCtap activeCtap;
static portMUX_TYPE fidoFeatureQueueMux = portMUX_INITIALIZER_UNLOCKED;

static void fido_hid_on_packet(const uint8_t* buffer, uint16_t lenBytes);

class USBHIDFidoDevice final : public USBHIDDevice {
private:
  USBHID hid;
  static constexpr uint8_t FEATURE_QUEUE_DEPTH = 24;
  uint8_t featureQueue[FEATURE_QUEUE_DEPTH][FIDO_HID_PACKET_SIZE];
  uint8_t featureHead = 0;
  uint8_t featureTail = 0;
  uint8_t featureCount = 0;

  void queueFeaturePacket(const uint8_t* data, size_t lenBytes) {
    if (!data || lenBytes != FIDO_HID_PACKET_SIZE) return;
    portENTER_CRITICAL(&fidoFeatureQueueMux);
    memcpy(featureQueue[featureTail], data, FIDO_HID_PACKET_SIZE);
    featureTail = static_cast<uint8_t>((featureTail + 1U) % FEATURE_QUEUE_DEPTH);
    if (featureCount < FEATURE_QUEUE_DEPTH) {
      featureCount++;
    } else {
      // Drop oldest packet when full.
      featureHead = static_cast<uint8_t>((featureHead + 1U) % FEATURE_QUEUE_DEPTH);
    }
    portEXIT_CRITICAL(&fidoFeatureQueueMux);
  }

  bool popFeaturePacket(uint8_t* out) {
    if (!out) return false;
    portENTER_CRITICAL(&fidoFeatureQueueMux);
    if (featureCount == 0) {
      portEXIT_CRITICAL(&fidoFeatureQueueMux);
      return false;
    }
    memcpy(out, featureQueue[featureHead], FIDO_HID_PACKET_SIZE);
    featureHead = static_cast<uint8_t>((featureHead + 1U) % FEATURE_QUEUE_DEPTH);
    featureCount--;
    portEXIT_CRITICAL(&fidoFeatureQueueMux);
    return true;
  }

  void clearFeatureQueue() {
    portENTER_CRITICAL(&fidoFeatureQueueMux);
    featureHead = 0;
    featureTail = 0;
    featureCount = 0;
    portEXIT_CRITICAL(&fidoFeatureQueueMux);
  }

  void dispatchNormalizedPacket(const uint8_t* pkt64) {
    if (!pkt64) return;
    fidoDiag.totalNormalizedPackets++;
    fido_hid_on_packet(pkt64, FIDO_HID_PACKET_SIZE);
  }

  void handleIncomingReport(uint8_t report_id, const uint8_t* buffer, uint16_t lenBytes) {
    if (!buffer) return;
    fidoDiag.lastReportIdSeen = report_id;
    fidoDiag.lastReportLenSeen = lenBytes;
    const bool noReportIdMode = (FIDO_HID_REPORT_ID == HID_REPORT_ID_NONE);
    if (!noReportIdMode && report_id != 0 && report_id != FIDO_HID_REPORT_ID) {
      // Keep parsing anyway: some host paths surface an unexpected report ID even
      // though payload bytes are valid CTAPHID packets.
      fidoDiag.totalUnexpectedReportId++;
      fidoDiag.lastReportIdDropped = report_id;
    }

    if (lenBytes == FIDO_HID_PACKET_SIZE) {
      dispatchNormalizedPacket(buffer);
      return;
    }

    // Most host paths deliver 65-byte reports with a leading report-ID byte.
    // Always normalize by stripping that first byte to avoid misaligned CTAPHID.
    if (lenBytes == (FIDO_HID_PACKET_SIZE + 1)) {
      (void)noReportIdMode;
      dispatchNormalizedPacket(buffer + 1);
      return;
    }

    fidoDiag.totalDroppedBadLen++;
    fidoDiag.lastReportLenDropped = lenBytes;
  }

