sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
public:
  USBHIDFidoDevice() : hid(HID_ITF_PROTOCOL_NONE) {
    static bool initialized = false;
    if (!initialized) {
      initialized = true;
      hid.addDevice(this, sizeof(fido_report_descriptor));
    }
  }

  void begin() {
    hid.begin();
    clearFeatureQueue();
  }

  void clearQueue() { clearFeatureQueue(); }

  void task() {}

  bool sendPacket(const uint8_t* data, const size_t lenBytes) {
    queueFeaturePacket(data, lenBytes);
    return hid.SendReport(FIDO_HID_REPORT_ID, data, lenBytes, 100);
  }

  uint16_t _onGetDescriptor(uint8_t* dst) override {
    memcpy(dst, fido_report_descriptor, sizeof(fido_report_descriptor));
    return sizeof(fido_report_descriptor);
  }

  uint16_t _onGetFeature(uint8_t report_id, uint8_t* buffer, uint16_t lenBytes) override {
    if (!buffer) return 0;
    fidoDiag.totalHidGetFeatureCallbacks++;
    fidoDiag.lastReportIdSeen = report_id;
    fidoDiag.lastReportLenSeen = lenBytes;
    const bool noReportIdMode = (FIDO_HID_REPORT_ID == HID_REPORT_ID_NONE);
    if (!noReportIdMode && report_id != 0 && report_id != FIDO_HID_REPORT_ID) {
      // Accept anyway for compatibility; we still emit a valid FIDO frame.
      fidoDiag.totalUnexpectedReportId++;
      fidoDiag.lastReportIdDropped = report_id;
    }

    uint8_t pkt[FIDO_HID_PACKET_SIZE];
    if (!popFeaturePacket(pkt)) {
      // If host polls before a command is fully processed, answer with keepalive
      // instead of an empty/stale frame.
      uint32_t kaCid = 0;
      uint8_t kaStatus = CTAPHID_KEEPALIVE_STATUS_PROCESSING;
      bool haveKeepalive = false;
      if (pendingCtap.active) {
        haveKeepalive = true;
        kaCid = pendingCtap.cid;
#if FIDO_REQUIRE_BOOT_BUTTON_FOR_UP
        kaStatus = CTAPHID_KEEPALIVE_STATUS_UP_NEEDED;
#endif
      } else if (activeCtap.active) {
        haveKeepalive = true;
        kaCid = activeCtap.cid;
      } else if (fidoReq.ready) {
        haveKeepalive = true;
        kaCid = fidoReq.cid;
      } else if (fidoRx.active) {
        haveKeepalive = true;
        kaCid = fidoRx.cid;
      }

      if (haveKeepalive && kaCid != 0) {
        memset(pkt, 0, sizeof(pkt));
        write_be_u32(pkt + 0, kaCid);
        pkt[4] = static_cast<uint8_t>(0x80U | (CTAPHID_CMD_KEEPALIVE & 0x7FU));
        write_be_u16(pkt + 5, 1);
        pkt[7] = kaStatus;
      } else {
        memset(pkt, 0, sizeof(pkt));
      }
    }

    if (noReportIdMode) {
      // Some host APIs still allocate an extra leading byte for report-id 0.
      if (lenBytes >= (FIDO_HID_PACKET_SIZE + 1U)) {
        buffer[0] = 0;
        memcpy(buffer + 1, pkt, FIDO_HID_PACKET_SIZE);
        return static_cast<uint16_t>(FIDO_HID_PACKET_SIZE + 1U);
      }
      if (lenBytes >= FIDO_HID_PACKET_SIZE) {
        memcpy(buffer, pkt, FIDO_HID_PACKET_SIZE);
        return FIDO_HID_PACKET_SIZE;
      }
      memset(buffer, 0, lenBytes);
      return lenBytes;
    }

    if (lenBytes >= (FIDO_HID_PACKET_SIZE + 1U)) {
      const uint8_t outReportId = (report_id != 0) ? report_id : FIDO_HID_REPORT_ID;
      buffer[0] = outReportId;
      memcpy(buffer + 1, pkt, FIDO_HID_PACKET_SIZE);
      return static_cast<uint16_t>(FIDO_HID_PACKET_SIZE + 1U);
    }
    if (lenBytes >= FIDO_HID_PACKET_SIZE) {
      memcpy(buffer, pkt, FIDO_HID_PACKET_SIZE);
      return FIDO_HID_PACKET_SIZE;
    }
    memset(buffer, 0, lenBytes);
    return lenBytes;
  }

  void _onOutput(uint8_t report_id, const uint8_t* buffer, uint16_t lenBytes) override {
    fidoDiag.totalHidOutCallbacks++;
    handleIncomingReport(report_id, buffer, lenBytes);
  }

  void _onSetFeature(uint8_t report_id, const uint8_t* buffer, uint16_t lenBytes) override {
    // ESP32 Arduino's TinyUSB shim can route report-id traffic via SetFeature.
    // Handle it the same way so CTAPHID packets are not dropped on Windows.
    fidoDiag.totalHidSetFeatureCallbacks++;
    handleIncomingReport(report_id, buffer, lenBytes);
  }
};

static USBHIDFidoDevice fidoHid;

static void fido_send_response(const uint32_t cid, const uint8_t cmd, const uint8_t* payload, const size_t payloadLen) {
  if (cmd != CTAPHID_CMD_KEEPALIVE) {
    FIDO_LOG("TX %s cid=%08lX len=%u", ctaphid_cmd_name(cmd), static_cast<unsigned long>(cid), static_cast<unsigned>(payloadLen));
  }
  uint8_t pkt[FIDO_HID_PACKET_SIZE];
  memset(pkt, 0, sizeof(pkt));
  write_be_u32(pkt + 0, cid);
  pkt[4] = static_cast<uint8_t>(0x80U | (cmd & 0x7FU));
  write_be_u16(pkt + 5, static_cast<uint16_t>(payloadLen));

  const size_t first = (payloadLen > 57) ? 57 : payloadLen;
  if (first && payload) memcpy(pkt + 7, payload, first);
  fidoHid.sendPacket(pkt, sizeof(pkt));

  size_t off = first;
  uint8_t seq = 0;
  while (off < payloadLen) {
    memset(pkt, 0, sizeof(pkt));
    write_be_u32(pkt + 0, cid);
    pkt[4] = seq++;
    const size_t chunk = ((payloadLen - off) > 59) ? 59 : (payloadLen - off);
    memcpy(pkt + 5, payload + off, chunk);
    off += chunk;
    fidoHid.sendPacket(pkt, sizeof(pkt));
  }
}

static void fido_send_error(const uint32_t cid, const uint8_t err) {
  fidoDiag.lastCid = cid;
  fidoDiag.lastHidError = err;
  fidoDiag.lastTxMs = millis();
  FIDO_LOG("TX ERROR cid=%08lX err=%s(0x%02X)", static_cast<unsigned long>(cid), ctaphid_err_name(err), err);
  fido_send_response(cid, CTAPHID_CMD_ERROR, &err, 1);
}

static void fido_send_keepalive(const uint32_t cid, const uint8_t status) {
  fido_send_response(cid, CTAPHID_CMD_KEEPALIVE, &status, 1);
}

static void fido_send_ctap2_status(const uint32_t cid, const uint8_t status, const uint8_t* cbor, const size_t cborLen) {
  fidoDiag.lastCid = cid;
  fidoDiag.lastCtapStatus = status;
  fidoDiag.lastTxMs = millis();
  if (status == CTAP2_OK) {
    fidoDiag.totalCtapOk++;
  } else {
    fidoDiag.totalCtapErr++;
  }
  FIDO_LOG("TX CTAP2 cid=%08lX status=%s(0x%02X) cborLen=%u", static_cast<unsigned long>(cid), ctap2_status_name(status), status,
           static_cast<unsigned>(cborLen));
  uint8_t buf[1 + 512];
  buf[0] = status;
  size_t n = 1;
  if (status == CTAP2_OK && cbor && cborLen > 0) {
    if (cborLen > 512) {
      buf[0] = CTAP2_ERR_REQUEST_TOO_LARGE;
    } else {
      memcpy(buf + 1, cbor, cborLen);
      n = 1 + cborLen;
    }
  }
  fido_send_response(cid, CTAPHID_CMD_CBOR, buf, n);
}

static void fido_hid_on_packet(const uint8_t* buffer, const uint16_t lenBytes) {
  if (!buffer || lenBytes != FIDO_HID_PACKET_SIZE) return;
  const uint32_t cid = read_be_u32(buffer + 0);
  const uint8_t b4 = buffer[4];
  const uint32_t now = millis();
  fidoDiag.lastCid = cid;
  fidoDiag.lastRxMs = now;

  // If a complete request is waiting, report busy.
  if (fidoReq.ready) {
    fido_send_error(cid, CTAPHID_ERR_CHANNEL_BUSY);
    return;
  }

  if (b4 & 0x80) {
    // Initial packet
    const uint8_t cmd = static_cast<uint8_t>(b4 & 0x7F);
    fidoDiag.lastHidCmd = cmd;
    const uint16_t total = static_cast<uint16_t>((static_cast<uint16_t>(buffer[5]) << 8) | buffer[6]);
    FIDO_LOG("RX init cid=%08lX cmd=%s(0x%02X) total=%u", static_cast<unsigned long>(cid), ctaphid_cmd_name(cmd), cmd,
             static_cast<unsigned>(total));
    if (total > FIDO_MAX_PAYLOAD) {
      fido_send_error(cid, CTAPHID_ERR_INVALID_LEN);
      return;
    }

    fidoRx.active = true;
    fidoRx.cid = cid;
    fidoRx.cmd = cmd;
    fidoRx.total = total;
    fidoRx.received = 0;
    fidoRx.nextSeq = 0;
    fidoRx.lastMs = now;

    const size_t first = (total > 57) ? 57 : total;
    if (first) memcpy(fidoReq.data, buffer + 7, first);
    fidoRx.received = static_cast<uint16_t>(first);

