sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
    if (fidoRx.received >= fidoRx.total) {
      fidoReq.cid = cid;
      fidoReq.cmd = cmd;
      fidoReq.len = total;
      fidoReq.ready = true;
      fidoRx.active = false;
    }
    return;
  }

  // Continuation packet
  if (!fidoRx.active || fidoRx.cid != cid) {
    fido_send_error(cid, CTAPHID_ERR_INVALID_SEQ);
    return;
  }
  if (b4 != fidoRx.nextSeq) {
    // Some host paths can replay the immediately previous continuation frame.
    // Ignore harmless duplicates instead of aborting the full transaction.
    if (fidoRx.nextSeq > 0 && b4 == static_cast<uint8_t>(fidoRx.nextSeq - 1U)) {
      fidoRx.lastMs = now;
      return;
    }
    fido_send_error(cid, CTAPHID_ERR_INVALID_SEQ);
    fidoRx.active = false;
    return;
  }
  fidoRx.nextSeq++;
  fidoRx.lastMs = now;

  const uint16_t remaining = static_cast<uint16_t>(fidoRx.total - fidoRx.received);
  const size_t chunk = (remaining > 59) ? 59 : remaining;
  if (chunk) memcpy(fidoReq.data + fidoRx.received, buffer + 5, chunk);
  fidoRx.received = static_cast<uint16_t>(fidoRx.received + chunk);

  if (fidoRx.received >= fidoRx.total) {
    fidoReq.cid = cid;
    fidoReq.cmd = fidoRx.cmd;
    fidoReq.len = fidoRx.total;
    fidoReq.ready = true;
    fidoRx.active = false;
  }
}

static void fido_handle_init(const uint32_t cid, const uint8_t* data, const size_t len) {
  if (len != 8 || !data) {
    fido_send_error(cid, CTAPHID_ERR_INVALID_LEN);
    return;
  }

  uint8_t resp[17];
  memcpy(resp + 0, data, 8);

  // CTAPHID_INIT on an allocated CID is a synchronization request and must echo that CID.
  // CTAPHID_INIT on broadcast allocates a fresh CID.
  uint32_t newCid = cid;
  if (cid == CTAPHID_BROADCAST_CID) {
    do {
      newCid = esp_random();
    } while (newCid == 0 || newCid == CTAPHID_BROADCAST_CID);
  }

  // Synchronize state for the active channel.
  fidoRx.active = false;
  fidoReq.ready = false;
  pendingCtap.active = false;
  fidoAwaitingUserPresence = false;
  fidoHid.clearQueue();
  fidoAssignedCid = newCid;

  write_be_u32(resp + 8, newCid);
  resp[12] = 2;    // CTAPHID protocol version
  resp[13] = 1;    // major
  resp[14] = 0;    // minor
  resp[15] = 0;    // build
  // Match behavior used by known-good TinyUSB implementations (WINK + CBOR).
  resp[16] = static_cast<uint8_t>(CTAPHID_CAP_WINK | CTAPHID_CAP_CBOR);
  fido_send_response(cid, CTAPHID_CMD_INIT, resp, sizeof(resp));
}

static void fido_start_pending(const uint32_t cid, const uint8_t ctapCmd, const uint8_t* data, const size_t len) {
  if (pendingCtap.active) {
    fido_send_ctap2_status(cid, CTAP2_ERR_CHANNEL_BUSY, nullptr, 0);
    return;
  }
  if (len > FIDO_MAX_PAYLOAD) {
    fido_send_ctap2_status(cid, CTAP2_ERR_REQUEST_TOO_LARGE, nullptr, 0);
    return;
  }
  pendingCtap.active = true;
  pendingCtap.cid = cid;
  pendingCtap.cmd = ctapCmd;
  pendingCtap.len = static_cast<uint16_t>(len);
  if (len && data) memcpy(pendingCtap.data, data, len);
  pendingCtap.startedMs = millis();
  pendingCtap.lastKeepaliveMs = pendingCtap.startedMs;
  pendingCtap.sawButtonRelease = !boot_button_down();
  pendingCtap.buttonDownSinceMs = boot_button_down() ? pendingCtap.startedMs : 0;
  fidoAwaitingUserPresence = true;
  fido_send_keepalive(cid, CTAPHID_KEEPALIVE_STATUS_UP_NEEDED);
  FIDO_LOG("Pending start cid=%08lX cmd=%s(0x%02X) len=%u", static_cast<unsigned long>(cid), ctap_cmd_name(ctapCmd), ctapCmd,
           static_cast<unsigned>(len));
}

static void fido_cancel_pending(const uint32_t cid) {
  if (pendingCtap.active && pendingCtap.cid == cid) {
    pendingCtap.active = false;
    fidoAwaitingUserPresence = false;
    FIDO_LOG("Pending cancel cid=%08lX", static_cast<unsigned long>(cid));
    fido_send_ctap2_status(cid, CTAP2_ERR_KEEPALIVE_CANCEL, nullptr, 0);
  }
}

static void fido_handle_cbor(const uint32_t cid, const uint8_t* data, const size_t len) {
  if (!data || len < 1) {
    fido_send_error(cid, CTAPHID_ERR_INVALID_LEN);
    return;
  }
  if (fidoAssignedCid != 0 && cid != fidoAssignedCid) {
    fido_send_error(cid, CTAPHID_ERR_INVALID_CHANNEL);
    return;
  }

  const uint8_t ctapCmd = data[0];
  const uint8_t* payload = data + 1;
  const size_t payloadLen = len - 1;
  fidoDiag.lastCid = cid;
  fidoDiag.lastCtapCmd = ctapCmd;
  fidoDiag.totalCtapRequests++;
  fidoDiag.lastRxMs = millis();
  FIDO_LOG("RX CTAP2 cid=%08lX cmd=%s(0x%02X) payloadLen=%u", static_cast<unsigned long>(cid), ctap_cmd_name(ctapCmd), ctapCmd,
           static_cast<unsigned>(payloadLen));

  if (ctapCmd == CTAP_CMD_GET_INFO) {
    uint8_t body[256];
    size_t bodyLen = 0;
    const uint8_t st = ctap2_get_info(body, sizeof(body), &bodyLen);
    fido_send_ctap2_status(cid, st, body, bodyLen);
    return;
  }

  if (ctapCmd == CTAP_CMD_CLIENT_PIN) {
    uint8_t body[256];
    size_t bodyLen = 0;
    const uint8_t st = ctap2_client_pin(payload, payloadLen, body, sizeof(body), &bodyLen);
    fido_send_ctap2_status(cid, st, body, bodyLen);
    return;
  }

  if (ctapCmd == CTAP_CMD_SELECTION) {
    // Selection is a no-op for this device but should succeed.
    fido_send_ctap2_status(cid, CTAP2_OK, nullptr, 0);
    return;
  }

  if (ctapCmd == CTAP_CMD_BIO_ENROLLMENT || ctapCmd == CTAP_CMD_CREDENTIAL_MANAGEMENT || ctapCmd == CTAP_CMD_LARGE_BLOBS ||
      ctapCmd == CTAP_CMD_CONFIG) {
    // Explicitly report not-allowed instead of invalid-command to improve host compatibility.
    fido_send_ctap2_status(cid, CTAP2_ERR_NOT_ALLOWED, nullptr, 0);
    return;
  }

  if (ctapCmd == CTAP_CMD_GET_NEXT_ASSERTION) {
    fido_send_ctap2_status(cid, CTAP2_ERR_NOT_ALLOWED, nullptr, 0);
    return;
  }

  if (ctapCmd == CTAP_CMD_RESET) {
    // Reset has no pinUvAuthParam field in this implementation; require local unlock window if PIN is configured.
    if (security_pin_configured() && !security_pin_unlocked_now()) {
      fidoDiag.totalPinGateBlocks++;
      FIDO_LOG("Security PIN gate blocked cmd=%s", ctap_cmd_name(ctapCmd));
      fido_send_ctap2_status(cid, CTAP2_ERR_PIN_REQUIRED, nullptr, 0);
      return;
    }
  }

  if (ctapCmd == CTAP_CMD_MAKE_CREDENTIAL) {
#if FIDO_FORCE_DIRECT_MAKECRED_ERROR
    // Isolation mode: prove large request reassembly + immediate CBOR response path.
    fido_send_ctap2_status(cid, CTAP2_ERR_INVALID_CBOR, nullptr, 0);
    return;
#endif
  }

  if (ctapCmd == CTAP_CMD_MAKE_CREDENTIAL || ctapCmd == CTAP_CMD_GET_ASSERTION || ctapCmd == CTAP_CMD_RESET) {
    fido_start_pending(cid, ctapCmd, payload, payloadLen);
    return;
  }

  // For unsupported CTAP commands, prefer NOT_ALLOWED over INVALID_COMMAND for host compatibility.
  fido_send_ctap2_status(cid, CTAP2_ERR_NOT_ALLOWED, nullptr, 0);
}

