sintak15/esp32s3-wifi-kbm/build_clean/sketch/esp32s3-wifi-kbm.ino.cpp
static void fido_process_request() {
  if (!fidoReq.ready) return;
  const uint32_t cid = fidoReq.cid;
  const uint8_t cmd = fidoReq.cmd;
  const uint16_t len = fidoReq.len;
  const uint8_t* data = fidoReq.data;
  FIDO_LOG("Process cid=%08lX cmd=%s(0x%02X) len=%u", static_cast<unsigned long>(cid), ctaphid_cmd_name(cmd), cmd,
           static_cast<unsigned>(len));

  if (cmd == CTAPHID_CMD_INIT) {
    fido_handle_init(cid, data, len);
  } else if (cmd == CTAPHID_CMD_PING) {
    fido_send_response(cid, CTAPHID_CMD_PING, data, len);
  } else if (cmd == CTAPHID_CMD_WINK) {
    // Provide a short visual hint if an LED is present.
    if (led_available()) set_led_rgb(32, 32, 0);
    fido_send_response(cid, CTAPHID_CMD_WINK, nullptr, 0);
  } else if (cmd == CTAPHID_CMD_CANCEL) {
    // CTAPHID_CANCEL never gets a direct HID response.
    fido_cancel_pending(cid);
  } else if (cmd == CTAPHID_CMD_CBOR) {
    fido_handle_cbor(cid, data, len);
  } else if (cmd == CTAPHID_CMD_MSG) {
    fido_send_error(cid, CTAPHID_ERR_INVALID_CMD);
  } else {
    fido_send_error(cid, CTAPHID_ERR_INVALID_CMD);
  }

  fidoReq.ready = false;
}

static void fido_tick_pending() {
  if (!pendingCtap.active) return;

  const uint32_t now = millis();
  const uint32_t cid = pendingCtap.cid;
  bool upSatisfied = false;

  if (static_cast<int32_t>(now - pendingCtap.startedMs) > static_cast<int32_t>(CTAP_UP_TIMEOUT_MS)) {
    pendingCtap.active = false;
    fidoAwaitingUserPresence = false;
    FIDO_LOG("Pending timeout cid=%08lX", static_cast<unsigned long>(cid));
    fido_send_ctap2_status(cid, CTAP2_ERR_USER_ACTION_TIMEOUT, nullptr, 0);
    return;
  }

  if (static_cast<int32_t>(now - pendingCtap.lastKeepaliveMs) >= static_cast<int32_t>(CTAP_KEEPALIVE_EVERY_MS)) {
    pendingCtap.lastKeepaliveMs = now;
    fido_send_keepalive(cid, CTAPHID_KEEPALIVE_STATUS_UP_NEEDED);
  }

  const bool down = boot_button_down();
  if (!pendingCtap.sawButtonRelease) {
    // Require at least one release edge after request start so a stuck-low line
    // cannot satisfy user presence immediately.
    if (!down) {
      pendingCtap.sawButtonRelease = true;
      pendingCtap.buttonDownSinceMs = 0;
    }
    return;
  }

  if (down) {
    if (pendingCtap.buttonDownSinceMs == 0) pendingCtap.buttonDownSinceMs = now;
    upSatisfied = static_cast<int32_t>(now - pendingCtap.buttonDownSinceMs) >= static_cast<int32_t>(CTAP_UP_MIN_HOLD_MS);
  } else {
    pendingCtap.buttonDownSinceMs = 0;
  }
  if (!upSatisfied) return;
  fidoDiag.totalUpSatisfied++;
  FIDO_LOG("User presence satisfied cid=%08lX", static_cast<unsigned long>(cid));

  uint8_t body[512];
  size_t bodyLen = 0;
  uint8_t st = CTAP1_ERR_OTHER;
  activeCtap.cid = cid;
  activeCtap.active = true;

  if (pendingCtap.cmd == CTAP_CMD_MAKE_CREDENTIAL) {
    st = ctap2_make_credential(pendingCtap.data, pendingCtap.len, body, sizeof(body), &bodyLen);
  } else if (pendingCtap.cmd == CTAP_CMD_GET_ASSERTION) {
    st = ctap2_get_assertion(pendingCtap.data, pendingCtap.len, body, sizeof(body), &bodyLen);
  } else if (pendingCtap.cmd == CTAP_CMD_RESET) {
    st = ctap2_reset();
  } else {
    st = CTAP2_ERR_INVALID_COMMAND;
  }
  activeCtap.active = false;

  pendingCtap.active = false;
  fidoAwaitingUserPresence = false;
  fido_send_ctap2_status(cid, st, body, bodyLen);
}

void fido_begin() {
  fidoHid.begin();
  fidoAssignedCid = 0;
  fidoRx.active = false;
  fidoReq.ready = false;
  pendingCtap.active = false;
  activeCtap.active = false;
  activeCtap.cid = 0;
  fidoAwaitingUserPresence = false;
  fidoHid.clearQueue();
  fido_diag_clear();
  runtime_cred_clear();
  esp_fill_random(fidoClientPin.pinUvAuthToken, sizeof(fidoClientPin.pinUvAuthToken));
  fidoClientPin.pinRetries = 8;
  fidoClientPin.keyAgreementReady = false;
  secure_zero(fidoClientPin.keyAgreementPriv, sizeof(fidoClientPin.keyAgreementPriv));
  secure_zero(fidoClientPin.keyAgreementX, sizeof(fidoClientPin.keyAgreementX));
  secure_zero(fidoClientPin.keyAgreementY, sizeof(fidoClientPin.keyAgreementY));
  fidoSignCount = load_sign_count();
  FIDO_LOG("FIDO init signCount=%lu debug=%u", static_cast<unsigned long>(fidoSignCount), static_cast<unsigned>(FIDO_DEBUG));
}

bool fido_waiting_for_user_presence() {
  return pendingCtap.active;
}

void fido_diag_clear() {
  memset(&fidoDiag, 0, sizeof(fidoDiag));
}

void fido_diag_build_json(String& outJson) {
  const uint32_t now = millis();
  const uint32_t rxAgo = (fidoDiag.lastRxMs == 0) ? 0 : static_cast<uint32_t>(now - fidoDiag.lastRxMs);
  const uint32_t txAgo = (fidoDiag.lastTxMs == 0) ? 0 : static_cast<uint32_t>(now - fidoDiag.lastTxMs);

  outJson = "";
  outJson.reserve(1200);
  outJson += "{";
  outJson += "\"last_cid\":";
  outJson += String(fidoDiag.lastCid);
  outJson += ",\"last_hid_cmd\":";
  outJson += String(fidoDiag.lastHidCmd);
  outJson += ",\"last_hid_cmd_name\":\"";
  outJson += ctaphid_cmd_name(fidoDiag.lastHidCmd);
  outJson += "\"";
  outJson += ",\"last_ctap_cmd\":";
  outJson += String(fidoDiag.lastCtapCmd);
  outJson += ",\"last_ctap_cmd_name\":\"";
  outJson += ctap_cmd_name(fidoDiag.lastCtapCmd);
  outJson += "\"";
  outJson += ",\"last_ctap_status\":";
  outJson += String(fidoDiag.lastCtapStatus);
  outJson += ",\"last_ctap_status_name\":\"";
  outJson += ctap2_status_name(fidoDiag.lastCtapStatus);
  outJson += "\"";
  outJson += ",\"last_hid_error\":";
  outJson += String(fidoDiag.lastHidError);
  outJson += ",\"last_hid_error_name\":\"";
  outJson += ctaphid_err_name(fidoDiag.lastHidError);
  outJson += "\"";
  outJson += ",\"last_report_id_seen\":";
  outJson += String(fidoDiag.lastReportIdSeen);
  outJson += ",\"last_report_len_seen\":";
  outJson += String(fidoDiag.lastReportLenSeen);
  outJson += ",\"last_report_id_dropped\":";
  outJson += String(fidoDiag.lastReportIdDropped);
  outJson += ",\"last_report_len_dropped\":";
  outJson += String(fidoDiag.lastReportLenDropped);
  outJson += ",\"pending_waiting_up\":";
  outJson += (pendingCtap.active ? "true" : "false");
  outJson += ",\"rx_ms_ago\":";
  outJson += String(rxAgo);
  outJson += ",\"tx_ms_ago\":";
  outJson += String(txAgo);
  outJson += ",\"ctap_requests_total\":";
  outJson += String(fidoDiag.totalCtapRequests);
  outJson += ",\"ctap_ok_total\":";
  outJson += String(fidoDiag.totalCtapOk);
  outJson += ",\"ctap_err_total\":";
  outJson += String(fidoDiag.totalCtapErr);
  outJson += ",\"pin_gate_blocks_total\":";
  outJson += String(fidoDiag.totalPinGateBlocks);
  outJson += ",\"up_satisfied_total\":";
  outJson += String(fidoDiag.totalUpSatisfied);
  outJson += ",\"hid_out_callbacks_total\":";
  outJson += String(fidoDiag.totalHidOutCallbacks);
  outJson += ",\"hid_set_feature_callbacks_total\":";
  outJson += String(fidoDiag.totalHidSetFeatureCallbacks);
  outJson += ",\"hid_get_feature_callbacks_total\":";
  outJson += String(fidoDiag.totalHidGetFeatureCallbacks);
  outJson += ",\"unexpected_report_id_total\":";
  outJson += String(fidoDiag.totalUnexpectedReportId);
  outJson += ",\"dropped_bad_len_total\":";
  outJson += String(fidoDiag.totalDroppedBadLen);
  outJson += ",\"normalized_packets_total\":";
  outJson += String(fidoDiag.totalNormalizedPackets);
  outJson += "}";
}

void fido_task() {
  fidoHid.task();
  // Drop partial messages that time out.
  if (fidoRx.active && (static_cast<int32_t>(millis() - fidoRx.lastMs) > 1000)) {
    fidoRx.active = false;
  }

  fido_process_request();
  fido_tick_pending();
}

